Duet3D/Duet3Expansion/src/atmel/SAMB11_DFP/2.3.190/atdf/ATSAMB11G18A.atdf
<?xml version="1.0" encoding="UTF-8"?>
<!-- ============================================================================ -->
<!--                  Atmel Microcontroller Software Support                      -->
<!-- ============================================================================ -->
<!-- Copyright (c) 2015, Atmel Corporation                                        -->
<!--                                                                              -->
<!-- All rights reserved.                                                         -->
<!--                                                                              -->
<!-- Redistribution and use in source and binary forms, with or without           -->
<!-- modification, are permitted provided that the following condition is met:    -->
<!--                                                                              -->
<!-- - Redistributions of source code must retain the above copyright notice,     -->
<!-- this list of conditions and the disclaimer below.                            -->
<!--                                                                              -->
<!-- Atmel's name may not be used to endorse or promote products derived from     -->
<!-- this software without specific prior written permission.                     -->
<!--                                                                              -->
<!-- DISCLAIMER: THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR    -->
<!-- IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF -->
<!-- MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE   -->
<!-- DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,      -->
<!-- INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT -->
<!-- LIMITED TO, PROCUREMENT OF SUBSTITUE GOODS OR SERVICES; LOSS OF USE, DATA,   -->
<!-- OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSE AND ON ANY THEORY OF     -->
<!-- LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING         -->
<!-- NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, -->
<!-- EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                           -->
<!-- ============================================================================ -->
<avr-tools-device-file xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="1.2" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd">
  <variants>
    <variant ordercode="ATSAMB11G18A-MU" package="QFN48" pinout="SAMB11G" speedmax="26000000" tempmin="-40" tempmax="85" vccmin="2.30" vccmax="3.60"/>
  </variants>
  <devices>
    <device name="ATSAMB11G18A" architecture="CORTEX-M0" family="SAMB" series="SAMB11">
      <address-spaces>
        <address-space id="base" name="base" start="0" size="0x10042000" endianness="little">
          <memory-segment name="BOOTROM" start="0x0" size="0x20000" type="rom"/>
          <memory-segment name="IDRAM" start="0x10000000" size="0x20000" type="ram"/>
          <memory-segment name="BLERAM" start="0x10040000" size="0x2000" type="ram"/>
          <memory-segment name="APB" start="0x40000000" size="0x20000" type="io"/>
        </address-space>
      <address-space id="extflash" name="extflash" start="0" size="0x20000"/></address-spaces>
      <parameters>
        <param name="PIO_API" value="samb"/>
        <param name="LITTLE_ENDIAN" value="1"/>
        <param name="__FPU_PRESENT" value="0"/>
        <param name="__CM0_REV" value="0x00"/>
        <param name="__NVIC_PRIO_BITS" value="2"/>
        <param name="__Vendor_SysTickConfig" value="0"/>
      </parameters>
      <peripherals>
        <module name="TIMER" id="T11234" version="1.0.0">
          <instance name="TIMER0">
            <register-group name="TIMER0" name-in-module="TIMER" address-space="base" offset="0x40000000"/>
          </instance>
        </module>
        <module name="DUALTIMER" id="DT1234" version="1.0.0">
          <instance name="DUALTIMER0">
            <register-group name="DUALTIMER0" name-in-module="DUALTIMER" address-space="base" offset="0x40001000"/>
          </instance>
        </module>
        <module name="PROV_DMA_CTRL" id="PDC1234" version="1.0.0">
          <instance name="PROV_DMA_CTRL0">
            <register-group name="PROV_DMA_CTRL0" name-in-module="PROV_DMA_CTRL" address-space="base" offset="0x40002000"/>
          </instance>
        </module>
        <module name="I2C" id="I1234" version="1.0.0">
          <instance name="I2C0">
            <register-group name="I2C0" name-in-module="I2C" address-space="base" offset="0x40003000"/>
            <signals>
              <signal group="SDA" function="M_I2C0_SDA" pad="LP_GPIO_8"/>
              <signal group="SCL" function="M_I2C0_SCL" pad="LP_GPIO_9"/>
              <signal group="SDA" function="M_I2C0_SDA" pad="LP_GPIO_0"/>
              <signal group="SDA" function="M_I2C0_SDA" pad="LP_GPIO_1"/>
              <signal group="SDA" function="M_I2C0_SDA" pad="LP_GPIO_2"/>
              <signal group="SDA" function="M_I2C0_SDA" pad="LP_GPIO_3"/>
              <signal group="SDA" function="M_I2C0_SDA" pad="LP_GPIO_4"/>
              <signal group="SDA" function="M_I2C0_SDA" pad="LP_GPIO_5"/>
              <signal group="SDA" function="M_I2C0_SDA" pad="LP_GPIO_6"/>
              <signal group="SDA" function="M_I2C0_SDA" pad="LP_GPIO_7"/>
              <signal group="SDA" function="M_I2C0_SDA" pad="LP_GPIO_9"/>
              <signal group="SDA" function="M_I2C0_SDA" pad="LP_GPIO_10"/>
              <signal group="SDA" function="M_I2C0_SDA" pad="LP_GPIO_11"/>
              <signal group="SDA" function="M_I2C0_SDA" pad="LP_GPIO_12"/>
              <signal group="SDA" function="M_I2C0_SDA" pad="LP_GPIO_13"/>
              <signal group="SDA" function="M_I2C0_SDA" pad="LP_GPIO_14"/>
              <signal group="SDA" function="M_I2C0_SDA" pad="LP_GPIO_15"/>
              <signal group="SDA" function="M_I2C0_SDA" pad="LP_GPIO_16"/>
              <signal group="SDA" function="M_I2C0_SDA" pad="LP_GPIO_17"/>
              <signal group="SDA" function="M_I2C0_SDA" pad="LP_GPIO_18"/>
              <signal group="SDA" function="M_I2C0_SDA" pad="LP_GPIO_19"/>
              <signal group="SDA" function="M_I2C0_SDA" pad="LP_GPIO_20"/>
              <signal group="SDA" function="M_I2C0_SDA" pad="LP_GPIO_22"/>
              <signal group="SDA" function="M_I2C0_SDA" pad="LP_GPIO_23"/>
              <signal group="SCL" function="M_I2C0_SCL" pad="LP_GPIO_0"/>
              <signal group="SCL" function="M_I2C0_SCL" pad="LP_GPIO_1"/>
              <signal group="SCL" function="M_I2C0_SCL" pad="LP_GPIO_2"/>
              <signal group="SCL" function="M_I2C0_SCL" pad="LP_GPIO_3"/>
              <signal group="SCL" function="M_I2C0_SCL" pad="LP_GPIO_4"/>
              <signal group="SCL" function="M_I2C0_SCL" pad="LP_GPIO_5"/>
              <signal group="SCL" function="M_I2C0_SCL" pad="LP_GPIO_6"/>
              <signal group="SCL" function="M_I2C0_SCL" pad="LP_GPIO_7"/>
              <signal group="SCL" function="M_I2C0_SCL" pad="LP_GPIO_8"/>
              <signal group="SCL" function="M_I2C0_SCL" pad="LP_GPIO_10"/>
              <signal group="SCL" function="M_I2C0_SCL" pad="LP_GPIO_11"/>
              <signal group="SCL" function="M_I2C0_SCL" pad="LP_GPIO_12"/>
              <signal group="SCL" function="M_I2C0_SCL" pad="LP_GPIO_13"/>
              <signal group="SCL" function="M_I2C0_SCL" pad="LP_GPIO_14"/>
              <signal group="SCL" function="M_I2C0_SCL" pad="LP_GPIO_15"/>
              <signal group="SCL" function="M_I2C0_SCL" pad="LP_GPIO_16"/>
              <signal group="SCL" function="M_I2C0_SCL" pad="LP_GPIO_17"/>
              <signal group="SCL" function="M_I2C0_SCL" pad="LP_GPIO_18"/>
              <signal group="SCL" function="M_I2C0_SCL" pad="LP_GPIO_19"/>
              <signal group="SCL" function="M_I2C0_SCL" pad="LP_GPIO_20"/>
              <signal group="SCL" function="M_I2C0_SCL" pad="LP_GPIO_22"/>
              <signal group="SCL" function="M_I2C0_SCL" pad="LP_GPIO_23"/>
            </signals>
          </instance>
          <instance name="I2C1">
            <register-group name="I2C1" name-in-module="I2C" address-space="base" offset="0x40003400"/>
            <signals>
              <signal group="SDA" function="M_I2C1_SDA" pad="LP_GPIO_14"/>
              <signal group="SCL" function="M_I2C1_SCL" pad="LP_GPIO_15"/>
              <signal group="SDA" function="M_I2C1_SDA" pad="LP_GPIO_0"/>
              <signal group="SDA" function="M_I2C1_SDA" pad="LP_GPIO_1"/>
              <signal group="SDA" function="M_I2C1_SDA" pad="LP_GPIO_2"/>
              <signal group="SDA" function="M_I2C1_SDA" pad="LP_GPIO_3"/>
              <signal group="SDA" function="M_I2C1_SDA" pad="LP_GPIO_4"/>
              <signal group="SDA" function="M_I2C1_SDA" pad="LP_GPIO_5"/>
              <signal group="SDA" function="M_I2C1_SDA" pad="LP_GPIO_6"/>
              <signal group="SDA" function="M_I2C1_SDA" pad="LP_GPIO_7"/>
              <signal group="SDA" function="M_I2C1_SDA" pad="LP_GPIO_8"/>
              <signal group="SDA" function="M_I2C1_SDA" pad="LP_GPIO_9"/>
              <signal group="SDA" function="M_I2C1_SDA" pad="LP_GPIO_10"/>
              <signal group="SDA" function="M_I2C1_SDA" pad="LP_GPIO_11"/>
              <signal group="SDA" function="M_I2C1_SDA" pad="LP_GPIO_12"/>
              <signal group="SDA" function="M_I2C1_SDA" pad="LP_GPIO_13"/>
              <signal group="SDA" function="M_I2C1_SDA" pad="LP_GPIO_15"/>
              <signal group="SDA" function="M_I2C1_SDA" pad="LP_GPIO_16"/>
              <signal group="SDA" function="M_I2C1_SDA" pad="LP_GPIO_17"/>
              <signal group="SDA" function="M_I2C1_SDA" pad="LP_GPIO_18"/>
              <signal group="SDA" function="M_I2C1_SDA" pad="LP_GPIO_19"/>
              <signal group="SDA" function="M_I2C1_SDA" pad="LP_GPIO_20"/>
              <signal group="SDA" function="M_I2C1_SDA" pad="LP_GPIO_22"/>
              <signal group="SDA" function="M_I2C1_SDA" pad="LP_GPIO_23"/>
              <signal group="SCL" function="M_I2C1_SCL" pad="LP_GPIO_0"/>
              <signal group="SCL" function="M_I2C1_SCL" pad="LP_GPIO_1"/>
              <signal group="SCL" function="M_I2C1_SCL" pad="LP_GPIO_2"/>
              <signal group="SCL" function="M_I2C1_SCL" pad="LP_GPIO_3"/>
              <signal group="SCL" function="M_I2C1_SCL" pad="LP_GPIO_4"/>
              <signal group="SCL" function="M_I2C1_SCL" pad="LP_GPIO_5"/>
              <signal group="SCL" function="M_I2C1_SCL" pad="LP_GPIO_6"/>
              <signal group="SCL" function="M_I2C1_SCL" pad="LP_GPIO_7"/>
              <signal group="SCL" function="M_I2C1_SCL" pad="LP_GPIO_8"/>
              <signal group="SCL" function="M_I2C1_SCL" pad="LP_GPIO_9"/>
              <signal group="SCL" function="M_I2C1_SCL" pad="LP_GPIO_10"/>
              <signal group="SCL" function="M_I2C1_SCL" pad="LP_GPIO_11"/>
              <signal group="SCL" function="M_I2C1_SCL" pad="LP_GPIO_12"/>
              <signal group="SCL" function="M_I2C1_SCL" pad="LP_GPIO_13"/>
              <signal group="SCL" function="M_I2C1_SCL" pad="LP_GPIO_14"/>
              <signal group="SCL" function="M_I2C1_SCL" pad="LP_GPIO_16"/>
              <signal group="SCL" function="M_I2C1_SCL" pad="LP_GPIO_17"/>
              <signal group="SCL" function="M_I2C1_SCL" pad="LP_GPIO_18"/>
              <signal group="SCL" function="M_I2C1_SCL" pad="LP_GPIO_19"/>
              <signal group="SCL" function="M_I2C1_SCL" pad="LP_GPIO_20"/>
              <signal group="SCL" function="M_I2C1_SCL" pad="LP_GPIO_22"/>
              <signal group="SCL" function="M_I2C1_SCL" pad="LP_GPIO_23"/>
            </signals>
          </instance>
        </module>
