Duet3D/Duet3Expansion/src/atmel/SAMB11_DFP/2.3.190/atdf/ATSAMB11G18A.atdf
        <module name="UART" id="U1234" version="1.0.0">
          <instance name="UART0">
            <register-group name="UART0" name-in-module="UART" address-space="base" offset="0x40004000"/>
            <signals>
              <signal group="RXD" function="M_UART0_RXD" pad="LP_GPIO_2"/>
              <signal group="TXD" function="M_UART0_TXD" pad="LP_GPIO_3"/>
              <signal group="CTS" function="M_UART0_CTS" pad="LP_GPIO_4"/>
              <signal group="RTS" function="M_UART0_RTS" pad="LP_GPIO_5"/>
              <signal group="RXD" function="M_UART0_RXD" pad="LP_GPIO_0"/>
              <signal group="RXD" function="M_UART0_RXD" pad="LP_GPIO_1"/>
              <signal group="RXD" function="M_UART0_RXD" pad="LP_GPIO_3"/>
              <signal group="RXD" function="M_UART0_RXD" pad="LP_GPIO_4"/>
              <signal group="RXD" function="M_UART0_RXD" pad="LP_GPIO_5"/>
              <signal group="RXD" function="M_UART0_RXD" pad="LP_GPIO_6"/>
              <signal group="RXD" function="M_UART0_RXD" pad="LP_GPIO_7"/>
              <signal group="RXD" function="M_UART0_RXD" pad="LP_GPIO_8"/>
              <signal group="RXD" function="M_UART0_RXD" pad="LP_GPIO_9"/>
              <signal group="RXD" function="M_UART0_RXD" pad="LP_GPIO_10"/>
              <signal group="RXD" function="M_UART0_RXD" pad="LP_GPIO_11"/>
              <signal group="RXD" function="M_UART0_RXD" pad="LP_GPIO_12"/>
              <signal group="RXD" function="M_UART0_RXD" pad="LP_GPIO_13"/>
              <signal group="RXD" function="M_UART0_RXD" pad="LP_GPIO_14"/>
              <signal group="RXD" function="M_UART0_RXD" pad="LP_GPIO_15"/>
              <signal group="RXD" function="M_UART0_RXD" pad="LP_GPIO_16"/>
              <signal group="RXD" function="M_UART0_RXD" pad="LP_GPIO_17"/>
              <signal group="RXD" function="M_UART0_RXD" pad="LP_GPIO_18"/>
              <signal group="RXD" function="M_UART0_RXD" pad="LP_GPIO_19"/>
              <signal group="RXD" function="M_UART0_RXD" pad="LP_GPIO_20"/>
              <signal group="RXD" function="M_UART0_RXD" pad="LP_GPIO_22"/>
              <signal group="RXD" function="M_UART0_RXD" pad="LP_GPIO_23"/>
              <signal group="TXD" function="M_UART0_TXD" pad="LP_GPIO_0"/>
              <signal group="TXD" function="M_UART0_TXD" pad="LP_GPIO_1"/>
              <signal group="TXD" function="M_UART0_TXD" pad="LP_GPIO_2"/>
              <signal group="TXD" function="M_UART0_TXD" pad="LP_GPIO_4"/>
              <signal group="TXD" function="M_UART0_TXD" pad="LP_GPIO_5"/>
              <signal group="TXD" function="M_UART0_TXD" pad="LP_GPIO_6"/>
              <signal group="TXD" function="M_UART0_TXD" pad="LP_GPIO_7"/>
              <signal group="TXD" function="M_UART0_TXD" pad="LP_GPIO_8"/>
              <signal group="TXD" function="M_UART0_TXD" pad="LP_GPIO_9"/>
              <signal group="TXD" function="M_UART0_TXD" pad="LP_GPIO_10"/>
              <signal group="TXD" function="M_UART0_TXD" pad="LP_GPIO_11"/>
              <signal group="TXD" function="M_UART0_TXD" pad="LP_GPIO_12"/>
              <signal group="TXD" function="M_UART0_TXD" pad="LP_GPIO_13"/>
              <signal group="TXD" function="M_UART0_TXD" pad="LP_GPIO_14"/>
              <signal group="TXD" function="M_UART0_TXD" pad="LP_GPIO_15"/>
              <signal group="TXD" function="M_UART0_TXD" pad="LP_GPIO_16"/>
              <signal group="TXD" function="M_UART0_TXD" pad="LP_GPIO_17"/>
              <signal group="TXD" function="M_UART0_TXD" pad="LP_GPIO_18"/>
              <signal group="TXD" function="M_UART0_TXD" pad="LP_GPIO_19"/>
              <signal group="TXD" function="M_UART0_TXD" pad="LP_GPIO_20"/>
              <signal group="TXD" function="M_UART0_TXD" pad="LP_GPIO_22"/>
              <signal group="TXD" function="M_UART0_TXD" pad="LP_GPIO_23"/>
              <signal group="CTS" function="M_UART0_CTS" pad="LP_GPIO_0"/>
              <signal group="CTS" function="M_UART0_CTS" pad="LP_GPIO_1"/>
              <signal group="CTS" function="M_UART0_CTS" pad="LP_GPIO_2"/>
              <signal group="CTS" function="M_UART0_CTS" pad="LP_GPIO_3"/>
              <signal group="CTS" function="M_UART0_CTS" pad="LP_GPIO_5"/>
              <signal group="CTS" function="M_UART0_CTS" pad="LP_GPIO_6"/>
              <signal group="CTS" function="M_UART0_CTS" pad="LP_GPIO_7"/>
              <signal group="CTS" function="M_UART0_CTS" pad="LP_GPIO_8"/>
              <signal group="CTS" function="M_UART0_CTS" pad="LP_GPIO_9"/>
              <signal group="CTS" function="M_UART0_CTS" pad="LP_GPIO_10"/>
              <signal group="CTS" function="M_UART0_CTS" pad="LP_GPIO_11"/>
              <signal group="CTS" function="M_UART0_CTS" pad="LP_GPIO_12"/>
              <signal group="CTS" function="M_UART0_CTS" pad="LP_GPIO_13"/>
              <signal group="CTS" function="M_UART0_CTS" pad="LP_GPIO_14"/>
              <signal group="CTS" function="M_UART0_CTS" pad="LP_GPIO_15"/>
              <signal group="CTS" function="M_UART0_CTS" pad="LP_GPIO_16"/>
              <signal group="CTS" function="M_UART0_CTS" pad="LP_GPIO_17"/>
              <signal group="CTS" function="M_UART0_CTS" pad="LP_GPIO_18"/>
              <signal group="CTS" function="M_UART0_CTS" pad="LP_GPIO_19"/>
              <signal group="CTS" function="M_UART0_CTS" pad="LP_GPIO_20"/>
              <signal group="CTS" function="M_UART0_CTS" pad="LP_GPIO_22"/>
              <signal group="CTS" function="M_UART0_CTS" pad="LP_GPIO_23"/>
              <signal group="RTS" function="M_UART0_RTS" pad="LP_GPIO_0"/>
              <signal group="RTS" function="M_UART0_RTS" pad="LP_GPIO_1"/>
              <signal group="RTS" function="M_UART0_RTS" pad="LP_GPIO_2"/>
              <signal group="RTS" function="M_UART0_RTS" pad="LP_GPIO_3"/>
              <signal group="RTS" function="M_UART0_RTS" pad="LP_GPIO_4"/>
              <signal group="RTS" function="M_UART0_RTS" pad="LP_GPIO_6"/>
              <signal group="RTS" function="M_UART0_RTS" pad="LP_GPIO_7"/>
              <signal group="RTS" function="M_UART0_RTS" pad="LP_GPIO_8"/>
              <signal group="RTS" function="M_UART0_RTS" pad="LP_GPIO_9"/>
              <signal group="RTS" function="M_UART0_RTS" pad="LP_GPIO_10"/>
              <signal group="RTS" function="M_UART0_RTS" pad="LP_GPIO_11"/>
              <signal group="RTS" function="M_UART0_RTS" pad="LP_GPIO_12"/>
              <signal group="RTS" function="M_UART0_RTS" pad="LP_GPIO_13"/>
              <signal group="RTS" function="M_UART0_RTS" pad="LP_GPIO_14"/>
              <signal group="RTS" function="M_UART0_RTS" pad="LP_GPIO_15"/>
              <signal group="RTS" function="M_UART0_RTS" pad="LP_GPIO_16"/>
              <signal group="RTS" function="M_UART0_RTS" pad="LP_GPIO_17"/>
              <signal group="RTS" function="M_UART0_RTS" pad="LP_GPIO_18"/>
              <signal group="RTS" function="M_UART0_RTS" pad="LP_GPIO_19"/>
              <signal group="RTS" function="M_UART0_RTS" pad="LP_GPIO_20"/>
              <signal group="RTS" function="M_UART0_RTS" pad="LP_GPIO_22"/>
              <signal group="RTS" function="M_UART0_RTS" pad="LP_GPIO_23"/>
            </signals>
          </instance>
          <instance name="UART1">
            <register-group name="UART1" name-in-module="UART" address-space="base" offset="0x40005000"/>
            <signals>
              <signal group="RXD" function="M_UART1_RXD" pad="LP_GPIO_6"/>
              <signal group="TXD" function="M_UART1_TXD" pad="LP_GPIO_7"/>
              <signal group="CTS" function="M_UART1_CTS" pad="LP_GPIO_14"/>
              <signal group="RTS" function="M_UART1_RTS" pad="LP_GPIO_15"/>
              <signal group="RXD" function="M_UART1_RXD" pad="LP_GPIO_0"/>
              <signal group="RXD" function="M_UART1_RXD" pad="LP_GPIO_1"/>
              <signal group="RXD" function="M_UART1_RXD" pad="LP_GPIO_2"/>
              <signal group="RXD" function="M_UART1_RXD" pad="LP_GPIO_3"/>
              <signal group="RXD" function="M_UART1_RXD" pad="LP_GPIO_4"/>
              <signal group="RXD" function="M_UART1_RXD" pad="LP_GPIO_5"/>
              <signal group="RXD" function="M_UART1_RXD" pad="LP_GPIO_7"/>
              <signal group="RXD" function="M_UART1_RXD" pad="LP_GPIO_8"/>
              <signal group="RXD" function="M_UART1_RXD" pad="LP_GPIO_9"/>
              <signal group="RXD" function="M_UART1_RXD" pad="LP_GPIO_10"/>
              <signal group="RXD" function="M_UART1_RXD" pad="LP_GPIO_11"/>
              <signal group="RXD" function="M_UART1_RXD" pad="LP_GPIO_12"/>
              <signal group="RXD" function="M_UART1_RXD" pad="LP_GPIO_13"/>
              <signal group="RXD" function="M_UART1_RXD" pad="LP_GPIO_14"/>
              <signal group="RXD" function="M_UART1_RXD" pad="LP_GPIO_15"/>
              <signal group="RXD" function="M_UART1_RXD" pad="LP_GPIO_16"/>
              <signal group="RXD" function="M_UART1_RXD" pad="LP_GPIO_17"/>
              <signal group="RXD" function="M_UART1_RXD" pad="LP_GPIO_18"/>
              <signal group="RXD" function="M_UART1_RXD" pad="LP_GPIO_19"/>
              <signal group="RXD" function="M_UART1_RXD" pad="LP_GPIO_20"/>
              <signal group="RXD" function="M_UART1_RXD" pad="LP_GPIO_22"/>
              <signal group="RXD" function="M_UART1_RXD" pad="LP_GPIO_23"/>
              <signal group="TXD" function="M_UART1_TXD" pad="LP_GPIO_0"/>
              <signal group="TXD" function="M_UART1_TXD" pad="LP_GPIO_1"/>
              <signal group="TXD" function="M_UART1_TXD" pad="LP_GPIO_2"/>
              <signal group="TXD" function="M_UART1_TXD" pad="LP_GPIO_3"/>
              <signal group="TXD" function="M_UART1_TXD" pad="LP_GPIO_4"/>
              <signal group="TXD" function="M_UART1_TXD" pad="LP_GPIO_5"/>
              <signal group="TXD" function="M_UART1_TXD" pad="LP_GPIO_6"/>
              <signal group="TXD" function="M_UART1_TXD" pad="LP_GPIO_8"/>
              <signal group="TXD" function="M_UART1_TXD" pad="LP_GPIO_9"/>
              <signal group="TXD" function="M_UART1_TXD" pad="LP_GPIO_10"/>
              <signal group="TXD" function="M_UART1_TXD" pad="LP_GPIO_11"/>
              <signal group="TXD" function="M_UART1_TXD" pad="LP_GPIO_12"/>
              <signal group="TXD" function="M_UART1_TXD" pad="LP_GPIO_13"/>
              <signal group="TXD" function="M_UART1_TXD" pad="LP_GPIO_14"/>
              <signal group="TXD" function="M_UART1_TXD" pad="LP_GPIO_15"/>
              <signal group="TXD" function="M_UART1_TXD" pad="LP_GPIO_16"/>
              <signal group="TXD" function="M_UART1_TXD" pad="LP_GPIO_17"/>
              <signal group="TXD" function="M_UART1_TXD" pad="LP_GPIO_18"/>
              <signal group="TXD" function="M_UART1_TXD" pad="LP_GPIO_19"/>
              <signal group="TXD" function="M_UART1_TXD" pad="LP_GPIO_20"/>
              <signal group="TXD" function="M_UART1_TXD" pad="LP_GPIO_22"/>
              <signal group="TXD" function="M_UART1_TXD" pad="LP_GPIO_23"/>
              <signal group="CTS" function="M_UART1_CTS" pad="LP_GPIO_0"/>
              <signal group="CTS" function="M_UART1_CTS" pad="LP_GPIO_1"/>
              <signal group="CTS" function="M_UART1_CTS" pad="LP_GPIO_2"/>
              <signal group="CTS" function="M_UART1_CTS" pad="LP_GPIO_3"/>
              <signal group="CTS" function="M_UART1_CTS" pad="LP_GPIO_4"/>
              <signal group="CTS" function="M_UART1_CTS" pad="LP_GPIO_5"/>
              <signal group="CTS" function="M_UART1_CTS" pad="LP_GPIO_6"/>
              <signal group="CTS" function="M_UART1_CTS" pad="LP_GPIO_7"/>
              <signal group="CTS" function="M_UART1_CTS" pad="LP_GPIO_8"/>
              <signal group="CTS" function="M_UART1_CTS" pad="LP_GPIO_9"/>
              <signal group="CTS" function="M_UART1_CTS" pad="LP_GPIO_10"/>
              <signal group="CTS" function="M_UART1_CTS" pad="LP_GPIO_11"/>
              <signal group="CTS" function="M_UART1_CTS" pad="LP_GPIO_12"/>
              <signal group="CTS" function="M_UART1_CTS" pad="LP_GPIO_13"/>
              <signal group="CTS" function="M_UART1_CTS" pad="LP_GPIO_15"/>
              <signal group="CTS" function="M_UART1_CTS" pad="LP_GPIO_16"/>
              <signal group="CTS" function="M_UART1_CTS" pad="LP_GPIO_17"/>
              <signal group="CTS" function="M_UART1_CTS" pad="LP_GPIO_18"/>
              <signal group="CTS" function="M_UART1_CTS" pad="LP_GPIO_19"/>
              <signal group="CTS" function="M_UART1_CTS" pad="LP_GPIO_20"/>
              <signal group="CTS" function="M_UART1_CTS" pad="LP_GPIO_22"/>
              <signal group="CTS" function="M_UART1_CTS" pad="LP_GPIO_23"/>
              <signal group="RTS" function="M_UART1_RTS" pad="LP_GPIO_0"/>
              <signal group="RTS" function="M_UART1_RTS" pad="LP_GPIO_1"/>
              <signal group="RTS" function="M_UART1_RTS" pad="LP_GPIO_2"/>
              <signal group="RTS" function="M_UART1_RTS" pad="LP_GPIO_3"/>
              <signal group="RTS" function="M_UART1_RTS" pad="LP_GPIO_4"/>
              <signal group="RTS" function="M_UART1_RTS" pad="LP_GPIO_5"/>
              <signal group="RTS" function="M_UART1_RTS" pad="LP_GPIO_6"/>
              <signal group="RTS" function="M_UART1_RTS" pad="LP_GPIO_7"/>
              <signal group="RTS" function="M_UART1_RTS" pad="LP_GPIO_8"/>
              <signal group="RTS" function="M_UART1_RTS" pad="LP_GPIO_9"/>
              <signal group="RTS" function="M_UART1_RTS" pad="LP_GPIO_10"/>
              <signal group="RTS" function="M_UART1_RTS" pad="LP_GPIO_11"/>
              <signal group="RTS" function="M_UART1_RTS" pad="LP_GPIO_12"/>
              <signal group="RTS" function="M_UART1_RTS" pad="LP_GPIO_13"/>
              <signal group="RTS" function="M_UART1_RTS" pad="LP_GPIO_14"/>
              <signal group="RTS" function="M_UART1_RTS" pad="LP_GPIO_16"/>
              <signal group="RTS" function="M_UART1_RTS" pad="LP_GPIO_17"/>
              <signal group="RTS" function="M_UART1_RTS" pad="LP_GPIO_18"/>
              <signal group="RTS" function="M_UART1_RTS" pad="LP_GPIO_19"/>
              <signal group="RTS" function="M_UART1_RTS" pad="LP_GPIO_20"/>
              <signal group="RTS" function="M_UART1_RTS" pad="LP_GPIO_22"/>
              <signal group="RTS" function="M_UART1_RTS" pad="LP_GPIO_23"/>
            </signals>
          </instance>
        </module>
