Duet3D/Duet3Expansion/src/atmel/SAMB11_DFP/2.3.190/atdf/ATSAMB11G18A.atdf
        <module name="SPI" id="S1234" version="1.0.0">
          <instance name="SPI0">
            <register-group name="SPI0" name-in-module="SPI" address-space="base" offset="0x40006000"/>
            <signals>
              <signal group="SCK" function="SPI0_SCK" pad="LP_GPIO_2"/>
              <signal group="SCK" function="SPI0_SCK" pad="LP_GPIO_6"/>
              <signal group="SCK" function="SPI0_SCK" pad="LP_GPIO_16"/>
              <signal group="SCK" function="SPI0_SCK" pad="LP_GPIO_10"/>
              <signal group="MOSI" function="SPI0_MOSI" pad="LP_GPIO_3"/>
              <signal group="MOSI" function="SPI0_MOSI" pad="LP_GPIO_7"/>
              <signal group="MOSI" function="SPI0_MOSI" pad="LP_GPIO_17"/>
              <signal group="MOSI" function="SPI0_MOSI" pad="LP_GPIO_11"/>
              <signal group="SSN" function="SPI0_SSN" pad="LP_GPIO_4"/>
              <signal group="SSN" function="SPI0_SSN" pad="LP_GPIO_8"/>
              <signal group="SSN" function="SPI0_SSN" pad="LP_GPIO_18"/>
              <signal group="SSN" function="SPI0_SSN" pad="LP_GPIO_12"/>
              <signal group="MISO" function="SPI0_MISO" pad="LP_GPIO_5"/>
              <signal group="MISO" function="SPI0_MISO" pad="LP_GPIO_9"/>
              <signal group="MISO" function="SPI0_MISO" pad="LP_GPIO_19"/>
              <signal group="MISO" function="SPI0_MISO" pad="LP_GPIO_13"/>
            </signals>
          </instance>
          <instance name="SPI1">
            <register-group name="SPI1" name-in-module="SPI" address-space="base" offset="0x40007000"/>
            <signals>
              <signal group="SCK" function="SPI1_SCK" pad="LP_GPIO_2"/>
              <signal group="SCK" function="SPI1_SCK" pad="LP_GPIO_17"/>
              <signal group="MOSI" function="SPI1_MOSI" pad="LP_GPIO_3"/>
              <signal group="MOSI" function="SPI1_MOSI" pad="LP_GPIO_19"/>
              <signal group="SSN" function="SPI1_SSN" pad="LP_GPIO_4"/>
              <signal group="SSN" function="SPI1_SSN" pad="LP_GPIO_16"/>
              <signal group="MISO" function="SPI1_MISO" pad="LP_GPIO_5"/>
              <signal group="MISO" function="SPI1_MISO" pad="LP_GPIO_18"/>
            </signals>
          </instance>
        </module>
        <module name="WDT" id="W1234" version="1.0.0">
          <instance name="WDT0">
            <register-group name="WDT0" name-in-module="WDT" address-space="base" offset="0x40008000"/>
          </instance>
          <instance name="WDT1">
            <register-group name="WDT1" name-in-module="WDT" address-space="base" offset="0x40009000"/>
          </instance>
        </module>
        <module name="EFUSE_MISC_REGS" id="EMR1234" version="1.0.0">
          <instance name="EFUSE_MISC_REGS0">
            <register-group name="EFUSE_MISC_REGS0" name-in-module="EFUSE_MISC_REGS" address-space="base" offset="0x4000A000"/>
          </instance>
        </module>
        <module name="LPMCU_MISC_REGS" id="LMR1234" version="1.0.0">
          <instance name="LPMCU_MISC_REGS0">
            <register-group name="LPMCU_MISC_REGS0" name-in-module="LPMCU_MISC_REGS" address-space="base" offset="0x4000B000"/>
            <signals>
              <signal group="PWM0_OUT" function="M_PWM0_OUT" pad="LP_GPIO_0"/>
              <signal group="PWM0_OUT" function="M_PWM0_OUT" pad="LP_GPIO_1"/>
              <signal group="PWM0_OUT" function="M_PWM0_OUT" pad="LP_GPIO_2"/>
              <signal group="PWM0_OUT" function="M_PWM0_OUT" pad="LP_GPIO_3"/>
              <signal group="PWM0_OUT" function="M_PWM0_OUT" pad="LP_GPIO_4"/>
              <signal group="PWM0_OUT" function="M_PWM0_OUT" pad="LP_GPIO_5"/>
              <signal group="PWM0_OUT" function="M_PWM0_OUT" pad="LP_GPIO_6"/>
              <signal group="PWM0_OUT" function="M_PWM0_OUT" pad="LP_GPIO_7"/>
              <signal group="PWM0_OUT" function="M_PWM0_OUT" pad="LP_GPIO_8"/>
              <signal group="PWM0_OUT" function="M_PWM0_OUT" pad="LP_GPIO_9"/>
              <signal group="PWM0_OUT" function="M_PWM0_OUT" pad="LP_GPIO_10"/>
              <signal group="PWM0_OUT" function="M_PWM0_OUT" pad="LP_GPIO_11"/>
              <signal group="PWM0_OUT" function="M_PWM0_OUT" pad="LP_GPIO_12"/>
              <signal group="PWM0_OUT" function="M_PWM0_OUT" pad="LP_GPIO_13"/>
              <signal group="PWM0_OUT" function="M_PWM0_OUT" pad="LP_GPIO_14"/>
              <signal group="PWM0_OUT" function="M_PWM0_OUT" pad="LP_GPIO_15"/>
              <signal group="PWM0_OUT" function="M_PWM0_OUT" pad="LP_GPIO_16"/>
              <signal group="PWM0_OUT" function="M_PWM0_OUT" pad="LP_GPIO_17"/>
              <signal group="PWM0_OUT" function="M_PWM0_OUT" pad="LP_GPIO_18"/>
              <signal group="PWM0_OUT" function="M_PWM0_OUT" pad="LP_GPIO_19"/>
              <signal group="PWM0_OUT" function="M_PWM0_OUT" pad="LP_GPIO_20"/>
              <signal group="PWM0_OUT" function="M_PWM0_OUT" pad="LP_GPIO_22"/>
              <signal group="PWM0_OUT" function="M_PWM0_OUT" pad="LP_GPIO_23"/>
              <signal group="PWM1_OUT" function="M_PWM1_OUT" pad="LP_GPIO_0"/>
              <signal group="PWM1_OUT" function="M_PWM1_OUT" pad="LP_GPIO_1"/>
              <signal group="PWM1_OUT" function="M_PWM1_OUT" pad="LP_GPIO_2"/>
              <signal group="PWM1_OUT" function="M_PWM1_OUT" pad="LP_GPIO_3"/>
              <signal group="PWM1_OUT" function="M_PWM1_OUT" pad="LP_GPIO_4"/>
              <signal group="PWM1_OUT" function="M_PWM1_OUT" pad="LP_GPIO_5"/>
              <signal group="PWM1_OUT" function="M_PWM1_OUT" pad="LP_GPIO_6"/>
              <signal group="PWM1_OUT" function="M_PWM1_OUT" pad="LP_GPIO_7"/>
              <signal group="PWM1_OUT" function="M_PWM1_OUT" pad="LP_GPIO_8"/>
              <signal group="PWM1_OUT" function="M_PWM1_OUT" pad="LP_GPIO_9"/>
              <signal group="PWM1_OUT" function="M_PWM1_OUT" pad="LP_GPIO_10"/>
              <signal group="PWM1_OUT" function="M_PWM1_OUT" pad="LP_GPIO_11"/>
              <signal group="PWM1_OUT" function="M_PWM1_OUT" pad="LP_GPIO_12"/>
              <signal group="PWM1_OUT" function="M_PWM1_OUT" pad="LP_GPIO_13"/>
              <signal group="PWM1_OUT" function="M_PWM1_OUT" pad="LP_GPIO_14"/>
              <signal group="PWM1_OUT" function="M_PWM1_OUT" pad="LP_GPIO_15"/>
              <signal group="PWM1_OUT" function="M_PWM1_OUT" pad="LP_GPIO_16"/>
              <signal group="PWM1_OUT" function="M_PWM1_OUT" pad="LP_GPIO_17"/>
              <signal group="PWM1_OUT" function="M_PWM1_OUT" pad="LP_GPIO_18"/>
              <signal group="PWM1_OUT" function="M_PWM1_OUT" pad="LP_GPIO_19"/>
              <signal group="PWM1_OUT" function="M_PWM1_OUT" pad="LP_GPIO_20"/>
              <signal group="PWM1_OUT" function="M_PWM1_OUT" pad="LP_GPIO_22"/>
              <signal group="PWM1_OUT" function="M_PWM1_OUT" pad="LP_GPIO_23"/>
              <signal group="PWM2_OUT" function="M_PWM2_OUT" pad="LP_GPIO_0"/>
              <signal group="PWM2_OUT" function="M_PWM2_OUT" pad="LP_GPIO_1"/>
              <signal group="PWM2_OUT" function="M_PWM2_OUT" pad="LP_GPIO_2"/>
              <signal group="PWM2_OUT" function="M_PWM2_OUT" pad="LP_GPIO_3"/>
              <signal group="PWM2_OUT" function="M_PWM2_OUT" pad="LP_GPIO_4"/>
              <signal group="PWM2_OUT" function="M_PWM2_OUT" pad="LP_GPIO_5"/>
              <signal group="PWM2_OUT" function="M_PWM2_OUT" pad="LP_GPIO_6"/>
              <signal group="PWM2_OUT" function="M_PWM2_OUT" pad="LP_GPIO_7"/>
              <signal group="PWM2_OUT" function="M_PWM2_OUT" pad="LP_GPIO_8"/>
              <signal group="PWM2_OUT" function="M_PWM2_OUT" pad="LP_GPIO_9"/>
              <signal group="PWM2_OUT" function="M_PWM2_OUT" pad="LP_GPIO_10"/>
              <signal group="PWM2_OUT" function="M_PWM2_OUT" pad="LP_GPIO_11"/>
              <signal group="PWM2_OUT" function="M_PWM2_OUT" pad="LP_GPIO_12"/>
              <signal group="PWM2_OUT" function="M_PWM2_OUT" pad="LP_GPIO_13"/>
              <signal group="PWM2_OUT" function="M_PWM2_OUT" pad="LP_GPIO_14"/>
              <signal group="PWM2_OUT" function="M_PWM2_OUT" pad="LP_GPIO_15"/>
              <signal group="PWM2_OUT" function="M_PWM2_OUT" pad="LP_GPIO_16"/>
              <signal group="PWM2_OUT" function="M_PWM2_OUT" pad="LP_GPIO_17"/>
              <signal group="PWM2_OUT" function="M_PWM2_OUT" pad="LP_GPIO_18"/>
              <signal group="PWM2_OUT" function="M_PWM2_OUT" pad="LP_GPIO_19"/>
              <signal group="PWM2_OUT" function="M_PWM2_OUT" pad="LP_GPIO_20"/>
              <signal group="PWM2_OUT" function="M_PWM2_OUT" pad="LP_GPIO_22"/>
              <signal group="PWM2_OUT" function="M_PWM2_OUT" pad="LP_GPIO_23"/>
              <signal group="PWM3_OUT" function="M_PWM3_OUT" pad="LP_GPIO_0"/>
              <signal group="PWM3_OUT" function="M_PWM3_OUT" pad="LP_GPIO_1"/>
              <signal group="PWM3_OUT" function="M_PWM3_OUT" pad="LP_GPIO_2"/>
              <signal group="PWM3_OUT" function="M_PWM3_OUT" pad="LP_GPIO_3"/>
              <signal group="PWM3_OUT" function="M_PWM3_OUT" pad="LP_GPIO_4"/>
              <signal group="PWM3_OUT" function="M_PWM3_OUT" pad="LP_GPIO_5"/>
              <signal group="PWM3_OUT" function="M_PWM3_OUT" pad="LP_GPIO_6"/>
              <signal group="PWM3_OUT" function="M_PWM3_OUT" pad="LP_GPIO_7"/>
              <signal group="PWM3_OUT" function="M_PWM3_OUT" pad="LP_GPIO_8"/>
              <signal group="PWM3_OUT" function="M_PWM3_OUT" pad="LP_GPIO_9"/>
              <signal group="PWM3_OUT" function="M_PWM3_OUT" pad="LP_GPIO_10"/>
              <signal group="PWM3_OUT" function="M_PWM3_OUT" pad="LP_GPIO_11"/>
              <signal group="PWM3_OUT" function="M_PWM3_OUT" pad="LP_GPIO_12"/>
              <signal group="PWM3_OUT" function="M_PWM3_OUT" pad="LP_GPIO_13"/>
              <signal group="PWM3_OUT" function="M_PWM3_OUT" pad="LP_GPIO_14"/>
              <signal group="PWM3_OUT" function="M_PWM3_OUT" pad="LP_GPIO_15"/>
              <signal group="PWM3_OUT" function="M_PWM3_OUT" pad="LP_GPIO_16"/>
              <signal group="PWM3_OUT" function="M_PWM3_OUT" pad="LP_GPIO_17"/>
              <signal group="PWM3_OUT" function="M_PWM3_OUT" pad="LP_GPIO_18"/>
              <signal group="PWM3_OUT" function="M_PWM3_OUT" pad="LP_GPIO_19"/>
              <signal group="PWM3_OUT" function="M_PWM3_OUT" pad="LP_GPIO_20"/>
              <signal group="PWM3_OUT" function="M_PWM3_OUT" pad="LP_GPIO_22"/>
              <signal group="PWM3_OUT" function="M_PWM3_OUT" pad="LP_GPIO_23"/>
              <signal group="QUAD_DEC0_A" function="M_QUAD_DEC0_A" pad="LP_GPIO_0"/>
              <signal group="QUAD_DEC0_A" function="M_QUAD_DEC0_A" pad="LP_GPIO_1"/>
              <signal group="QUAD_DEC0_A" function="M_QUAD_DEC0_A" pad="LP_GPIO_2"/>
              <signal group="QUAD_DEC0_A" function="M_QUAD_DEC0_A" pad="LP_GPIO_3"/>
              <signal group="QUAD_DEC0_A" function="M_QUAD_DEC0_A" pad="LP_GPIO_4"/>
              <signal group="QUAD_DEC0_A" function="M_QUAD_DEC0_A" pad="LP_GPIO_5"/>
              <signal group="QUAD_DEC0_A" function="M_QUAD_DEC0_A" pad="LP_GPIO_6"/>
              <signal group="QUAD_DEC0_A" function="M_QUAD_DEC0_A" pad="LP_GPIO_7"/>
              <signal group="QUAD_DEC0_A" function="M_QUAD_DEC0_A" pad="LP_GPIO_8"/>
              <signal group="QUAD_DEC0_A" function="M_QUAD_DEC0_A" pad="LP_GPIO_9"/>
              <signal group="QUAD_DEC0_A" function="M_QUAD_DEC0_A" pad="LP_GPIO_10"/>
              <signal group="QUAD_DEC0_A" function="M_QUAD_DEC0_A" pad="LP_GPIO_11"/>
              <signal group="QUAD_DEC0_A" function="M_QUAD_DEC0_A" pad="LP_GPIO_12"/>
              <signal group="QUAD_DEC0_A" function="M_QUAD_DEC0_A" pad="LP_GPIO_13"/>
              <signal group="QUAD_DEC0_A" function="M_QUAD_DEC0_A" pad="LP_GPIO_14"/>
              <signal group="QUAD_DEC0_A" function="M_QUAD_DEC0_A" pad="LP_GPIO_15"/>
              <signal group="QUAD_DEC0_A" function="M_QUAD_DEC0_A" pad="LP_GPIO_16"/>
              <signal group="QUAD_DEC0_A" function="M_QUAD_DEC0_A" pad="LP_GPIO_17"/>
              <signal group="QUAD_DEC0_A" function="M_QUAD_DEC0_A" pad="LP_GPIO_18"/>
              <signal group="QUAD_DEC0_A" function="M_QUAD_DEC0_A" pad="LP_GPIO_19"/>
              <signal group="QUAD_DEC0_A" function="M_QUAD_DEC0_A" pad="LP_GPIO_20"/>
              <signal group="QUAD_DEC0_A" function="M_QUAD_DEC0_A" pad="LP_GPIO_22"/>
              <signal group="QUAD_DEC0_A" function="M_QUAD_DEC0_A" pad="LP_GPIO_23"/>
              <signal group="QUAD_DEC0_B" function="M_QUAD_DEC0_B" pad="LP_GPIO_0"/>
              <signal group="QUAD_DEC0_B" function="M_QUAD_DEC0_B" pad="LP_GPIO_1"/>
              <signal group="QUAD_DEC0_B" function="M_QUAD_DEC0_B" pad="LP_GPIO_2"/>
              <signal group="QUAD_DEC0_B" function="M_QUAD_DEC0_B" pad="LP_GPIO_3"/>
              <signal group="QUAD_DEC0_B" function="M_QUAD_DEC0_B" pad="LP_GPIO_4"/>
              <signal group="QUAD_DEC0_B" function="M_QUAD_DEC0_B" pad="LP_GPIO_5"/>
              <signal group="QUAD_DEC0_B" function="M_QUAD_DEC0_B" pad="LP_GPIO_6"/>
              <signal group="QUAD_DEC0_B" function="M_QUAD_DEC0_B" pad="LP_GPIO_7"/>
              <signal group="QUAD_DEC0_B" function="M_QUAD_DEC0_B" pad="LP_GPIO_8"/>
              <signal group="QUAD_DEC0_B" function="M_QUAD_DEC0_B" pad="LP_GPIO_9"/>
              <signal group="QUAD_DEC0_B" function="M_QUAD_DEC0_B" pad="LP_GPIO_10"/>
              <signal group="QUAD_DEC0_B" function="M_QUAD_DEC0_B" pad="LP_GPIO_11"/>
              <signal group="QUAD_DEC0_B" function="M_QUAD_DEC0_B" pad="LP_GPIO_12"/>
              <signal group="QUAD_DEC0_B" function="M_QUAD_DEC0_B" pad="LP_GPIO_13"/>
              <signal group="QUAD_DEC0_B" function="M_QUAD_DEC0_B" pad="LP_GPIO_14"/>
              <signal group="QUAD_DEC0_B" function="M_QUAD_DEC0_B" pad="LP_GPIO_15"/>
              <signal group="QUAD_DEC0_B" function="M_QUAD_DEC0_B" pad="LP_GPIO_16"/>
              <signal group="QUAD_DEC0_B" function="M_QUAD_DEC0_B" pad="LP_GPIO_17"/>
              <signal group="QUAD_DEC0_B" function="M_QUAD_DEC0_B" pad="LP_GPIO_18"/>
              <signal group="QUAD_DEC0_B" function="M_QUAD_DEC0_B" pad="LP_GPIO_19"/>
              <signal group="QUAD_DEC0_B" function="M_QUAD_DEC0_B" pad="LP_GPIO_20"/>
              <signal group="QUAD_DEC0_B" function="M_QUAD_DEC0_B" pad="LP_GPIO_22"/>
              <signal group="QUAD_DEC0_B" function="M_QUAD_DEC0_B" pad="LP_GPIO_23"/>
              <signal group="QUAD_DEC1_A" function="M_QUAD_DEC1_A" pad="LP_GPIO_0"/>
              <signal group="QUAD_DEC1_A" function="M_QUAD_DEC1_A" pad="LP_GPIO_1"/>
              <signal group="QUAD_DEC1_A" function="M_QUAD_DEC1_A" pad="LP_GPIO_2"/>
              <signal group="QUAD_DEC1_A" function="M_QUAD_DEC1_A" pad="LP_GPIO_3"/>
              <signal group="QUAD_DEC1_A" function="M_QUAD_DEC1_A" pad="LP_GPIO_4"/>
              <signal group="QUAD_DEC1_A" function="M_QUAD_DEC1_A" pad="LP_GPIO_5"/>
              <signal group="QUAD_DEC1_A" function="M_QUAD_DEC1_A" pad="LP_GPIO_6"/>
              <signal group="QUAD_DEC1_A" function="M_QUAD_DEC1_A" pad="LP_GPIO_7"/>
              <signal group="QUAD_DEC1_A" function="M_QUAD_DEC1_A" pad="LP_GPIO_8"/>
              <signal group="QUAD_DEC1_A" function="M_QUAD_DEC1_A" pad="LP_GPIO_9"/>
              <signal group="QUAD_DEC1_A" function="M_QUAD_DEC1_A" pad="LP_GPIO_10"/>
              <signal group="QUAD_DEC1_A" function="M_QUAD_DEC1_A" pad="LP_GPIO_11"/>
              <signal group="QUAD_DEC1_A" function="M_QUAD_DEC1_A" pad="LP_GPIO_12"/>
              <signal group="QUAD_DEC1_A" function="M_QUAD_DEC1_A" pad="LP_GPIO_13"/>
              <signal group="QUAD_DEC1_A" function="M_QUAD_DEC1_A" pad="LP_GPIO_14"/>
              <signal group="QUAD_DEC1_A" function="M_QUAD_DEC1_A" pad="LP_GPIO_15"/>
              <signal group="QUAD_DEC1_A" function="M_QUAD_DEC1_A" pad="LP_GPIO_16"/>
              <signal group="QUAD_DEC1_A" function="M_QUAD_DEC1_A" pad="LP_GPIO_17"/>
              <signal group="QUAD_DEC1_A" function="M_QUAD_DEC1_A" pad="LP_GPIO_18"/>
              <signal group="QUAD_DEC1_A" function="M_QUAD_DEC1_A" pad="LP_GPIO_19"/>
              <signal group="QUAD_DEC1_A" function="M_QUAD_DEC1_A" pad="LP_GPIO_20"/>
              <signal group="QUAD_DEC1_A" function="M_QUAD_DEC1_A" pad="LP_GPIO_22"/>
              <signal group="QUAD_DEC1_A" function="M_QUAD_DEC1_A" pad="LP_GPIO_23"/>
              <signal group="QUAD_DEC1_B" function="M_QUAD_DEC1_B" pad="LP_GPIO_0"/>
              <signal group="QUAD_DEC1_B" function="M_QUAD_DEC1_B" pad="LP_GPIO_1"/>
              <signal group="QUAD_DEC1_B" function="M_QUAD_DEC1_B" pad="LP_GPIO_2"/>
              <signal group="QUAD_DEC1_B" function="M_QUAD_DEC1_B" pad="LP_GPIO_3"/>
              <signal group="QUAD_DEC1_B" function="M_QUAD_DEC1_B" pad="LP_GPIO_4"/>
              <signal group="QUAD_DEC1_B" function="M_QUAD_DEC1_B" pad="LP_GPIO_5"/>
              <signal group="QUAD_DEC1_B" function="M_QUAD_DEC1_B" pad="LP_GPIO_6"/>
              <signal group="QUAD_DEC1_B" function="M_QUAD_DEC1_B" pad="LP_GPIO_7"/>
              <signal group="QUAD_DEC1_B" function="M_QUAD_DEC1_B" pad="LP_GPIO_8"/>
              <signal group="QUAD_DEC1_B" function="M_QUAD_DEC1_B" pad="LP_GPIO_9"/>
              <signal group="QUAD_DEC1_B" function="M_QUAD_DEC1_B" pad="LP_GPIO_10"/>
              <signal group="QUAD_DEC1_B" function="M_QUAD_DEC1_B" pad="LP_GPIO_11"/>
              <signal group="QUAD_DEC1_B" function="M_QUAD_DEC1_B" pad="LP_GPIO_12"/>
              <signal group="QUAD_DEC1_B" function="M_QUAD_DEC1_B" pad="LP_GPIO_13"/>
              <signal group="QUAD_DEC1_B" function="M_QUAD_DEC1_B" pad="LP_GPIO_14"/>
              <signal group="QUAD_DEC1_B" function="M_QUAD_DEC1_B" pad="LP_GPIO_15"/>
              <signal group="QUAD_DEC1_B" function="M_QUAD_DEC1_B" pad="LP_GPIO_16"/>
              <signal group="QUAD_DEC1_B" function="M_QUAD_DEC1_B" pad="LP_GPIO_17"/>
              <signal group="QUAD_DEC1_B" function="M_QUAD_DEC1_B" pad="LP_GPIO_18"/>
              <signal group="QUAD_DEC1_B" function="M_QUAD_DEC1_B" pad="LP_GPIO_19"/>
              <signal group="QUAD_DEC1_B" function="M_QUAD_DEC1_B" pad="LP_GPIO_20"/>
              <signal group="QUAD_DEC1_B" function="M_QUAD_DEC1_B" pad="LP_GPIO_22"/>
              <signal group="QUAD_DEC1_B" function="M_QUAD_DEC1_B" pad="LP_GPIO_23"/>
              <signal group="QUAD_DEC2_A" function="M_QUAD_DEC2_A" pad="LP_GPIO_0"/>
              <signal group="QUAD_DEC2_A" function="M_QUAD_DEC2_A" pad="LP_GPIO_1"/>
              <signal group="QUAD_DEC2_A" function="M_QUAD_DEC2_A" pad="LP_GPIO_2"/>
              <signal group="QUAD_DEC2_A" function="M_QUAD_DEC2_A" pad="LP_GPIO_3"/>
              <signal group="QUAD_DEC2_A" function="M_QUAD_DEC2_A" pad="LP_GPIO_4"/>
              <signal group="QUAD_DEC2_A" function="M_QUAD_DEC2_A" pad="LP_GPIO_5"/>
              <signal group="QUAD_DEC2_A" function="M_QUAD_DEC2_A" pad="LP_GPIO_6"/>
              <signal group="QUAD_DEC2_A" function="M_QUAD_DEC2_A" pad="LP_GPIO_7"/>
              <signal group="QUAD_DEC2_A" function="M_QUAD_DEC2_A" pad="LP_GPIO_8"/>
              <signal group="QUAD_DEC2_A" function="M_QUAD_DEC2_A" pad="LP_GPIO_9"/>
              <signal group="QUAD_DEC2_A" function="M_QUAD_DEC2_A" pad="LP_GPIO_10"/>
              <signal group="QUAD_DEC2_A" function="M_QUAD_DEC2_A" pad="LP_GPIO_11"/>
              <signal group="QUAD_DEC2_A" function="M_QUAD_DEC2_A" pad="LP_GPIO_12"/>
              <signal group="QUAD_DEC2_A" function="M_QUAD_DEC2_A" pad="LP_GPIO_13"/>
              <signal group="QUAD_DEC2_A" function="M_QUAD_DEC2_A" pad="LP_GPIO_14"/>
              <signal group="QUAD_DEC2_A" function="M_QUAD_DEC2_A" pad="LP_GPIO_15"/>
              <signal group="QUAD_DEC2_A" function="M_QUAD_DEC2_A" pad="LP_GPIO_16"/>
              <signal group="QUAD_DEC2_A" function="M_QUAD_DEC2_A" pad="LP_GPIO_17"/>
              <signal group="QUAD_DEC2_A" function="M_QUAD_DEC2_A" pad="LP_GPIO_18"/>
              <signal group="QUAD_DEC2_A" function="M_QUAD_DEC2_A" pad="LP_GPIO_19"/>
              <signal group="QUAD_DEC2_A" function="M_QUAD_DEC2_A" pad="LP_GPIO_20"/>
              <signal group="QUAD_DEC2_A" function="M_QUAD_DEC2_A" pad="LP_GPIO_22"/>
              <signal group="QUAD_DEC2_A" function="M_QUAD_DEC2_A" pad="LP_GPIO_23"/>
              <signal group="QUAD_DEC2_B" function="M_QUAD_DEC2_B" pad="LP_GPIO_0"/>
              <signal group="QUAD_DEC2_B" function="M_QUAD_DEC2_B" pad="LP_GPIO_1"/>
              <signal group="QUAD_DEC2_B" function="M_QUAD_DEC2_B" pad="LP_GPIO_2"/>
              <signal group="QUAD_DEC2_B" function="M_QUAD_DEC2_B" pad="LP_GPIO_3"/>
              <signal group="QUAD_DEC2_B" function="M_QUAD_DEC2_B" pad="LP_GPIO_4"/>
              <signal group="QUAD_DEC2_B" function="M_QUAD_DEC2_B" pad="LP_GPIO_5"/>
              <signal group="QUAD_DEC2_B" function="M_QUAD_DEC2_B" pad="LP_GPIO_6"/>
              <signal group="QUAD_DEC2_B" function="M_QUAD_DEC2_B" pad="LP_GPIO_7"/>
              <signal group="QUAD_DEC2_B" function="M_QUAD_DEC2_B" pad="LP_GPIO_8"/>
              <signal group="QUAD_DEC2_B" function="M_QUAD_DEC2_B" pad="LP_GPIO_9"/>
              <signal group="QUAD_DEC2_B" function="M_QUAD_DEC2_B" pad="LP_GPIO_10"/>
              <signal group="QUAD_DEC2_B" function="M_QUAD_DEC2_B" pad="LP_GPIO_11"/>
              <signal group="QUAD_DEC2_B" function="M_QUAD_DEC2_B" pad="LP_GPIO_12"/>
              <signal group="QUAD_DEC2_B" function="M_QUAD_DEC2_B" pad="LP_GPIO_13"/>
              <signal group="QUAD_DEC2_B" function="M_QUAD_DEC2_B" pad="LP_GPIO_14"/>
              <signal group="QUAD_DEC2_B" function="M_QUAD_DEC2_B" pad="LP_GPIO_15"/>
              <signal group="QUAD_DEC2_B" function="M_QUAD_DEC2_B" pad="LP_GPIO_16"/>
              <signal group="QUAD_DEC2_B" function="M_QUAD_DEC2_B" pad="LP_GPIO_17"/>
              <signal group="QUAD_DEC2_B" function="M_QUAD_DEC2_B" pad="LP_GPIO_18"/>
              <signal group="QUAD_DEC2_B" function="M_QUAD_DEC2_B" pad="LP_GPIO_19"/>
              <signal group="QUAD_DEC2_B" function="M_QUAD_DEC2_B" pad="LP_GPIO_20"/>
              <signal group="QUAD_DEC2_B" function="M_QUAD_DEC2_B" pad="LP_GPIO_22"/>
              <signal group="QUAD_DEC2_B" function="M_QUAD_DEC2_B" pad="LP_GPIO_23"/>
            </signals>
          </instance>
        </module>
