Duet3D/Duet3Expansion/src/atmel/SAMB11_DFP/2.3.190/atdf/ATSAMB11G18A.atdf
        <module name="ARM_SYSCTRL" id="ASC1234" version="1.0.0">
          <instance name="ARM_SYSCTRL0">
            <register-group name="ARM_SYSCTRL0" name-in-module="ARM_SYSCTRL" address-space="base" offset="0xE000E000"/>
          </instance>
        </module>
        <module name="ARM_BPU" id="ABP1234" version="1.0.0">
          <instance name="ARM_BPU0">
            <register-group name="ARM_BPU0" name-in-module="ARM_BPU" address-space="base" offset="0xE0002000"/>
          </instance>
        </module>
        <module name="ARM_DWT" id="ADWT1234" version="1.0.0">
          <instance name="ARM_DWT0">
            <register-group name="ARM_DWT0" name-in-module="ARM_DWT" address-space="base" offset="0xE0001000"/>
          </instance>
        </module>
        <module name="ARM_ROM" id="AR1234" version="1.0.0">
          <instance name="ARM_ROM0">
            <register-group name="ARM_ROM0" name-in-module="ARM_ROM" address-space="base" offset="0xE00FF000"/>
          </instance>
        </module>
      </peripherals>
      <interrupts>
        <interrupt name="NonMaskableInt" index="-14" caption="Non Maskable Interrupt"/>
        <interrupt name="HardFault" index="-13" caption="Hard Fault Interrupt"/>
        <interrupt name="SVCall" index="-5" caption="SV Call Interrupt"/>
        <interrupt name="PendSV" index="-2" caption="Pend SV Interrupt"/>
        <interrupt name="SysTick" index="-1" caption="System Tick Interrupt"/>
        <interrupt name="UART0_RX" index="0" module-instance="UART0"/>
        <interrupt name="UART0_TX" index="1" module-instance="UART0"/>
        <interrupt name="UART1_RX" index="2" module-instance="UART1"/>
        <interrupt name="UART1_TX" index="3" module-instance="UART1"/>
        <interrupt name="SPI0_RX" index="4" module-instance="SPI0"/>
        <interrupt name="SPI0_TX" index="5" module-instance="SPI0"/>
        <interrupt name="SPI1_RX" index="6" module-instance="SPI1"/>
        <interrupt name="SPI1_TX" index="7" module-instance="SPI1"/>
        <interrupt name="I2C0_RX" index="8" module-instance="I2C0"/>
        <interrupt name="I2C0_TX" index="9" module-instance="I2C0"/>
        <interrupt name="I2C1_RX" index="10" module-instance="I2C1"/>
        <interrupt name="I2C1_TX" index="11" module-instance="I2C1"/>
        <interrupt name="WDT0" index="12" module-instance="WDT0"/>
        <interrupt name="WDT1" index="13" module-instance="WDT1"/>
        <interrupt name="DUALTIMER0" index="14" module-instance="DUALTIMER0"/>
        <interrupt name="SPI_FLASH0" index="18" module-instance="SPI_FLASH0"/>
        <interrupt name="GPIO0" index="23" module-instance="GPIO0"/>
        <interrupt name="GPIO1" index="24" module-instance="GPIO1"/>
        <interrupt name="GPIO2" index="25" module-instance="GPIO2"/>
        <interrupt name="TIMER0" index="26" module-instance="TIMER0"/>
        <interrupt name="AON_SLEEP_TIMER0" index="27" module-instance="AON_SLEEP_TIMER0"/>
      </interrupts>
      <interfaces>
        <interface type="swd" name="SWD"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="LPMCU_CHIP_ID_REV_ID" value="0x002000B0"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module name="TIMER" id="T11234" version="1.0.0" caption="ARM General Purpose Timer">
      <register-group name="TIMER" caption="ARM General Purpose Timer">
        <register name="CTRL" offset="0x0" rw="RW" size="1" initval="0x0" caption="Timer Control">
          <bitfield name="ENABLE" mask="0x1" caption="Enable Timer Operation"/>
          <bitfield name="EXTERNAL_INPUT_ENABLE" mask="0x2" caption="Select external input as enable"/>
          <bitfield name="EXTERNAL_INPUT_CLOCK" mask="0x4" caption="Select external input as clock"/>
          <bitfield name="INTERRUPT_ENABLE" mask="0x8" caption="Enable Timer Interrupt"/>
        </register>
        <register name="VALUE" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Current Value">
          <bitfield name="VALUE" mask="0xFFFFFFFF"/>
        </register>
        <register name="RELOAD" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Reload Value">
          <bitfield name="RELOAD" mask="0xFFFFFFFF"/>
        </register>
        <register name="INTSTATUSCLEAR" offset="0xC" rw="RW" size="1" initval="0x0" caption="Timer Interrupt, write 1 to clear">
          <bitfield name="INTSTATUSCLEAR" mask="0x1"/>
        </register>
        <register name="PID4" offset="0xFD0" rw="R" size="1" initval="0x04" caption="Peripheral ID Register 4">
          <bitfield name="JEP106_C_CODE" mask="0x0F" caption="JEP 106 C Code"/>
          <bitfield name="BLOCK_COUNT" mask="0xF0" caption="Block Count"/>
        </register>
        <register name="PID5" offset="0xFD4" rw="R" size="1" initval="0x00" caption="Peripheral ID Register 5">
          <bitfield name="PID5" mask="0xFF"/>
        </register>
        <register name="PID6" offset="0xFD8" rw="R" size="1" initval="0x00" caption="Peripheral ID Register 6">
          <bitfield name="PID6" mask="0xFF"/>
        </register>
        <register name="PID7" offset="0xFDC" rw="R" size="1" initval="0x00" caption="Peripheral ID Register 7">
          <bitfield name="PID7" mask="0xFF"/>
        </register>
        <register name="PID0" offset="0xFE0" rw="R" size="1" initval="0x22" caption="Peripheral ID Register 0">
          <bitfield name="PART_NUMBER" mask="0xFF" caption="Part Number Bits 7:0"/>
        </register>
        <register name="PID1" offset="0xFE4" rw="R" size="1" initval="0xB8" caption="Peripheral ID Register 1">
          <bitfield name="PART_NUMBER" mask="0x0F" caption="Part Number Bits 11:8"/>
          <bitfield name="JEP106_ID_3_0" mask="0xF0" caption="JEP106 ID Bits 3:0"/>
        </register>
        <register name="PID2" offset="0xFE8" rw="R" size="1" initval="0x1B" caption="Peripheral ID Register 2">
          <bitfield name="JEP106_ID_6_4" mask="0x07" caption="JEP106 ID Bits 6:4"/>
          <bitfield name="JEDEC_USED" mask="0x08" caption="JEDEC Used"/>
          <bitfield name="REVISION" mask="0xF0" caption="Revision"/>
        </register>
