Duet3D/Duet3Expansion/src/atmel/SAMB11_DFP/2.3.190/atdf/ATSAMB11G18A.atdf
        <register name="CH0_CH_ACTIVE_REG" offset="0x48" rw="R" size="1" initval="0x0" caption="Channel 0 Channel Active Status Register">
          <bitfield name="CH_RD_ACTIVE" mask="0x1" caption="Set if channel is enabled and all read data has been received"/>
          <bitfield name="CH_WR_ACTIVE" mask="0x2" caption="Set if channel is enabled and all write data has been transfered"/>
        </register>
        <register name="CH0_COUNT_REG" offset="0x50" rw="R" size="4" initval="0x00000" caption="Channel 0 Buffer Counter Status Register">
          <bitfield name="BUFF_COUNT" mask="0x00FFF" caption="Number of buffers transferred by channel since started"/>
          <bitfield name="INT_COUNT" mask="0xF0000" caption="Number of unserviced end interrupts"/>
        </register>
        <register name="CH0_INT_RAWSTAT_REG" offset="0xA0" rw="RW" size="1" initval="0x00" caption="Channel 0 Interrupt Raw Status (Write 1 to any field to issue interrupt)">
          <bitfield name="CH_END" mask="0x01" caption="Indicates an unserviced channel end interrupt"/>
          <bitfield name="RD_SLVERR" mask="0x02" caption="AHB read slave error"/>
          <bitfield name="WR_SLVERR" mask="0x04" caption="AHB write slave error"/>
          <bitfield name="FIFO_OVERFLOW" mask="0x08" caption="FIFO has been overflown"/>
          <bitfield name="FIFO_UNDERFLOW" mask="0x10" caption="FIFO has been underflown"/>
          <bitfield name="TIMEOUT_RD" mask="0x20" caption="Read timeout on AHB bus (timeout value fixed at 1024 cycles)"/>
          <bitfield name="TIMEOUT_WR" mask="0x40" caption="Write timeout on AHB bus (timeout value fixed at 1024 cycles)"/>
          <bitfield name="WDT" mask="0x80" caption="Channel active but did not start a burst for 2048 cycles"/>
        </register>
        <register name="CH0_INT_CLEAR_REG" offset="0xA4" rw="RW" size="1" initval="0x00" caption="Channel 0 Interrupt Clear (Write 1 to clear)">
          <bitfield name="CH_END" mask="0x01" caption="Clear channel end interrupt. Decrements INT_COUNT register"/>
          <bitfield name="RD_SLVERR" mask="0x02" caption="Clear AHB read slave error"/>
          <bitfield name="WR_SLVERR" mask="0x04" caption="Clear AHB write slave error"/>
          <bitfield name="FIFO_OVERFLOW" mask="0x08" caption="Clears FIFO overflow"/>
          <bitfield name="FIFO_UNDERFLOW" mask="0x10" caption="Clears FIFO underflow"/>
          <bitfield name="TIMEOUT_RD" mask="0x20" caption="Clears Read Timeout"/>
          <bitfield name="TIMEOUT_WR" mask="0x40" caption="Clears Write Timeout"/>
          <bitfield name="WDT" mask="0x80" caption="Clears WDT"/>
        </register>
        <register name="CH0_INT_ENABLE_REG" offset="0xA8" rw="RW" size="1" initval="0x00" caption="Channel 0 Interrupt Enable">
          <bitfield name="CH_END" mask="0x01" caption="Enables end of channel interrupt"/>
          <bitfield name="RD_SLVERR" mask="0x02" caption="Enables AHB read slave error interrupt"/>
          <bitfield name="WR_SLVERR" mask="0x04" caption="Enables AHB write slave error interrupt"/>
          <bitfield name="FIFO_OVERFLOW" mask="0x08" caption="Enables FIFO overflow interrupt"/>
          <bitfield name="FIFO_UNDERFLOW" mask="0x10" caption="Enables FIFO underflow interrupt"/>
          <bitfield name="TIMEOUT_RD" mask="0x20" caption="Enables AHB Read timeout interrupt"/>
          <bitfield name="TIMEOUT_WR" mask="0x40" caption="Enables AHB Write timeout interrupt"/>
          <bitfield name="WDT" mask="0x80" caption="Enables WDT interrupt"/>
        </register>
        <register name="CH0_INT_STATUS_REG" offset="0xAC" rw="RW" size="1" initval="0x00" caption="Channel 0 Interrupt Status">
          <bitfield name="CH_END" mask="0x01" caption="Indicates an unserviced channel end interrupt"/>
          <bitfield name="RD_SLVERR" mask="0x02" caption="AHB read slave error"/>
          <bitfield name="WR_SLVERR" mask="0x04" caption="AHB write slave error"/>
          <bitfield name="FIFO_OVERFLOW" mask="0x08" caption="FIFO has been overflown"/>
          <bitfield name="FIFO_UNDERFLOW" mask="0x10" caption="FIFO has been underflown"/>
          <bitfield name="TIMEOUT_RD" mask="0x20" caption="Read timeout on AHB bus (timeout value fixed at 1024 cycles)"/>
          <bitfield name="TIMEOUT_WR" mask="0x40" caption="Write timeout on AHB bus (timeout value fixed at 1024 cycles)"/>
          <bitfield name="WDT" mask="0x80" caption="Channel active but did not start a burst for 2048 cycles"/>
        </register>
        <register name="CH1_CMD_REG0" offset="0x100" rw="RW" size="4" initval="0x00000000" caption="Channel 1 First Line Channel Command">
          <bitfield name="RD_START_ADDR" mask="0xFFFFFFFF" caption="Start Address of Read Buffer"/>
        </register>
        <register name="CH1_CMD_REG1" offset="0x104" rw="RW" size="4" initval="0x00000000" caption="Channel 1 Second Line Channel Command">
          <bitfield name="WR_START_ADDR" mask="0xFFFFFFFF" caption="Start Address of Write Buffer"/>
        </register>
        <register name="CH1_CMD_REG2" offset="0x108" rw="RW" size="2" initval="0x0000" caption="Channel 1 Third Line Channel Command">
          <bitfield name="BUFFER_SIZE" mask="0x1FFF" caption="Size (in Bytes) of Buffer to Transfer"/>
        </register>
        <register name="CH1_CMD_REG3" offset="0x10C" rw="RW" size="4" initval="0x00000000" caption="Channel 1 Fourth Line Channel Command">
          <bitfield name="CMD_SET_INT" mask="0x00000001" caption="Active High Interrupt Enable once buffer has been transfered"/>
          <bitfield name="CMD_LAST" mask="0x00000002" caption="If set, channel stops when buffer done, otherwise load from CMD_NEXT_ADDR"/>
          <bitfield name="CMD_NEXT_ADDR" mask="0xFFFFFFFC" caption="Address of next command if CMD_LAST is not set"/>
        </register>
        <register name="CH1_STATIC_REG0" offset="0x110" rw="RW" size="4" initval="0x80010000" caption="Channel 1 Static Configuration Read">
          <bitfield name="RD_BURST_MAX_SIZE" mask="0x0000007F" caption="Maximum number of bytes of an AHB read burst"/>
          <bitfield name="RD_TOKENS" mask="0x003F0000" caption="Number of AHB read commands to issue before channel is released"/>
          <bitfield name="RD_INCR" mask="0x80000000" caption="If set the controller will increment the next burst address"/>
        </register>
        <register name="CH1_STATIC_REG1" offset="0x114" rw="RW" size="4" initval="0x80010000" caption="Channel 1 Static Configuration Write">
          <bitfield name="WR_BURST_MAX_SIZE" mask="0x0000007F" caption="Maximum number of bytes of an AHB write burst"/>
          <bitfield name="WR_TOKENS" mask="0x003F0000" caption="Number of AHB write commands to issue before channel is released"/>
          <bitfield name="WR_INCR" mask="0x80000000" caption="If set the controller will increment the next burst address"/>
        </register>
        <register name="CH1_STATIC_REG2" offset="0x118" rw="RW" size="4" initval="0x00010000" caption="Channel 1 Block Mode">
          <bitfield name="JOINT" mask="0x00010000" caption="If set channel will work in joint mode"/>
          <bitfield name="END_SWAP" mask="0x30000000" values="PROV_DMA_CTRL_CH1_STATIC_REG2_END_SWAP" caption="Endianness Byte Swapping"/>
        </register>
        <register name="CH1_STATIC_REG4" offset="0x120" rw="RW" size="4" initval="0x0000000" caption="Channel 1 Static Configuration Peripheral">
          <bitfield name="RD_PERIPH_NUM" mask="0x000001F" caption="Number of peripheral to read from (0 if memory or no peripheral flow control)"/>
          <bitfield name="RD_PERIPH_DELAY" mask="0x0000700" caption="Number of cycles to wait for read request signal to update after issuing the read clear signal"/>
          <bitfield name="WR_PERIPH_NUM" mask="0x01F0000" caption="Number of peripheral to write from (0 if memory or no peripheral flow control)"/>
          <bitfield name="WR_PERIPH_DELAY" mask="0x7000000" caption="Number of cycles to wait for write request signal to update after issuing the write clear signal"/>
        </register>
        <register name="CH1_RESRICT_REG" offset="0x12C" rw="R" size="2" initval="0x000" caption="Channel 1 Restrictions Status Register">
          <bitfield name="RD_ALLOW_FULL_FIFO" mask="0x001" caption="Read start address does not restrict burst size"/>
          <bitfield name="WR_ALLOW_FULL_FIFO" mask="0x002" caption="Write start address does not restrict burst size"/>
          <bitfield name="ALLOW_FULL_FIFO" mask="0x004" caption="Burst sizes can equal data buffer size, otherwise max burst is half data buffer size"/>
          <bitfield name="ALLOW_FULL_BURST" mask="0x008" caption="Maximum burst of 16 strobes can be used (joint mode only)"/>
          <bitfield name="ALLOW_JOINT_BURST" mask="0x010" caption="Joint bursts are currently active"/>
          <bitfield name="SIMPLE_MEM" mask="0x100" caption="Configuration is aligned and peripherals are not used"/>
        </register>
        <register name="CH1_FIFO_FULLNESS_REG" offset="0x138" rw="R" size="4" initval="0x00000000" caption="Channel 1 FIFO Fullness Status Register">
          <bitfield name="RD_GAP" mask="0x00001FFF" caption="Remaining space (in bytes) in FIFO for read data"/>
          <bitfield name="WR_FULLNESS" mask="0x1FFF0000" caption="Occupied space (in bytes) in FIFO by write data"/>
        </register>
        <register name="CH1_CH_ENABLE_REG" offset="0x140" rw="RW" size="1" initval="0x1" caption="Channel 1 Channel Enable Register">
          <bitfield name="CH1_CH_ENABLE_REG" mask="0x1"/>
        </register>
        <register name="CH1_CH_START_REG" offset="0x144" rw="W" size="1" initval="0x0" caption="Channel 1 Channel Start Register">
          <bitfield name="CH1_CH_START_REG" mask="0x1"/>
        </register>
        <register name="CH1_CH_ACTIVE_REG" offset="0x148" rw="R" size="1" initval="0x0" caption="Channel 1 Channel Active Status Register">
          <bitfield name="CH_RD_ACTIVE" mask="0x1" caption="Set if channel is enabled and all read data has been received"/>
          <bitfield name="CH_WR_ACTIVE" mask="0x2" caption="Set if channel is enabled and all write data has been transfered"/>
        </register>
        <register name="CH1_COUNT_REG" offset="0x150" rw="R" size="4" initval="0x00000" caption="Channel 1 Buffer Counter Status Register">
          <bitfield name="BUFF_COUNT" mask="0x00FFF" caption="Number of buffers transferred by channel since started"/>
          <bitfield name="INT_COUNT" mask="0xF0000" caption="Number of unserviced end interrupts"/>
        </register>
        <register name="CH1_INT_RAWSTAT_REG" offset="0x1A0" rw="RW" size="1" initval="0x00" caption="Channel 1 Interrupt Raw Status (Write 1 to any field to issue interrupt)">
          <bitfield name="CH_END" mask="0x01" caption="Indicates an unserviced channel end interrupt"/>
          <bitfield name="RD_SLVERR" mask="0x02" caption="AHB read slave error"/>
          <bitfield name="WR_SLVERR" mask="0x04" caption="AHB write slave error"/>
          <bitfield name="FIFO_OVERFLOW" mask="0x08" caption="FIFO has been overflown"/>
          <bitfield name="FIFO_UNDERFLOW" mask="0x10" caption="FIFO has been underflown"/>
          <bitfield name="TIMEOUT_RD" mask="0x20" caption="Read timeout on AHB bus (timeout value fixed at 1024 cycles)"/>
          <bitfield name="TIMEOUT_WR" mask="0x40" caption="Write timeout on AHB bus (timeout value fixed at 1024 cycles)"/>
          <bitfield name="WDT" mask="0x80" caption="Channel active but did not start a burst for 2048 cycles"/>
        </register>
        <register name="CH1_INT_CLEAR_REG" offset="0x1A4" rw="RW" size="1" initval="0x00" caption="Channel 1 Interrupt Clear (Write 1 to clear)">
          <bitfield name="CH_END" mask="0x01" caption="Clear channel end interrupt. Decrements INT_COUNT register"/>
          <bitfield name="RD_SLVERR" mask="0x02" caption="Clear AHB read slave error"/>
          <bitfield name="WR_SLVERR" mask="0x04" caption="Clear AHB write slave error"/>
          <bitfield name="FIFO_OVERFLOW" mask="0x08" caption="Clears FIFO overflow"/>
          <bitfield name="FIFO_UNDERFLOW" mask="0x10" caption="Clears FIFO underflow"/>
          <bitfield name="TIMEOUT_RD" mask="0x20" caption="Clears Read Timeout"/>
          <bitfield name="TIMEOUT_WR" mask="0x40" caption="Clears Write Timeout"/>
          <bitfield name="WDT" mask="0x80" caption="Clears WDT"/>
        </register>
        <register name="CH1_INT_ENABLE_REG" offset="0x1A8" rw="RW" size="1" initval="0x00" caption="Channel 1 Interrupt Enable">
          <bitfield name="CH_END" mask="0x01" caption="Enables end of channel interrupt"/>
          <bitfield name="RD_SLVERR" mask="0x02" caption="Enables AHB read slave error interrupt"/>
          <bitfield name="WR_SLVERR" mask="0x04" caption="Enables AHB write slave error interrupt"/>
          <bitfield name="FIFO_OVERFLOW" mask="0x08" caption="Enables FIFO overflow interrupt"/>
          <bitfield name="FIFO_UNDERFLOW" mask="0x10" caption="Enables FIFO underflow interrupt"/>
          <bitfield name="TIMEOUT_RD" mask="0x20" caption="Enables AHB Read timeout interrupt"/>
          <bitfield name="TIMEOUT_WR" mask="0x40" caption="Enables AHB Write timeout interrupt"/>
          <bitfield name="WDT" mask="0x80" caption="Enables WDT interrupt"/>
        </register>
        <register name="CH1_INT_STATUS_REG" offset="0x1AC" rw="RW" size="1" initval="0x00" caption="Channel 1 Interrupt Status">
          <bitfield name="CH_END" mask="0x01" caption="Indicates an unserviced channel end interrupt"/>
          <bitfield name="RD_SLVERR" mask="0x02" caption="AHB read slave error"/>
          <bitfield name="WR_SLVERR" mask="0x04" caption="AHB write slave error"/>
          <bitfield name="FIFO_OVERFLOW" mask="0x08" caption="FIFO has been overflown"/>
          <bitfield name="FIFO_UNDERFLOW" mask="0x10" caption="FIFO has been underflown"/>
          <bitfield name="TIMEOUT_RD" mask="0x20" caption="Read timeout on AHB bus (timeout value fixed at 1024 cycles)"/>
          <bitfield name="TIMEOUT_WR" mask="0x40" caption="Write timeout on AHB bus (timeout value fixed at 1024 cycles)"/>
          <bitfield name="WDT" mask="0x80" caption="Channel active but did not start a burst for 2048 cycles"/>
        </register>
        <register name="CH2_CMD_REG0" offset="0x200" rw="RW" size="4" initval="0x00000000" caption="Channel 2 First Line Channel Command">
          <bitfield name="RD_START_ADDR" mask="0xFFFFFFFF" caption="Start Address of Read Buffer"/>
        </register>
        <register name="CH2_CMD_REG1" offset="0x204" rw="RW" size="4" initval="0x00000000" caption="Channel 2 Second Line Channel Command">
          <bitfield name="WR_START_ADDR" mask="0xFFFFFFFF" caption="Start Address of Write Buffer"/>
        </register>
        <register name="CH2_CMD_REG2" offset="0x208" rw="RW" size="2" initval="0x0000" caption="Channel 2 Third Line Channel Command">
          <bitfield name="BUFFER_SIZE" mask="0x1FFF" caption="Size (in Bytes) of Buffer to Transfer"/>
        </register>
