Duet3D/Duet3Expansion/src/atmel/SAMB11_DFP/2.3.190/atdf/ATSAMB11G18A.atdf
        <register name="CH3_STATIC_REG2" offset="0x318" rw="RW" size="4" initval="0x00010000" caption="Channel 3 Block Mode">
          <bitfield name="JOINT" mask="0x00010000" caption="If set channel will work in joint mode"/>
          <bitfield name="END_SWAP" mask="0x30000000" values="PROV_DMA_CTRL_CH3_STATIC_REG2_END_SWAP" caption="Endianness Byte Swapping"/>
        </register>
        <register name="CH3_STATIC_REG4" offset="0x320" rw="RW" size="4" initval="0x0000000" caption="Channel 3 Static Configuration Peripheral">
          <bitfield name="RD_PERIPH_NUM" mask="0x000001F" caption="Number of peripheral to read from (0 if memory or no peripheral flow control)"/>
          <bitfield name="RD_PERIPH_DELAY" mask="0x0000700" caption="Number of cycles to wait for read request signal to update after issuing the read clear signal"/>
          <bitfield name="WR_PERIPH_NUM" mask="0x01F0000" caption="Number of peripheral to write from (0 if memory or no peripheral flow control)"/>
          <bitfield name="WR_PERIPH_DELAY" mask="0x7000000" caption="Number of cycles to wait for write request signal to update after issuing the write clear signal"/>
        </register>
        <register name="CH3_RESRICT_REG" offset="0x32C" rw="R" size="2" initval="0x000" caption="Channel 3 Restrictions Status Register">
          <bitfield name="RD_ALLOW_FULL_FIFO" mask="0x001" caption="Read start address does not restrict burst size"/>
          <bitfield name="WR_ALLOW_FULL_FIFO" mask="0x002" caption="Write start address does not restrict burst size"/>
          <bitfield name="ALLOW_FULL_FIFO" mask="0x004" caption="Burst sizes can equal data buffer size, otherwise max burst is half data buffer size"/>
          <bitfield name="ALLOW_FULL_BURST" mask="0x008" caption="Maximum burst of 16 strobes can be used (joint mode only)"/>
          <bitfield name="ALLOW_JOINT_BURST" mask="0x010" caption="Joint bursts are currently active"/>
          <bitfield name="SIMPLE_MEM" mask="0x100" caption="Configuration is aligned and peripherals are not used"/>
        </register>
        <register name="CH3_FIFO_FULLNESS_REG" offset="0x338" rw="R" size="4" initval="0x00000000" caption="Channel 3 FIFO Fullness Status Register">
          <bitfield name="RD_GAP" mask="0x00001FFF" caption="Remaining space (in bytes) in FIFO for read data"/>
          <bitfield name="WR_FULLNESS" mask="0x1FFF0000" caption="Occupied space (in bytes) in FIFO by write data"/>
        </register>
        <register name="CH3_CH_ENABLE_REG" offset="0x340" rw="RW" size="1" initval="0x1" caption="Channel 3 Channel Enable Register">
          <bitfield name="CH3_CH_ENABLE_REG" mask="0x1"/>
        </register>
        <register name="CH3_CH_START_REG" offset="0x344" rw="W" size="1" initval="0x0" caption="Channel 3 Channel Start Register">
          <bitfield name="CH3_CH_START_REG" mask="0x1"/>
        </register>
        <register name="CH3_CH_ACTIVE_REG" offset="0x348" rw="R" size="1" initval="0x0" caption="Channel 3 Channel Active Status Register">
          <bitfield name="CH_RD_ACTIVE" mask="0x1" caption="Set if channel is enabled and all read data has been received"/>
          <bitfield name="CH_WR_ACTIVE" mask="0x2" caption="Set if channel is enabled and all write data has been transfered"/>
        </register>
        <register name="CH3_COUNT_REG" offset="0x350" rw="R" size="4" initval="0x00000" caption="Channel 3 Buffer Counter Status Register">
          <bitfield name="BUFF_COUNT" mask="0x00FFF" caption="Number of buffers transferred by channel since started"/>
          <bitfield name="INT_COUNT" mask="0xF0000" caption="Number of unserviced end interrupts"/>
        </register>
        <register name="CH3_INT_RAWSTAT_REG" offset="0x3A0" rw="RW" size="1" initval="0x00" caption="Channel 3 Interrupt Raw Status (Write 1 to any field to issue interrupt)">
          <bitfield name="CH_END" mask="0x01" caption="Indicates an unserviced channel end interrupt"/>
          <bitfield name="RD_SLVERR" mask="0x02" caption="AHB read slave error"/>
          <bitfield name="WR_SLVERR" mask="0x04" caption="AHB write slave error"/>
          <bitfield name="FIFO_OVERFLOW" mask="0x08" caption="FIFO has been overflown"/>
          <bitfield name="FIFO_UNDERFLOW" mask="0x10" caption="FIFO has been underflown"/>
          <bitfield name="TIMEOUT_RD" mask="0x20" caption="Read timeout on AHB bus (timeout value fixed at 1024 cycles)"/>
          <bitfield name="TIMEOUT_WR" mask="0x40" caption="Write timeout on AHB bus (timeout value fixed at 1024 cycles)"/>
          <bitfield name="WDT" mask="0x80" caption="Channel active but did not start a burst for 2048 cycles"/>
        </register>
        <register name="CH3_INT_CLEAR_REG" offset="0x3A4" rw="RW" size="1" initval="0x00" caption="Channel 3 Interrupt Clear (Write 1 to clear)">
          <bitfield name="CH_END" mask="0x01" caption="Clear channel end interrupt. Decrements INT_COUNT register"/>
          <bitfield name="RD_SLVERR" mask="0x02" caption="Clear AHB read slave error"/>
          <bitfield name="WR_SLVERR" mask="0x04" caption="Clear AHB write slave error"/>
          <bitfield name="FIFO_OVERFLOW" mask="0x08" caption="Clears FIFO overflow"/>
          <bitfield name="FIFO_UNDERFLOW" mask="0x10" caption="Clears FIFO underflow"/>
          <bitfield name="TIMEOUT_RD" mask="0x20" caption="Clears Read Timeout"/>
          <bitfield name="TIMEOUT_WR" mask="0x40" caption="Clears Write Timeout"/>
          <bitfield name="WDT" mask="0x80" caption="Clears WDT"/>
        </register>
        <register name="CH3_INT_ENABLE_REG" offset="0x3A8" rw="RW" size="1" initval="0x00" caption="Channel 3 Interrupt Enable">
          <bitfield name="CH_END" mask="0x01" caption="Enables end of channel interrupt"/>
          <bitfield name="RD_SLVERR" mask="0x02" caption="Enables AHB read slave error interrupt"/>
          <bitfield name="WR_SLVERR" mask="0x04" caption="Enables AHB write slave error interrupt"/>
          <bitfield name="FIFO_OVERFLOW" mask="0x08" caption="Enables FIFO overflow interrupt"/>
          <bitfield name="FIFO_UNDERFLOW" mask="0x10" caption="Enables FIFO underflow interrupt"/>
          <bitfield name="TIMEOUT_RD" mask="0x20" caption="Enables AHB Read timeout interrupt"/>
          <bitfield name="TIMEOUT_WR" mask="0x40" caption="Enables AHB Write timeout interrupt"/>
          <bitfield name="WDT" mask="0x80" caption="Enables WDT interrupt"/>
        </register>
        <register name="CH3_INT_STATUS_REG" offset="0x3AC" rw="RW" size="1" initval="0x00" caption="Channel 3 Interrupt Status">
          <bitfield name="CH_END" mask="0x01" caption="Indicates an unserviced channel end interrupt"/>
          <bitfield name="RD_SLVERR" mask="0x02" caption="AHB read slave error"/>
          <bitfield name="WR_SLVERR" mask="0x04" caption="AHB write slave error"/>
          <bitfield name="FIFO_OVERFLOW" mask="0x08" caption="FIFO has been overflown"/>
          <bitfield name="FIFO_UNDERFLOW" mask="0x10" caption="FIFO has been underflown"/>
          <bitfield name="TIMEOUT_RD" mask="0x20" caption="Read timeout on AHB bus (timeout value fixed at 1024 cycles)"/>
          <bitfield name="TIMEOUT_WR" mask="0x40" caption="Write timeout on AHB bus (timeout value fixed at 1024 cycles)"/>
          <bitfield name="WDT" mask="0x80" caption="Channel active but did not start a burst for 2048 cycles"/>
        </register>
        <register name="CORE_INT_STATUS" offset="0x800" rw="R" size="1" initval="0x0" caption="Indicates which channels caused interrupt">
          <bitfield name="CHANNEL_0" mask="0x1" caption="Indicates channel 0 caused interrupt"/>
          <bitfield name="CHANNEL_1" mask="0x2" caption="Indicates channel 1 caused interrupt"/>
          <bitfield name="CHANNEL_2" mask="0x4" caption="Indicates channel 2 caused interrupt"/>
          <bitfield name="CHANNEL_3" mask="0x8" caption="Indicates channel 3 caused interrupt"/>
        </register>
        <register name="CORE_JOINT_MODE" offset="0x830" rw="RW" size="1" initval="0x0" caption="If set, core works in joint mode">
          <bitfield name="CORE_JOINT_MODE" mask="0x1"/>
        </register>
