Duet3D/Duet3Expansion/src/atmel/SAMB11_DFP/2.3.190/atdf/ATSAMB11G18A.atdf
        <register name="CORE_PRIORITY" offset="0x838" rw="RW" size="2" initval="0x0000" caption="Core Priority Channels">
          <bitfield name="RD_PRIO_TOP_NUM" mask="0x0007" caption="Core Read Top Priority Channel Number"/>
          <bitfield name="RD_PRIO_TOP" mask="0x0008" caption="Core Read Top Priority Enable"/>
          <bitfield name="RD_PRIO_HIGH_NUM" mask="0x0070" caption="Core Read High Priority Channel Number"/>
          <bitfield name="RD_PRIO_HIGH" mask="0x0080" caption="Core Read High Priority Enable"/>
          <bitfield name="WR_PRIO_TOP_NUM" mask="0x0700" caption="Core Write Top Priority Channel Number"/>
          <bitfield name="WR_PRIO_TOP" mask="0x0800" caption="Core Write Top Priority Enable"/>
          <bitfield name="WR_PRIO_HIGH_NUM" mask="0x7000" caption="Core Write High Priority Channel Number"/>
          <bitfield name="WR_PRIO_HIGH" mask="0x8000" caption="Core Write High Priority Enable"/>
        </register>
        <register name="CORE_CLKDIV" offset="0x840" rw="RW" size="1" initval="0x1" caption="Ratio between main clock and core clock">
          <bitfield name="CORE_CLKDIV" mask="0xF"/>
        </register>
        <register name="CORE_CH_START" offset="0x848" rw="W" size="1" initval="0x0" caption="Channel Start">
          <bitfield name="CH_0" mask="0x1" caption="Starts Channel 0"/>
          <bitfield name="CH_1" mask="0x2" caption="Starts Channel 1"/>
          <bitfield name="CH_2" mask="0x4" caption="Starts Channel 2"/>
          <bitfield name="CH_3" mask="0x8" caption="Starts Channel 3"/>
        </register>
        <register name="PERIPH_RX_CTRL" offset="0x850" rw="RW" size="4" initval="0x00000000" caption="Direct control of peripheral RX request">
          <bitfield name="RX_REQ" mask="0xFFFFFFFE" caption="Allows direct control of the peripheral RX request bus"/>
        </register>
        <register name="PERIPH_TX_CTRL" offset="0x860" rw="RW" size="4" initval="0x00000000" caption="Direct control of peripheral TX request">
          <bitfield name="TX_REQ" mask="0xFFFFFFFE" caption="Allows direct control of the peripheral TX request bus"/>
        </register>
        <register name="CORE_IDLE" offset="0x8D0" rw="R" size="1" initval="0x0" caption="Indicates all channels have stopped and transactions have completed">
          <bitfield name="CORE_IDLE" mask="0x1"/>
        </register>
        <register name="USER_DEF_STATUS" offset="0x8E0" rw="R" size="4" initval="0x80000001" caption="User Defined Configurations">
          <bitfield name="INT_NUM" mask="0x0000000F" caption="Number of bits in interrupt bus"/>
          <bitfield name="DUAL_CORE" mask="0x00000020" caption="If set the design has two cores"/>
          <bitfield name="IC" mask="0x00000040" caption="If set an AHB matrix is used"/>
          <bitfield name="IC_DUAL_PORT" mask="0x00000080" caption="If set AHB matrix has two output ports"/>
          <bitfield name="CLKGATE" mask="0x00000100" caption="If set design contains functional clock gates"/>
          <bitfield name="PORT0_MUX" mask="0x00000200" caption="If set AHB port 0 is using an AHB mux"/>
          <bitfield name="PORT1_MUX" mask="0x00000400" caption="If set AHB port 1 is using an AHB mux"/>
          <bitfield name="PROJ" mask="0x80000000" caption="User Defined Project"/>
        </register>
        <register name="CORE_DEF_STATUS0" offset="0x8F0" rw="R" size="4" initval="0x0A601151" caption="User Defined Core Configurations 0">
          <bitfield name="CH_NUM" mask="0x0000000F" caption="Number of channels (reads 1, should read 4)"/>
          <bitfield name="FIFO_SIZE" mask="0x000000F0" caption="Log2 of FIFO size per channel"/>
          <bitfield name="WCMD_DEPTH" mask="0x00000F00" caption="Log2 of maximum number of pending write commands"/>
          <bitfield name="RCMD_DEPTH" mask="0x0000F000" caption="Log2 of maximum number of pending read commands"/>
          <bitfield name="ADDR_BITS" mask="0x003F0000" caption="Number of bits in address buses"/>
          <bitfield name="AHB_BUS_32" mask="0x00400000" caption="If set AHB bus is 32 bit otherwise 64 bit"/>
          <bitfield name="BUFF_BITS" mask="0x1F000000" caption="Number of bits in BUFFER_SIZE"/>
        </register>
        <register name="CORE_DEF_STATUS1" offset="0x8F4" rw="R" size="2" initval="0x0F87" caption="User Defined Core Configurations 1">
          <bitfield name="WDT" mask="0x0001" caption="Set if core has watchdog timer"/>
          <bitfield name="AHB_TIMEOUT" mask="0x0002" caption="Set if core supports timeouts on AHB read and write buses"/>
          <bitfield name="TOKENS" mask="0x0004" caption="Set if core has tokens support"/>
          <bitfield name="PRIO" mask="0x0008" caption="Set if core has priority modes support"/>
          <bitfield name="OUTS" mask="0x0010" caption="Set if core supports outstanding mode"/>
          <bitfield name="WAIT" mask="0x0020" caption="Set if core supports scheduled channels"/>
          <bitfield name="BLOCK" mask="0x0040" caption="Set if core supports block transfer"/>
          <bitfield name="JOINT" mask="0x0080" caption="Set if core supports joint mode"/>
          <bitfield name="INDEPENDENT" mask="0x0100" caption="Set if core supports independent mode"/>
          <bitfield name="PERIPH" mask="0x0200" caption="Set if core supports peripherals"/>
          <bitfield name="LISTS" mask="0x0400" caption="Set if core supports command lists"/>
          <bitfield name="END" mask="0x0800" caption="Set if core supports endianness swapping"/>
          <bitfield name="CLKDIV" mask="0x1000" caption="Set if core supports clock division ratios"/>
        </register>
      </register-group>
      <value-group name="PROV_DMA_CTRL_CH0_STATIC_REG2_END_SWAP">
        <value name="0" caption="No Swapping" value="0x0"/>
        <value name="1" caption="Swap bytes within 16 bits" value="0x1"/>
        <value name="2" caption="Swap bytes within 32 bits" value="0x2"/>
        <value name="3" caption="Swap bytes within 64 bits" value="0x3"/>
      </value-group>
      <value-group name="PROV_DMA_CTRL_CH1_STATIC_REG2_END_SWAP">
        <value name="0" caption="No Swapping" value="0x0"/>
        <value name="1" caption="Swap bytes within 16 bits" value="0x1"/>
        <value name="2" caption="Swap bytes within 32 bits" value="0x2"/>
        <value name="3" caption="Swap bytes within 64 bits" value="0x3"/>
      </value-group>
      <value-group name="PROV_DMA_CTRL_CH2_STATIC_REG2_END_SWAP">
        <value name="0" caption="No Swapping" value="0x0"/>
        <value name="1" caption="Swap bytes within 16 bits" value="0x1"/>
        <value name="2" caption="Swap bytes within 32 bits" value="0x2"/>
        <value name="3" caption="Swap bytes within 64 bits" value="0x3"/>
      </value-group>
      <value-group name="PROV_DMA_CTRL_CH3_STATIC_REG2_END_SWAP">
        <value name="0" caption="No Swapping" value="0x0"/>
        <value name="1" caption="Swap bytes within 16 bits" value="0x1"/>
        <value name="2" caption="Swap bytes within 32 bits" value="0x2"/>
        <value name="3" caption="Swap bytes within 64 bits" value="0x3"/>
      </value-group>
    </module>
    <module name="I2C" id="I1234" version="1.0.0" caption="I2C Master/Slave Controller">
      <register-group name="I2C" caption="I2C Master/Slave Controller">
        <register name="TRANSMIT_DATA" offset="0x0" rw="W" size="2" initval="0x000" caption="Writes one byte to I2C Transmit Data FIFO. ">
          <bitfield name="TX_DATA" mask="0x0FF" caption="Represents either Tx Data, or Address and Direction if address flag is set. "/>
          <bitfield name="ADDRESS_FLAG" mask="0x100" values="I2C_TRANSMIT_DATA_ADDRESS_FLAG" caption="Specifies that tx_data field is used for address and direction."/>
        </register>
        <register name="RECEIVE_DATA" offset="0x4" rw="R" size="1" initval="0x00" caption="Read one byte from I2C Receive Data FIFO. ">
          <bitfield name="RX_BYTE" mask="0xFF" caption="Oldest data in receive FIFO. "/>
        </register>
        <register name="TRANSMIT_STATUS" offset="0x8" rw="R" size="1" initval="0x00" caption="Status of the I2C transmitter. Each field can generate an interrupt if corresponding bit in  the Tx interrupt mask register is set. ">
          <bitfield name="TX_FIFO_NOT_FULL" mask="0x01" values="I2C_TRANSMIT_STATUS_TX_FIFO_NOT_FULL" caption="Active High indication when Tx FIFO can still accepts at least one more character."/>
          <bitfield name="TX_FIFO_0P25_EMPTY" mask="0x02" caption="Active High indication when Tx FIFO is at least quarter empty. Reset when more. "/>
          <bitfield name="TX_FIFO_0P5_EMPTY" mask="0x04" caption="Active High indication when Tx FIFO is at least half empty. Reset when more. "/>
          <bitfield name="TX_FIFO_0P75_EMPTY" mask="0x08" caption="Active High indication when Tx FIFO is at least three quarters empty. Reset when more. "/>
          <bitfield name="TX_FIFO_EMPTY" mask="0x10" caption="Active High indication when Tx FIFO is Empty and has no more character to transmit "/>
        </register>
