Duet3D/Duet3Expansion/src/atmel/SAMB11_DFP/2.3.190/atdf/ATSAMB11G18A.atdf
        <register name="RECEIVE_STATUS" offset="0xC" rw="R" size="1" initval="0x00" caption="Status of the I2C receiver. Each field can generate an interrupt if corresponding bit in  the Rx interrupt mask register is set. ">
          <bitfield name="RX_FIFO_NOT_EMPTY" mask="0x01" caption="Active High indication when data is available in Rx FIFO"/>
          <bitfield name="RX_FIFO_0P25_FULL" mask="0x02" caption="Active High indication when FIFO is at least quarter full. Reset when less. "/>
          <bitfield name="RX_FIFO_0P5_FULL" mask="0x04" caption="Active High indication when FIFO is at least half full. Reset when less. "/>
          <bitfield name="RX_FIFO_0P75_FULL" mask="0x08" caption="Active High indication when FIFO is at least three quarters full. Reset when less. "/>
          <bitfield name="FIFO_OVERRUN" mask="0x10" caption="Active High indication when character is received but FIFO is full. Reset by reading  the status register. "/>
          <bitfield name="NAK" mask="0x20" caption="Active High indication when NAK is received. The I2C module will retry transmission  unless transaction aborted by the flush register. "/>
        </register>
        <register name="CLOCK_SOURCE_SELECT" offset="0x10" rw="RW" size="1" initval="0x0" caption="Clock Source Select">
          <bitfield name="CLOCK" mask="0x3" values="I2C_CLOCK_SOURCE_SELECT_CLOCK" caption="Clock Used to Generate Divided Clock"/>
        </register>
        <register name="I2C_MODULE_ENABLE" offset="0x14" rw="RW" size="1" initval="0x0" caption="I2C Enable">
          <bitfield name="ENABLE" mask="0x1" caption="Enables I2C Operation"/>
        </register>
        <register name="I2C_CLK_DIVIDER" offset="0x18" rw="RW" size="2" initval="0x0000" caption="Register sets the divide ratio used to generate the sck clock from the module's input clock. ">
          <bitfield name="I2C_DIVIDE_RATIO" mask="0xFFFF" caption="Clock Divide Ratio. The input clock signal is divided by (n+1) where n is the value set in  this field.  The minimum division is by 2; a value of 0 is illegal. "/>
        </register>
        <register name="I2C_MASTER_MODE" offset="0x1C" rw="RW" size="1" initval="0x0" caption="Selects I2C Master or Slave Mode. ">
          <bitfield name="MASTER_ENABLE" mask="0x1" values="I2C_I2C_MASTER_MODE_MASTER_ENABLE" caption="Active High I2C Master Mode Enable"/>
        </register>
        <register name="I2C_ONBUS" offset="0x20" rw="RW" size="1" initval="0x0" caption="Enable/Disable transactions when in Master Mode. ">
          <bitfield name="ONBUS_ENABLE" mask="0x1" values="I2C_I2C_ONBUS_ONBUS_ENABLE" caption="Active High Enable to initiate transactions when in Master Mode."/>
        </register>
        <register name="I2C_SLAVE_ADDRESS" offset="0x24" rw="RW" size="1" initval="0x00" caption="Configures the I2C slave Address. ">
          <bitfield name="ADDRESS" mask="0x7F" caption="I2C Slave Address "/>
        </register>
        <register name="I2C_STATUS" offset="0x28" rw="R" size="1" initval="0x0" caption="Status of I2C Module. ">
          <bitfield name="I2C_ACTIVE" mask="0x1" caption="Active High indicatation that the I2C Module is active. While set, I2C configuration  should not be modified. "/>
        </register>
        <register name="TX_INTERRUPT_MASK" offset="0x2C" rw="RW" size="1" initval="0x00" caption="Enable or Disable the generation of interrupts by the tx_status register. ">
          <bitfield name="TX_FIFO_NOT_FULL_MASK" mask="0x01" caption="Active High Enable of tx_fifo_not_full interrupt "/>
          <bitfield name="TX_FIFO_0P25_EMPTY_MASK" mask="0x02" caption="Active High Enable of tx_fifo_0p25_empty interrupt "/>
          <bitfield name="TX_FIFO_0P5_EMPTY_MASK" mask="0x04" caption="Active High Enable of tx_fifo_0p5_empty interrupt "/>
          <bitfield name="TX_FIFO_0P75_EMPTY_MASK" mask="0x08" caption="Active High Enable of tx_fifo_0p75_empty interrupt "/>
          <bitfield name="TX_FIFO_EMPTY_MASK" mask="0x10" caption="Active High Enable of tx_fifo_empty interrupt "/>
        </register>
        <register name="RX_INTERRUPT_MASK" offset="0x30" rw="RW" size="1" initval="0x00" caption="Enable or Disable the generation of interrupts by the rx_status register. ">
          <bitfield name="RX_FIFO_NOT_EMPTY_MASK" mask="0x01" caption="Active High Enable of rx_fifo_not_empty interrupt "/>
          <bitfield name="RX_FIFO_0P25_FULL_MASK" mask="0x02" caption="Active High Enable of rx_fifo_0p25_full interrupt "/>
          <bitfield name="RX_FIFO_0P5_FULL_MASK" mask="0x04" caption="Active High Enable of rx_fifo_0p5_full interrupt "/>
          <bitfield name="RX_FIFO_0P75_FULL_MASK" mask="0x08" caption="Active High Enable of rx_fifo_0p75_full interrupt "/>
          <bitfield name="FIFO_OVERRUN_MASK" mask="0x10" caption="Active High Enable of FIFO overrun interrupt "/>
          <bitfield name="NAK_MASK" mask="0x20" caption="Active High Enable NAK interrupt "/>
        </register>
        <register name="I2C_FLUSH" offset="0x34" rw="W" size="1" initval="0x0" caption="Writing to this address  flushes the contents of both the Tx and Rx FIFOs. The value written has no effect. Flushing the Tx FIFO will abort ongoing transactions when the current byte has been transmitted. ">
          <bitfield name="I2C_FLUSH" mask="0x1"/>
        </register>
      </register-group>
      <value-group name="I2C_TRANSMIT_DATA_ADDRESS_FLAG">
        <value name="0" caption="tx_data field bits 7:0 are Transmit Data" value="0x0"/>
        <value name="1" caption="tx_data field bit 0 is direction (0: write to slave, 1: read from slave), and bits 7:1 are the Address to transmit." value="0x1"/>
      </value-group>
      <value-group name="I2C_TRANSMIT_STATUS_TX_FIFO_NOT_FULL">
        <value name="0" caption="TX FIFO Full" value="0x0"/>
        <value name="1" caption="TX FIFO not Full" value="0x1"/>
      </value-group>
      <value-group name="I2C_CLOCK_SOURCE_SELECT_CLOCK">
        <value name="0" caption="26 MHz Clock" value="0x0"/>
        <value name="1" caption="13 MHz Clock" value="0x1"/>
        <value name="2" caption="6.5 MHz Clock" value="0x2"/>
        <value name="3" caption="3.25 MHz Clock" value="0x3"/>
      </value-group>
      <value-group name="I2C_I2C_MASTER_MODE_MASTER_ENABLE">
        <value name="0" caption="I2C Slave" value="0x0"/>
        <value name="1" caption="I2C Master" value="0x1"/>
      </value-group>
      <value-group name="I2C_I2C_ONBUS_ONBUS_ENABLE">
        <value name="0" caption="Master completes current byte and generates stop condition on bus." value="0x0"/>
        <value name="1" caption="Master tranmits contents of FIFO until empty." value="0x1"/>
      </value-group>
    </module>
