Duet3D/Duet3Expansion/src/atmel/SAMB11_DFP/2.3.190/atdf/ATSAMB11G18A.atdf
    <module name="UART" id="U1234" version="1.0.0" caption="UART Controller">
      <register-group name="UART" caption="UART Controller">
        <register name="TRANSMIT_DATA" offset="0x0" rw="W" size="1" initval="0x00" caption="Writes one byte to UART Transmit Data FIFO. ">
          <bitfield name="TX_BYTE" mask="0xFF" caption="Writes data in transmit FIFO. If byte length is set to 7, the MSB should be set to 0. "/>
        </register>
        <register name="TRANSMIT_STATUS" offset="0x4" rw="R" size="1" initval="0x00" caption="Status of the UART transmitter. Each field can generate an interrupt if corresponding bit in  the Tx interrupt mask register is set. ">
          <bitfield name="TX_FIFO_NOT_FULL" mask="0x01" caption="Active High indication when Tx FIFO can still accepts at least one more character. 0: TX FIFO Full. 1: TX FIFO not Full. "/>
          <bitfield name="TX_FIFO_0P25_EMPTY" mask="0x02" caption="Active High indication when Tx FIFO is at least quarter empty. Reset when more. "/>
          <bitfield name="TX_FIFO_0P5_EMPTY" mask="0x04" caption="Active High indication when Tx FIFO is at least half empty. Reset when more. "/>
          <bitfield name="TX_FIFO_0P75_EMPTY" mask="0x08" caption="Active High indication when Tx FIFO is at least three quarters empty. Reset when more. "/>
          <bitfield name="TX_FIFO_EMPTY" mask="0x10" caption="Active High indication when Tx FIFO is Empty and has no more character to transmit "/>
          <bitfield name="CTS_ACTIVE" mask="0x20" caption="Active High indication when flow control signal &#34;cts&#34; is active. Unaffected by cts  enable bit in config register. "/>
        </register>
        <register name="TX_INTERRUPT_MASK" offset="0x8" rw="RW" size="1" initval="0x00" caption="Enable or Disable the generation of interrupts by the tx_status register. ">
          <bitfield name="TX_FIFO_NOT_FULL_MASK" mask="0x01" caption="Active High Enable of tx_fifo_not_full interrupt "/>
          <bitfield name="TX_FIFO_0P25_EMPTY_MASK" mask="0x02" caption="Active High Enable of tx_fifo_0p25_empty interrupt "/>
          <bitfield name="TX_FIFO_0P5_EMPTY_MASK" mask="0x04" caption="Active High Enable of tx_fifo_0p5_empty interrupt "/>
          <bitfield name="TX_FIFO_0P75_EMPTY_MASK" mask="0x08" caption="Active High Enable of tx_fifo_0p75_empty interrupt "/>
          <bitfield name="TX_FIFO_EMPTY_MASK" mask="0x10" caption="Active High Enable of tx_fifo_empty interrupt "/>
          <bitfield name="CTS_ACTIVE_MASK" mask="0x20" caption="Active High Enable of cts_active interrupt "/>
        </register>
        <register name="RECEIVE_DATA" offset="0x10" rw="R" size="1" initval="0x00" caption="Read one byte from UART Receive Data FIFO. ">
          <bitfield name="RX_BYTE" mask="0xFF" caption="Oldest data in receive FIFO. If byte length is set to 7, the MSB is set to 0. "/>
        </register>
        <register name="RECEIVE_STATUS" offset="0x14" rw="R" size="1" initval="0x00" caption="Status of the UART receiver. Each field can generate an interrupt if corresponding bit in  the Rx interrupt mask register is set. ">
          <bitfield name="RX_FIFO_NOT_EMPTY" mask="0x01" caption="Active High indication when data is available in Rx FIFO. 0: RX FIFO Empty. 1: RX FIFO contains at least one byte of data. "/>
          <bitfield name="RX_FIFO_0P25_FULL" mask="0x02" caption="Active High indication when FIFO is at least quarter full. Reset when less. "/>
          <bitfield name="RX_FIFO_0P5_FULL" mask="0x04" caption="Active High indication when FIFO is at least half full. Reset when less. "/>
          <bitfield name="RX_FIFO_0P75_FULL" mask="0x08" caption="Active High indication when FIFO is at least three quarters full. Reset when less. "/>
          <bitfield name="TIMEOUT" mask="0x10" caption="Active High indication when the timeout set in the rx_timeout register has elapsed since  the last interaction with the receiver. Reset by reading the status register.  "/>
          <bitfield name="PARITY_ERROR" mask="0x20" caption="Active High indication when a receive parity error is detected. Reset by reading the status register. "/>
          <bitfield name="FIFO_OVERRUN" mask="0x40" caption="Active High indication when character is received but FIFO is full. Reset by reading the status register. "/>
          <bitfield name="FRAMING_ERROR" mask="0x80" caption="Active High indication when no stop bit is detected. Reset by reading the status register. "/>
        </register>
        <register name="RX_INTERRUPT_MASK" offset="0x18" rw="RW" size="1" initval="0x00" caption="Enable or Disable the generation of interrupts by the rx_status register. ">
          <bitfield name="RX_FIFO_NOT_EMPTY_MASK" mask="0x01" caption="Active High Enable of rx_fifo_not_empty interrupt "/>
          <bitfield name="RX_FIFO_0P25_FULL_MASK" mask="0x02" caption="Active High Enable of rx_fifo_0p25_full interrupt "/>
          <bitfield name="RX_FIFO_0P5_FULL_MASK" mask="0x04" caption="Active High Enable of rx_fifo_0p5_full interrupt "/>
          <bitfield name="RX_FIFO_0P75_FULL_MASK" mask="0x08" caption="Active High Enable of rx_fifo_0p75_full interrupt "/>
          <bitfield name="TIMEOUT_MASK" mask="0x10" caption="Active High Enable of timeout interrupt "/>
          <bitfield name="PARITY_ERROR_MASK" mask="0x20" caption="Active High Enable of parity error interrupt "/>
          <bitfield name="FIFO_OVERRUN_MASK" mask="0x40" caption="Active High Enable of FIFO overrun interrupt "/>
          <bitfield name="FRAMING_ERROR_MASK" mask="0x80" caption="Active High Enable of framing error interrupt "/>
        </register>
        <register name="RECEIVE_TIMEOUT" offset="0x1C" rw="RW" size="1" initval="0x00" caption="Timeout counter configuration. ">
          <bitfield name="TIMEOUT_VALUE" mask="0xFF" caption="Timeout counter reload value, after status register is read or character received.  Counter decrements at baud rate clock. "/>
        </register>
        <register name="UART_CONFIGURATION" offset="0x20" rw="RW" size="1" initval="0x00" caption="UART Operation Configuration Register, for both Rx and Tx. ">
          <bitfield name="NUMBER_OF_BITS" mask="0x01" values="UART_UART_CONFIGURATION_NUMBER_OF_BITS" caption="Number of bits per character, not including parity"/>
          <bitfield name="PARITY_ENABLE" mask="0x02" values="UART_UART_CONFIGURATION_PARITY_ENABLE" caption="Active High parity checking and generation enable"/>
          <bitfield name="PARITY_MODE" mask="0x0C" values="UART_UART_CONFIGURATION_PARITY_MODE" caption="Parity Mode Select"/>
          <bitfield name="STOP_BITS" mask="0x10" values="UART_UART_CONFIGURATION_STOP_BITS" caption="Number of stop bits"/>
          <bitfield name="CTS_ENABLE" mask="0x20" values="UART_UART_CONFIGURATION_CTS_ENABLE" caption="Active High Flow Control Enable. When enabled, transmission starts when cts signal is asserted"/>
        </register>
        <register name="UART_BAUD_RATE" offset="0x24" rw="RW" size="2" initval="0x0000" caption="Baud Rate Control Register. Bits 15:3 specify the integral division of the clock (divide by n),  and bit 2:0 specify the fractional division. ">
          <bitfield name="FRACTIONAL_DIVISION" mask="0x0007" caption="Fractional Division Part. If non-zero, the integer part must be at least set to 3. "/>
          <bitfield name="INTEGER_DIVISION" mask="0xFFF8" caption="Integral Division Part. Must be at least set to 2. "/>
        </register>
        <register name="UART_CLOCK_SOURCE" offset="0x28" rw="RW" size="1" initval="0x0" caption="Selects Source of UART Clock ">
          <bitfield name="CLOCK_SELECT" mask="0x3" values="UART_UART_CLOCK_SOURCE_CLOCK_SELECT" caption="Selects one of the four possible clock sources."/>
        </register>
      </register-group>
      <value-group name="UART_UART_CONFIGURATION_NUMBER_OF_BITS">
        <value name="0" caption="8 bits" value="0x0"/>
        <value name="1" caption="7 bits" value="0x1"/>
      </value-group>
      <value-group name="UART_UART_CONFIGURATION_PARITY_ENABLE">
        <value name="0" caption="Disable" value="0x0"/>
        <value name="1" caption="Enable" value="0x1"/>
      </value-group>
