Duet3D/Duet3Expansion/src/atmel/SAMB11_DFP/2.3.190/atdf/ATSAMB11G18A.atdf
      <value-group name="UART_UART_CONFIGURATION_PARITY_MODE">
        <value name="0" caption="Even Parity" value="0x0"/>
        <value name="1" caption="Odd Parity" value="0x1"/>
        <value name="2" caption="Parity bit is space" value="0x2"/>
        <value name="3" caption="Parity bit is mark" value="0x3"/>
      </value-group>
      <value-group name="UART_UART_CONFIGURATION_STOP_BITS">
        <value name="0" caption="One Bit" value="0x0"/>
        <value name="1" caption="Two Bits" value="0x1"/>
      </value-group>
      <value-group name="UART_UART_CONFIGURATION_CTS_ENABLE">
        <value name="0" caption="Disable-Transmission starts only when cts signal is asserted" value="0x0"/>
        <value name="1" caption="Enable-Transmission starts regardless of cts signal" value="0x1"/>
      </value-group>
      <value-group name="UART_UART_CLOCK_SOURCE_CLOCK_SELECT">
        <value name="0" caption="Clock input 0" value="0x0"/>
        <value name="1" caption="Clock input 1" value="0x1"/>
        <value name="2" caption="Clock input 2" value="0x2"/>
        <value name="3" caption="Clock input 3" value="0x3"/>
      </value-group>
    </module>
    <module name="SPI" id="S1234" version="1.0.0" caption="SPI Master/Slave Controller">
      <register-group name="SPI" caption="SPI Master/Slave Controller">
        <register name="TRANSMIT_DATA" offset="0x0" rw="W" size="1" initval="0x00" caption="Writes one byte to SPI Transmit Data FIFO. ">
          <bitfield name="TX_BYTE" mask="0xFF" caption="Writes data in transmit FIFO. "/>
        </register>
        <register name="RECEIVE_DATA" offset="0x4" rw="R" size="1" initval="0x00" caption="Read one byte from SPI Receive Data FIFO. ">
          <bitfield name="RX_BYTE" mask="0xFF" caption="Oldest data in receive FIFO. "/>
        </register>
        <register name="TRANSMIT_STATUS" offset="0x8" rw="R" size="1" initval="0x00" caption="Status of the SPI transmitter. Each field can generate an interrupt if corresponding bit in  the Tx interrupt mask register is set. ">
          <bitfield name="TX_FIFO_NOT_FULL" mask="0x01" values="SPI_TRANSMIT_STATUS_TX_FIFO_NOT_FULL" caption="Active High indication when Tx FIFO can still accepts at least one more character."/>
          <bitfield name="TX_FIFO_0P25_EMPTY" mask="0x02" caption="Active High indication when Tx FIFO is at least quarter empty. Reset when more. "/>
          <bitfield name="TX_FIFO_0P5_EMPTY" mask="0x04" caption="Active High indication when Tx FIFO is at least half empty. Reset when more. "/>
          <bitfield name="TX_FIFO_0P75_EMPTY" mask="0x08" caption="Active High indication when Tx FIFO is at least three quarters empty. Reset when more. "/>
          <bitfield name="TX_FIFO_EMPTY" mask="0x10" caption="Active High indication when Tx FIFO is Empty and has no more character to transmit "/>
        </register>
        <register name="RECEIVE_STATUS" offset="0xC" rw="R" size="1" initval="0x00" caption="Status of the SPI receiver. Each field can generate an interrupt if corresponding bit in  the Rx interrupt mask register is set. ">
          <bitfield name="RX_FIFO_NOT_EMPTY" mask="0x01" caption="Active High indication when data is available in Rx FIFO"/>
          <bitfield name="RX_FIFO_0P25_FULL" mask="0x02" caption="Active High indication when FIFO is at least quarter full. Reset when less. "/>
          <bitfield name="RX_FIFO_0P5_FULL" mask="0x04" caption="Active High indication when FIFO is at least half full. Reset when less. "/>
          <bitfield name="RX_FIFO_0P75_FULL" mask="0x08" caption="Active High indication when FIFO is at least three quarters full. Reset when less. "/>
          <bitfield name="FAULT" mask="0x10" caption="Active High indication when two masters attempt to access the SPI bus at the same time. The SPI interface will put itself in slave mode in this case. This bit is reset when the status register is read.  "/>
          <bitfield name="FIFO_OVERRUN" mask="0x20" caption="Active High indication when character is received but FIFO is full. Reset by reading  the status register. "/>
        </register>
        <register name="CLOCK_SOURCE_SELECT" offset="0x10" rw="RW" size="1" initval="0x0" caption="Clock Source Select">
          <bitfield name="CLOCK" mask="0x3" values="SPI_CLOCK_SOURCE_SELECT_CLOCK" caption="Clock Used to Generate Divided Clock"/>
        </register>
        <register name="SPI_CLK_DIVIDER" offset="0x14" rw="RW" size="2" initval="0x0000" caption="Register sets the divide ratio used to generate the sck clock from the module's input clock. ">
          <bitfield name="SPI_DIVIDE_RATIO" mask="0xFFFF" caption="Clock Divide Ratio. The input clock signal is divided by (n+1) where n is the value set in  this field.  The minimum division is by 2; a value of 0 is illegal. "/>
        </register>
        <register name="SPI_MODULE_ENABLE" offset="0x18" rw="RW" size="1" initval="0x0" caption="SPI Enable">
          <bitfield name="ENABLE" mask="0x1" caption="Enables SPI operation"/>
        </register>
        <register name="SPI_MASTER_MODE" offset="0x1C" rw="RW" size="1" initval="0x0" caption="SPI Master/Slave Mode. When clear, SPI is in Slave Mode. ">
          <bitfield name="MASTER_ENABLE" mask="0x1" values="SPI_SPI_MASTER_MODE_MASTER_ENABLE" caption="Active High SPI Master Mode Enable"/>
        </register>
        <register name="SPI_FAULT_ENABLE" offset="0x20" rw="RW" size="1" initval="0x0" caption="SPI Fault Detection Mode. If set, SPI bus contention will be detected, and the fault  bit in the rx_status register will be set, forcing the SPI Module into idle state.  When a fault is detected, the current SPI transaction is abandoned and the interface switches  to slave mode in the wait state.  ">
          <bitfield name="FAULT_ENABLE" mask="0x1" values="SPI_SPI_FAULT_ENABLE_FAULT_ENABLE" caption="Active High SPI Fault Detect Enable"/>
        </register>
        <register name="SPI_CONFIGURATION" offset="0x24" rw="RW" size="1" initval="0xE0" caption="SPI Operation Configuration Register. This register should not be modified while SPI bus is active,  otherwise the SPI Module state shall not be guaranteed. ">
          <bitfield name="SCK_POLARITY" mask="0x01" values="SPI_SPI_CONFIGURATION_SCK_POLARITY" caption="Selects the level of sck in Idle State"/>
          <bitfield name="SCK_PHASE" mask="0x02" values="SPI_SPI_CONFIGURATION_SCK_PHASE" caption="Selects clock edge used for data sampling and launching"/>
          <bitfield name="LSB_FIRST_ENABLE" mask="0x04" values="SPI_SPI_CONFIGURATION_LSB_FIRST_ENABLE" caption="Selects LSB bits to be transmitted first"/>
          <bitfield name="BIDIRECTIONAL_ENABLE" mask="0x08" values="SPI_SPI_CONFIGURATION_BIDIRECTIONAL_ENABLE" caption="Enable Bidirectional mode of operation"/>
          <bitfield name="OUTPUT_ENABLE" mask="0x10" values="SPI_SPI_CONFIGURATION_OUTPUT_ENABLE" caption="Active High Output Enable when in Bidirectional Mode"/>
          <bitfield name="SSN_SHIFT_ENABLE" mask="0x20" values="SPI_SPI_CONFIGURATION_SSN_SHIFT_ENABLE" caption="Active High Shift Enable when SSN signal is asserted"/>
          <bitfield name="SSN_SYNC_ENABLE" mask="0x40" values="SPI_SPI_CONFIGURATION_SSN_SYNC_ENABLE" caption="Active High SSN Signal Synchronisation Enable"/>
          <bitfield name="RX_DONE_SYNC_ENABLE" mask="0x80" values="SPI_SPI_CONFIGURATION_RX_DONE_SYNC_ENABLE" caption="Active High rx_done Signal Synchronisation Enable"/>
        </register>
        <register name="SPI_BUS_STATUS" offset="0x28" rw="R" size="1" initval="0x0" caption="Status of SPI bus. ">
          <bitfield name="SPI_ACTIVE" mask="0x1" caption="Active High indicatation that the SPI Module is active. While set, SPI configuration should not be modified. "/>
        </register>
        <register name="TX_INTERRUPT_MASK" offset="0x2C" rw="RW" size="1" initval="0x00" caption="Enable or Disable the generation of interrupts by the tx_status register. ">
          <bitfield name="TX_FIFO_NOT_FULL_MASK" mask="0x01" caption="Active High Enable of tx_fifo_not_full interrupt "/>
          <bitfield name="TX_FIFO_0P25_EMPTY_MASK" mask="0x02" caption="Active High Enable of tx_fifo_0p25_empty interrupt "/>
          <bitfield name="TX_FIFO_0P5_EMPTY_MASK" mask="0x04" caption="Active High Enable of tx_fifo_0p5_empty interrupt "/>
          <bitfield name="TX_FIFO_0P75_EMPTY_MASK" mask="0x08" caption="Active High Enable of tx_fifo_0p75_empty interrupt "/>
          <bitfield name="TX_FIFO_EMPTY_MASK" mask="0x10" caption="Active High Enable of tx_fifo_empty interrupt "/>
        </register>
