Duet3D/Duet3Expansion/src/atmel/SAMB11_DFP/2.3.190/atdf/ATSAMB11G18A.atdf
        <register name="EFUSE_4_PROG_0" offset="0x7C" rw="RW" size="4" initval="0x00000000" caption="EFUSE_4_0 Program Register">
          <bitfield name="EFUSE_4_PROG_0" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_4_PROG_1" offset="0x80" rw="RW" size="4" initval="0x00000000" caption="EFUSE_4_1 Program Register">
          <bitfield name="EFUSE_4_PROG_1" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_4_PROG_2" offset="0x84" rw="RW" size="4" initval="0x00000000" caption="EFUSE_4_2 Program Register">
          <bitfield name="EFUSE_4_PROG_2" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_4_PROG_3" offset="0x88" rw="RW" size="4" initval="0x00000000" caption="EFUSE_4_3 Program Register">
          <bitfield name="EFUSE_4_PROG_3" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_4_STATUS_0" offset="0x8C" rw="R" size="4" initval="0x00000000" caption="EFUSE_4_0 Status">
          <bitfield name="EFUSE_4_STATUS_0" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_4_STATUS_1" offset="0x90" rw="R" size="4" initval="0x00000000" caption="EFUSE_4_1 Status">
          <bitfield name="EFUSE_4_STATUS_1" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_4_STATUS_2" offset="0x94" rw="R" size="4" initval="0x00000000" caption="EFUSE_4_2 Status">
          <bitfield name="EFUSE_4_STATUS_2" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_4_STATUS_3" offset="0x98" rw="R" size="4" initval="0x00000000" caption="EFUSE_4_3 Status">
          <bitfield name="EFUSE_4_STATUS_3" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_5_PROG_0" offset="0x9C" rw="RW" size="4" initval="0x00000000" caption="EFUSE_4_0 Program Register">
          <bitfield name="EFUSE_5_PROG_0" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_5_PROG_1" offset="0xA0" rw="RW" size="4" initval="0x00000000" caption="EFUSE_5_1 Program Register">
          <bitfield name="EFUSE_5_PROG_1" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_5_PROG_2" offset="0xA4" rw="RW" size="4" initval="0x00000000" caption="EFUSE_5_2 Program Register">
          <bitfield name="EFUSE_5_PROG_2" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_5_PROG_3" offset="0xA8" rw="RW" size="4" initval="0x00000000" caption="EFUSE_5_3 Program Register">
          <bitfield name="EFUSE_5_PROG_3" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_5_STATUS_0" offset="0xAC" rw="R" size="4" initval="0x00000000" caption="EFUSE_5_0 Status">
          <bitfield name="EFUSE_5_STATUS_0" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_5_STATUS_1" offset="0xB0" rw="R" size="4" initval="0x00000000" caption="EFUSE_5_1 Status">
          <bitfield name="EFUSE_5_STATUS_1" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_5_STATUS_2" offset="0xB4" rw="R" size="4" initval="0x00000000" caption="EFUSE_5_2 Status">
          <bitfield name="EFUSE_5_STATUS_2" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_5_STATUS_3" offset="0xB8" rw="R" size="4" initval="0x00000000" caption="EFUSE_5_3 Status">
          <bitfield name="EFUSE_5_STATUS_3" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_6_PROG_0" offset="0xBC" rw="RW" size="4" initval="0x00000000" caption="EFUSE_6_0 Program Register">
          <bitfield name="EFUSE_6_PROG_0" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_6_PROG_1" offset="0xC0" rw="RW" size="4" initval="0x00000000" caption="EFUSE_6_1 Program Register">
          <bitfield name="EFUSE_6_PROG_1" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_6_PROG_2" offset="0xC4" rw="RW" size="4" initval="0x00000000" caption="EFUSE_6_2 Program Register">
          <bitfield name="EFUSE_6_PROG_2" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_6_PROG_3" offset="0xC8" rw="RW" size="4" initval="0x00000000" caption="EFUSE_6_3 Program Register">
          <bitfield name="EFUSE_6_PROG_3" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_6_STATUS_0" offset="0xCC" rw="R" size="4" initval="0x00000000" caption="EFUSE_6_0 Status">
          <bitfield name="EFUSE_6_STATUS_0" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_6_STATUS_1" offset="0xD0" rw="R" size="4" initval="0x00000000" caption="EFUSE_6_1 Status">
          <bitfield name="EFUSE_6_STATUS_1" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_6_STATUS_2" offset="0xD4" rw="R" size="4" initval="0x00000000" caption="EFUSE_6_2 Status">
          <bitfield name="EFUSE_6_STATUS_2" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_6_STATUS_3" offset="0xD8" rw="R" size="4" initval="0x00000000" caption="EFUSE_6_3 Status">
          <bitfield name="EFUSE_6_STATUS_3" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFUSE_MISC_CTRL" offset="0xDC" rw="R" size="1" initval="0x0" caption="EFUSE 6 Control Register">
          <bitfield name="OUT_OF_RESET" mask="0x1" caption="Read back the status of the eFuse out of reset"/>
        </register>
      </register-group>
    </module>
    <module name="LPMCU_MISC_REGS" id="LMR1234" version="1.0.0" caption="LPMCU Misc Registers">
      <register-group name="LPMCU_MISC_REGS" caption="LPMCU Misc Registers">
        <register name="LPMCU_CHIP_ID" offset="0x0" rw="R" size="4" initval="0x2000B0" caption="The hard-coded ID for the chip.">
          <bitfield name="REV_ID" mask="0xFFFFFF" caption="Chip ID"/>
        </register>
        <register name="LPMCU_GLOBAL_RESET_0" offset="0x4" rw="RW" size="4" initval="0xFFFFFFFD" caption="Active Low Global Reset">
          <bitfield name="GLOBAL_RSTN" mask="0x00000001" caption="LPMCU Global Reset (self setting)"/>
          <bitfield name="CPU_RSTN" mask="0x00000002" caption="LPMCU CPU Reset"/>
          <bitfield name="SPI_FLASH0_SYS_RSTN" mask="0x00000004" caption="SPI_FLASH0 Sys Reset"/>
          <bitfield name="SPI_FLASH0_RSTN" mask="0x00000008" caption="SPI_FLASH0 Interface Reset"/>
          <bitfield name="SPI0_CORE_RSTN" mask="0x00000010" caption="SPI0 Core Reset"/>
          <bitfield name="SPI0_IF_RSTN" mask="0x00000020" caption="SPI0 Interface Reset"/>
          <bitfield name="SPI1_CORE_RESETN" mask="0x00000040" caption="SPI1 Core Reset"/>
          <bitfield name="SPI1_IF_RSTN" mask="0x00000080" caption="SPI1 Interface Reset"/>
          <bitfield name="I2C0_CORE_RSTN" mask="0x00000100" caption="I2C0 Core Reset"/>
          <bitfield name="I2C0_IF_RSTN" mask="0x00000200" caption="I2C0 Interface Reset"/>
          <bitfield name="GPIO_RSTN" mask="0x00000400" caption="GPIO Controller Reset"/>
          <bitfield name="TIMER0_RSTN" mask="0x00000800" caption="TIMER0 Reset"/>
          <bitfield name="UART0_CORE_RSTN" mask="0x00001000" caption="UART0 Core Reset"/>
          <bitfield name="UART0_IF_RSTN" mask="0x00002000" caption="UART0 Interface Reset"/>
          <bitfield name="UART1_CORE_RSTN" mask="0x00004000" caption="UART1 Core Reset"/>
          <bitfield name="UART1_IF_RSTN" mask="0x00008000" caption="UART1 Interface Reset"/>
          <bitfield name="WDT0_RSTN" mask="0x00010000" caption="WDT0 Reset"/>
          <bitfield name="WDT1_RSTN" mask="0x00020000" caption="WDT1 Reset"/>
          <bitfield name="IRQ_CTRLR_CORE_RSTN" mask="0x00040000" caption="NVIC Reset"/>
          <bitfield name="MBIST_RSTN" mask="0x00080000" caption="MBIST Logic Reset"/>
          <bitfield name="CALIB_RSTN" mask="0x00100000" caption="Low Power Clock Calibration Core Reset"/>
          <bitfield name="CALIB_XBAR_IF_RSTN" mask="0x00200000" caption="Low Power Clock Calibration APB Reset"/>
          <bitfield name="DBUG_RSTN" mask="0x00400000" caption="LPMCU Debug Reset"/>
          <bitfield name="ARM_FREE_CLK_RSTN" mask="0x00800000" caption="Free Running ARM Clock Reset"/>
          <bitfield name="ARM_PRESETN_RSTN" mask="0x01000000" caption="ARM APB Reset"/>
          <bitfield name="QUAD_DEC0_RSTN" mask="0x02000000" caption="QUAD_DEC0 Reset"/>
          <bitfield name="QUAD_DEC1_RSTN" mask="0x04000000" caption="QUAD_DEC1 Reset"/>
          <bitfield name="QUAD_DEC2_RSTN" mask="0x08000000" caption="QUAD_DEC2 Reset"/>
          <bitfield name="PWM0_RSTN" mask="0x10000000" caption="PWM0 Reset"/>
          <bitfield name="PWM1_RSTN" mask="0x20000000" caption="PWM1 Reset"/>
          <bitfield name="PWM2_RSTN" mask="0x40000000" caption="PWM2 Reset"/>
          <bitfield name="PWM3_RSTN" mask="0x80000000" caption="PWM3 Reset"/>
        </register>
