Duet3D/Duet3Expansion/src/atmel/SAMB11_DFP/2.3.190/atdf/ATSAMB11G18A.atdf
        <register name="PINMUX_SEL_2" offset="0x4C" rw="RW" size="4" initval="0x00000000" caption="Pinmux select for LP_GPIO_16, LP_GPIO_17, LP_GPIO_18, LP_GPIO_19, LP_GPIO_20, LP_GPIO_21, LP_GPIO_22, LP_GPIO_23">
          <bitfield name="LP_GPIO_16_SEL" mask="0x00000007" values="LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_16_SEL" caption="Pinmux select for LP_GPIO_16"/>
          <bitfield name="LP_GPIO_17_SEL" mask="0x00000070" values="LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_17_SEL" caption="Pinmux select for LP_GPIO_17"/>
          <bitfield name="LP_GPIO_18_SEL" mask="0x00000700" values="LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_18_SEL" caption="Pinmux select for LP_GPIO_18"/>
          <bitfield name="LP_GPIO_19_SEL" mask="0x00007000" values="LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_19_SEL" caption="Pinmux select for LP_GPIO_19"/>
          <bitfield name="LP_GPIO_20_SEL" mask="0x00070000" values="LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_20_SEL" caption="Pinmux select for LP_GPIO_20"/>
          <bitfield name="LP_GPIO_21_SEL" mask="0x00700000" values="LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_21_SEL" caption="Pinmux select for LP_GPIO_21"/>
          <bitfield name="LP_GPIO_22_SEL" mask="0x07000000" values="LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_22_SEL" caption="Pinmux select for LP_GPIO_22"/>
          <bitfield name="LP_GPIO_23_SEL" mask="0x70000000" values="LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_23_SEL" caption="Pinmux select for LP_GPIO_23"/>
        </register>
        <register name="PULL_ENABLE" offset="0x50" rw="RW" size="4" initval="0x00000000" caption="Active Low Pull Enables for LPMCU Pads">
          <bitfield name="LP_GPIO_0" mask="0x00000001" caption="Pull Enable for LP_GPIO_0"/>
          <bitfield name="LP_GPIO_1" mask="0x00000002" caption="Pull Enable for LP_GPIO_1"/>
          <bitfield name="LP_GPIO_2" mask="0x00000004" caption="Pull Enable for LP_GPIO_2"/>
          <bitfield name="LP_GPIO_3" mask="0x00000008" caption="Pull Enable for LP_GPIO_3"/>
          <bitfield name="LP_GPIO_4" mask="0x00000010" caption="Pull Enable for LP_GPIO_4"/>
          <bitfield name="LP_GPIO_5" mask="0x00000020" caption="Pull Enable for LP_GPIO_5"/>
          <bitfield name="LP_GPIO_6" mask="0x00000040" caption="Pull Enable for LP_GPIO_6"/>
          <bitfield name="LP_GPIO_7" mask="0x00000080" caption="Pull Enable for LP_GPIO_7"/>
          <bitfield name="LP_GPIO_8" mask="0x00000100" caption="Pull Enable for LP_GPIO_8"/>
          <bitfield name="LP_GPIO_9" mask="0x00000200" caption="Pull Enable for LP_GPIO_9"/>
          <bitfield name="LP_GPIO_10" mask="0x00000400" caption="Pull Enable for LP_GPIO_10"/>
          <bitfield name="LP_GPIO_11" mask="0x00000800" caption="Pull Enable for LP_GPIO_11"/>
          <bitfield name="LP_GPIO_12" mask="0x00001000" caption="Pull Enable for LP_GPIO_12"/>
          <bitfield name="LP_GPIO_13" mask="0x00002000" caption="Pull Enable for LP_GPIO_13"/>
          <bitfield name="LP_GPIO_14" mask="0x00004000" caption="Pull Enable for LP_GPIO_14"/>
          <bitfield name="LP_GPIO_15" mask="0x00008000" caption="Pull Enable for LP_GPIO_15"/>
          <bitfield name="LP_GPIO_16" mask="0x00010000" caption="Pull Enable for LP_GPIO_16"/>
          <bitfield name="LP_GPIO_17" mask="0x00020000" caption="Pull Enable for LP_GPIO_17"/>
          <bitfield name="LP_GPIO_18" mask="0x00040000" caption="Pull Enable for LP_GPIO_18"/>
          <bitfield name="LP_GPIO_19" mask="0x00080000" caption="Pull Enable for LP_GPIO_19"/>
          <bitfield name="LP_GPIO_20" mask="0x00100000" caption="Pull Enable for LP_GPIO_20"/>
          <bitfield name="LP_GPIO_21" mask="0x00200000" caption="Pull Enable for LP_GPIO_21"/>
          <bitfield name="LP_GPIO_22" mask="0x00400000" caption="Pull Enable for LP_GPIO_22"/>
          <bitfield name="LP_GPIO_23" mask="0x00800000" caption="Pull Enable for LP_GPIO_23"/>
          <bitfield name="LP_SIP_0" mask="0x08000000" caption="Pull Enable for LP_SIP_0"/>
          <bitfield name="LP_SIP_1" mask="0x10000000" caption="Pull Enable for LP_SIP_1"/>
          <bitfield name="LP_SIP_2" mask="0x20000000" caption="Pull Enable for LP_SIP_2"/>
          <bitfield name="LP_SIP_3" mask="0x40000000" caption="Pull Enable for LP_SIP_3"/>
          <bitfield name="LP_SIP_4" mask="0x80000000" caption="Pull Enable for LP_SIP_4"/>
        </register>
        <register name="RTYPE_PAD_0" offset="0x54" rw="RW" size="4" initval="0x0000000" caption="Controls the RTYPE (Pull Level) pad value for LPMCU Pads (0 = Pull Up)">
          <bitfield name="LP_GPIO_0" mask="0x0000001" caption="Controls RTYPE (Pull Level) value for LP_GPIO_0"/>
          <bitfield name="LP_GPIO_1" mask="0x0000002" caption="Controls RTYPE (Pull Level) value LP_GPIO_1"/>
          <bitfield name="LP_GPIO_2" mask="0x0000004" caption="Controls RTYPE (Pull Level) value LP_GPIO_2"/>
          <bitfield name="LP_GPIO_3" mask="0x0000008" caption="Controls RTYPE (Pull Level) value LP_GPIO_3"/>
          <bitfield name="LP_GPIO_4" mask="0x0000010" caption="Controls RTYPE (Pull Level) value LP_GPIO_4"/>
          <bitfield name="LP_GPIO_5" mask="0x0000020" caption="Controls RTYPE (Pull Level) value LP_GPIO_5"/>
          <bitfield name="LP_GPIO_6" mask="0x0000040" caption="Controls RTYPE (Pull Level) value LP_GPIO_6"/>
          <bitfield name="LP_GPIO_7" mask="0x0000080" caption="Controls RTYPE (Pull Level) value LP_GPIO_7"/>
          <bitfield name="LP_GPIO_8" mask="0x0000100" caption="Controls RTYPE (Pull Level) value for LP_GPIO_8"/>
          <bitfield name="LP_GPIO_9" mask="0x0000200" caption="Controls RTYPE (Pull Level) value LP_GPIO_9"/>
          <bitfield name="LP_GPIO_10" mask="0x0000400" caption="Controls RTYPE (Pull Level) value LP_GPIO_10"/>
          <bitfield name="LP_GPIO_11" mask="0x0000800" caption="Controls RTYPE (Pull Level) value LP_GPIO_11"/>
          <bitfield name="LP_GPIO_12" mask="0x0001000" caption="Controls RTYPE (Pull Level) value LP_GPIO_12"/>
          <bitfield name="LP_GPIO_13" mask="0x0002000" caption="Controls RTYPE (Pull Level) value LP_GPIO_13"/>
          <bitfield name="LP_GPIO_14" mask="0x0004000" caption="Controls RTYPE (Pull Level) value LP_GPIO_14"/>
          <bitfield name="LP_GPIO_15" mask="0x0008000" caption="Controls RTYPE (Pull Level) value LP_GPIO_15"/>
          <bitfield name="LP_GPIO_16" mask="0x0010000" caption="Controls RTYPE (Pull Level) value LP_GPIO_16"/>
          <bitfield name="LP_GPIO_17" mask="0x0020000" caption="Controls RTYPE (Pull Level) value LP_GPIO_17"/>
          <bitfield name="LP_GPIO_18" mask="0x0040000" caption="Controls RTYPE (Pull Level) value LP_GPIO_18"/>
          <bitfield name="LP_GPIO_19" mask="0x0080000" caption="Controls RTYPE (Pull Level) value LP_GPIO_19"/>
          <bitfield name="LP_GPIO_20" mask="0x0100000" caption="Controls RTYPE (Pull Level) value LP_GPIO_20"/>
          <bitfield name="LP_GPIO_21" mask="0x0200000" caption="Controls RTYPE (Pull Level) value LP_GPIO_21"/>
          <bitfield name="LP_GPIO_22" mask="0x0400000" caption="Controls RTYPE (Pull Level) value LP_GPIO_22"/>
          <bitfield name="LP_GPIO_23" mask="0x0800000" caption="Controls RTYPE (Pull Level) value LP_GPIO_23"/>
        </register>
        <register name="PINMUX_SEL_3" offset="0x68" rw="RW" size="4" initval="0x00000" caption="Pinmux select for LP_SIP_0, LP_SIP_1, LP_SIP_2, LP_SIP_3, LP_SIP_4">
          <bitfield name="LP_SIP_0_SEL" mask="0x00007" values="LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_0_SEL" caption="Pinmux select for LP_SIP_0"/>
          <bitfield name="LP_SIP_1_SEL" mask="0x00070" values="LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_1_SEL" caption="Pinmux select for LP_SIP_1"/>
          <bitfield name="LP_SIP_2_SEL" mask="0x00700" values="LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_2_SEL" caption="Pinmux select for LP_SIP_2"/>
          <bitfield name="LP_SIP_3_SEL" mask="0x07000" values="LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_3_SEL" caption="Pinmux select for LP_SIP_3"/>
          <bitfield name="LP_SIP_4_SEL" mask="0x70000" values="LPMCU_MISC_REGS_PINMUX_SEL_3_LP_SIP_4_SEL" caption="Pinmux select for LP_SIP_4"/>
        </register>
        <register name="ISHAPE_PAD_3" offset="0x6C" rw="RW" size="4" initval="0x55555" caption="Controls the ISHAPE pad value for LPMCU SIP Pads">
          <bitfield name="LP_SIP_0" mask="0x00007" caption="Controls ISHAPE value LP_SIP_0"/>
          <bitfield name="LP_SIP_1" mask="0x00070" caption="Controls ISHAPE value LP_SIP_1"/>
          <bitfield name="LP_SIP_2" mask="0x00700" caption="Controls ISHAPE value LP_SIP_2"/>
          <bitfield name="LP_SIP_3" mask="0x07000" caption="Controls ISHAPE value LP_SIP_3"/>
          <bitfield name="LP_SIP_4" mask="0x70000" caption="Controls ISHAPE value LP_SIP_4"/>
        </register>
        <register name="LPMCU_CTRL_2" offset="0x90" rw="RW" size="1" initval="0x00" caption="Misc control for the LPMCU">
          <bitfield name="SPI_FLASH0_CLOCK_FRAC_VALUE" mask="0xFF" caption="SPI_FLASH0 Fractional Divider Value"/>
        </register>
