Duet3D/Duet3Expansion/src/atmel/SAMB11_DFP/2.3.190/atdf/ATSAMB11G18A.atdf
        <register name="SPIFLASH_VDDIO_CTRL" offset="0xA0" rw="RW" size="1" initval="0x1" caption="Control for VDDIO of SPI FLASH">
          <bitfield name="ENABLE" mask="0x1" caption="Enables power for the stacked (internal) SPI FLASH"/>
        </register>
        <register name="SPIFLASH_BYPASS" offset="0xA4" rw="RW" size="1" initval="0x0" caption="SPI FLASH Bypass">
          <bitfield name="ENABLE" mask="0x1" caption="Enables Bypass of SPI Flash Controller"/>
        </register>
        <register name="IRQ_MUX_IO_SEL_0" offset="0xC0" rw="RW" size="4" initval="0x00000000" caption="ARM Cortex IRQ Mux Selection">
          <bitfield name="MUX_0" mask="0x0000001F" values="LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_0" caption="IRQ_0 Source Selection"/>
          <bitfield name="MUX_1" mask="0x00001F00" values="LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_1" caption="IRQ_1 Source Selection"/>
          <bitfield name="MUX_2" mask="0x001F0000" values="LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_2" caption="IRQ_2 Source Selection"/>
          <bitfield name="MUX_3" mask="0x1F000000" values="LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_0_MUX_3" caption="IRQ_3 Source Selection"/>
        </register>
        <register name="IRQ_MUX_IO_SEL_1" offset="0xC4" rw="RW" size="4" initval="0x00000000" caption="ARM Cortex IRQ Mux Selection">
          <bitfield name="MUX_4" mask="0x0000001F" values="LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_4" caption="IRQ_4 Source Selection"/>
          <bitfield name="MUX_5" mask="0x00001F00" values="LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_5" caption="IRQ_5 Source Selection"/>
          <bitfield name="MUX_6" mask="0x001F0000" values="LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_6" caption="IRQ_6 Source Selection"/>
          <bitfield name="MUX_7" mask="0x1F000000" values="LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_1_MUX_7" caption="IRQ_7 Source Selection"/>
        </register>
        <register name="IRQ_MUX_IO_SEL_2" offset="0xC8" rw="RW" size="4" initval="0x00000000" caption="ARM Cortex IRQ Mux Selection">
          <bitfield name="MUX_8" mask="0x0000001F" values="LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_8" caption="IRQ_8 Source Selection"/>
          <bitfield name="MUX_9" mask="0x00001F00" values="LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_9" caption="IRQ_9 Source Selection"/>
          <bitfield name="MUX_10" mask="0x001F0000" values="LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_10" caption="IRQ_10 Source Selection"/>
          <bitfield name="MUX_11" mask="0x1F000000" values="LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_2_MUX_11" caption="IRQ_11 Source Selection"/>
        </register>
        <register name="IRQ_MUX_IO_SEL_3" offset="0xCC" rw="RW" size="4" initval="0x00000000" caption="ARM Cortex IRQ Mux Selection">
          <bitfield name="MUX_12" mask="0x0000001F" values="LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_12" caption="IRQ_12 Source Selection"/>
          <bitfield name="MUX_13" mask="0x00001F00" values="LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_13" caption="IRQ_13 Source Selection"/>
          <bitfield name="MUX_14" mask="0x001F0000" values="LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_14" caption="IRQ_14 Source Selection"/>
          <bitfield name="MUX_15" mask="0x1F000000" values="LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_3_MUX_15" caption="IRQ_15 Source Selection"/>
        </register>
        <register name="IRQ_MUX_IO_SEL_4" offset="0xD0" rw="RW" size="4" initval="0x00000000" caption="ARM Cortex IRQ Mux Selection">
          <bitfield name="MUX_16" mask="0x0000001F" values="LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_16" caption="IRQ_16 Source Selection"/>
          <bitfield name="MUX_17" mask="0x00001F00" values="LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_17" caption="IRQ_17 Source Selection"/>
          <bitfield name="MUX_18" mask="0x001F0000" values="LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_18" caption="IRQ_18 Source Selection"/>
          <bitfield name="MUX_19" mask="0x1F000000" values="LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_4_MUX_19" caption="IRQ_19 Source Selection"/>
        </register>
        <register name="IRQ_MUX_IO_SEL_5" offset="0xD4" rw="RW" size="1" initval="0x00" caption="ARM Cortex IRQ Mux Selection">
          <bitfield name="MUX_20" mask="0x1F" values="LPMCU_MISC_REGS_IRQ_MUX_IO_SEL_5_MUX_20" caption="IRQ_20 Source Selection"/>
        </register>
        <register name="PWM0_CTRL" offset="0x160" rw="RW" size="4" initval="0x000000" caption="PWM0 Control Register">
          <bitfield name="PWM_EN" mask="0x000001" caption="Active High PWM Enable"/>
          <bitfield name="OUTPUT_POLARITY" mask="0x000002" caption="1 to inverse the polarity"/>
          <bitfield name="AGCDATA_FMT" mask="0x000004" caption="AGC data format"/>
          <bitfield name="SAMPLE_METHOD" mask="0x000008" values="LPMCU_MISC_REGS_PWM0_CTRL_SAMPLE_METHOD" caption="Sample Method"/>
          <bitfield name="PWM_PERIOD" mask="0x0001E0" caption="programmable PWM update period"/>
          <bitfield name="AGCDATA_IN" mask="0x07FE00" caption="agc value from AGC"/>
          <bitfield name="CLOCK_SEL" mask="0x600000" values="LPMCU_MISC_REGS_PWM0_CTRL_CLOCK_SEL" caption="PWM Source Clock Frequency Select"/>
        </register>
        <register name="PWM1_CTRL" offset="0x164" rw="RW" size="4" initval="0x000000" caption="PWM1 Control Register">
          <bitfield name="PWM_EN" mask="0x000001" caption="Active High PWM Enable"/>
          <bitfield name="OUTPUT_POLARITY" mask="0x000002" caption="1 to inverse the polarity"/>
          <bitfield name="AGCDATA_FMT" mask="0x000004" caption="AGC data format"/>
          <bitfield name="SAMPLE_METHOD" mask="0x000008" values="LPMCU_MISC_REGS_PWM1_CTRL_SAMPLE_METHOD" caption="Sample Method"/>
          <bitfield name="PWM_PERIOD" mask="0x0001E0" caption="programmable PWM update period"/>
          <bitfield name="AGCDATA_IN" mask="0x07FE00" caption="agc value from AGC"/>
          <bitfield name="CLOCK_SEL" mask="0x600000" values="LPMCU_MISC_REGS_PWM1_CTRL_CLOCK_SEL" caption="PWM Source Clock Frequency Select"/>
        </register>
        <register name="PWM2_CTRL" offset="0x168" rw="RW" size="4" initval="0x000000" caption="PWM2 Control Register">
          <bitfield name="PWM_EN" mask="0x000001" caption="Active High PWM Enable"/>
          <bitfield name="OUTPUT_POLARITY" mask="0x000002" caption="1 to inverse the polarity"/>
          <bitfield name="AGCDATA_FMT" mask="0x000004" caption="AGC data format"/>
          <bitfield name="SAMPLE_METHOD" mask="0x000008" values="LPMCU_MISC_REGS_PWM2_CTRL_SAMPLE_METHOD" caption="Sample Method"/>
          <bitfield name="PWM_PERIOD" mask="0x0001E0" caption="programmable PWM update period"/>
          <bitfield name="AGCDATA_IN" mask="0x07FE00" caption="agc value from AGC"/>
          <bitfield name="CLOCK_SEL" mask="0x600000" values="LPMCU_MISC_REGS_PWM2_CTRL_CLOCK_SEL" caption="PWM Source Clock Frequency Select"/>
        </register>
        <register name="PWM3_CTRL" offset="0x16C" rw="RW" size="4" initval="0x000000" caption="PWM3 Control Register">
          <bitfield name="PWM_EN" mask="0x000001" caption="Active High PWM Enable"/>
          <bitfield name="OUTPUT_POLARITY" mask="0x000002" caption="1 to inverse the polarity"/>
          <bitfield name="AGCDATA_FMT" mask="0x000004" caption="AGC data format"/>
          <bitfield name="SAMPLE_METHOD" mask="0x000008" values="LPMCU_MISC_REGS_PWM3_CTRL_SAMPLE_METHOD" caption="Sample Method"/>
          <bitfield name="PWM_PERIOD" mask="0x0001E0" caption="programmable PWM update period"/>
          <bitfield name="AGCDATA_IN" mask="0x07FE00" caption="agc value from AGC"/>
          <bitfield name="CLOCK_SEL" mask="0x600000" values="LPMCU_MISC_REGS_PWM3_CTRL_CLOCK_SEL" caption="PWM Source Clock Frequency Select"/>
        </register>
        <register name="MBIST_DUAL_STATUS" offset="0x170" rw="R" size="4" initval="0x000000" caption="Reflects the status of MBIST from lpmcu and btmcu">
          <bitfield name="MBIST_BUS" mask="0x1FFFFF" caption="Observation of lpmcu and btmcu MBIST results"/>
        </register>
        <register name="DUALTIMER0_CTRL" offset="0x188" rw="RW" size="1" initval="0x0" caption="DUALTIMER0 Control">
          <bitfield name="CNTR_1_ENABLE" mask="0x1" caption="Enable Dual Timer 1 Decoder"/>
          <bitfield name="CNTR_2_ENABLE" mask="0x2" caption="Enable Dual Timer 2 Decoder"/>
        </register>
        <register name="ARM_SLEEP_WAKEUP_CTRL" offset="0x190" rw="RW" size="4" initval="0x1000000" caption="Sleep and Wakeup Control for the AON Power Sequencer">
          <bitfield name="SLEEP_1" mask="0x0000001" caption="Sleep Request 1 from the ARM to the AON Power Sequencer"/>
          <bitfield name="WAKEUP" mask="0x0010000" caption="Wakeup Request from the ARM to the AON Power Sequencer"/>
          <bitfield name="RXTX_WAKEUP" mask="0x1000000" caption="Wakeup Request from the ARM to the RxTx Sequencer"/>
        </register>
        <register name="MEGA_MUX_IO_SEL_0" offset="0x1A0" rw="RW" size="4" initval="0x3F3F3F3F" caption="Mega Mux Selection">
          <bitfield name="LP_GPIO_0" mask="0x0000003F" values="LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_0" caption="LP_GPIO_0 mega mux selection"/>
          <bitfield name="LP_GPIO_1" mask="0x00003F00" values="LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_1" caption="LP_GPIO_1 mega mux selection"/>
          <bitfield name="LP_GPIO_2" mask="0x003F0000" values="LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_2" caption="LP_GPIO_2 mega mux selection"/>
          <bitfield name="LP_GPIO_3" mask="0x3F000000" values="LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_0_LP_GPIO_3" caption="LP_GPIO_3 mega mux selection"/>
        </register>
        <register name="MEGA_MUX_IO_SEL_1" offset="0x1A4" rw="RW" size="4" initval="0x3F3F3F3F" caption="Mega Mux Selection (Refer to Mega_Mux_IO Spreadsheet)">
          <bitfield name="LP_GPIO_4" mask="0x0000003F" values="LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_4" caption="LP_GPIO_4 mega mux selection"/>
          <bitfield name="LP_GPIO_5" mask="0x00003F00" values="LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_5" caption="LP_GPIO_5 mega mux selection"/>
          <bitfield name="LP_GPIO_6" mask="0x003F0000" values="LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_6" caption="LP_GPIO_6 mega mux selection"/>
          <bitfield name="LP_GPIO_7" mask="0x3F000000" values="LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_1_LP_GPIO_7" caption="LP_GPIO_7 mega mux selection"/>
        </register>
        <register name="MEGA_MUX_IO_SEL_2" offset="0x1A8" rw="RW" size="4" initval="0x3F3F3F3F" caption="Mega Mux Selection (Refer to Mega_Mux_IO Spreadsheet)">
          <bitfield name="LP_GPIO_8" mask="0x0000003F" values="LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_2_LP_GPIO_8" caption="LP_GPIO_8 mega mux selection"/>
          <bitfield name="LP_GPIO_9" mask="0x00003F00" values="LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_2_LP_GPIO_9" caption="LP_GPIO_9 mega mux selection"/>
          <bitfield name="LP_GPIO_10" mask="0x003F0000" values="LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_2_LP_GPIO_10" caption="LP_GPIO_10 mega mux selection"/>
          <bitfield name="LP_GPIO_11" mask="0x3F000000" values="LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_2_LP_GPIO_11" caption="LP_GPIO_11 mega mux selection"/>
        </register>
        <register name="MEGA_MUX_IO_SEL_3" offset="0x1AC" rw="RW" size="4" initval="0x3F3F3F3F" caption="Mega Mux Selection (Refer to Mega_Mux_IO Spreadsheet)">
          <bitfield name="LP_GPIO_12" mask="0x0000003F" values="LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_3_LP_GPIO_12" caption="LP_GPIO_12 mega mux selection"/>
          <bitfield name="LP_GPIO_13" mask="0x00003F00" values="LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_3_LP_GPIO_13" caption="LP_GPIO_13 mega mux selection"/>
          <bitfield name="LP_GPIO_14" mask="0x003F0000" values="LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_3_LP_GPIO_14" caption="LP_GPIO_14 mega mux selection"/>
          <bitfield name="LP_GPIO_15" mask="0x3F000000" values="LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_3_LP_GPIO_15" caption="LP_GPIO_15 mega mux selection"/>
        </register>
        <register name="MEGA_MUX_IO_SEL_4" offset="0x1B0" rw="RW" size="4" initval="0x3F3F3F3F" caption="Mega Mux Selection (Refer to Mega_Mux_IO Spreadsheet)">
          <bitfield name="LP_GPIO_16" mask="0x0000003F" values="LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_4_LP_GPIO_16" caption="LP_GPIO_16 mega mux selection"/>
          <bitfield name="LP_GPIO_17" mask="0x00003F00" values="LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_4_LP_GPIO_17" caption="LP_GPIO_17 mega mux selection"/>
          <bitfield name="LP_GPIO_18" mask="0x003F0000" values="LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_4_LP_GPIO_18" caption="LP_GPIO_18 mega mux selection"/>
          <bitfield name="LP_GPIO_19" mask="0x3F000000" values="LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_4_LP_GPIO_19" caption="LP_GPIO_19 mega mux selection"/>
        </register>
