Duet3D/Duet3Expansion/src/atmel/SAMB11_DFP/2.3.190/atdf/ATSAMB11G18A.atdf
        <register name="MEGA_MUX_IO_SEL_5" offset="0x1B4" rw="RW" size="4" initval="0x3F3F3F3F" caption="Mega Mux Selection (Refer to Mega_Mux_IO Spreadsheet)">
          <bitfield name="LP_GPIO_20" mask="0x0000003F" values="LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_5_LP_GPIO_20" caption="LP_GPIO_20 mega mux selection"/>
          <bitfield name="LP_GPIO_21" mask="0x00003F00" values="LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_5_LP_GPIO_21" caption="LP_GPIO_21 mega mux selection"/>
          <bitfield name="LP_GPIO_22" mask="0x003F0000" values="LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_5_LP_GPIO_22" caption="LP_GPIO_22 mega mux selection"/>
          <bitfield name="LP_GPIO_23" mask="0x3F000000" values="LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_5_LP_GPIO_23" caption="LP_GPIO_23 mega mux selection"/>
        </register>
        <register name="SENS_ADC_CLK_CTRL" offset="0x1C0" rw="RW" size="4" initval="0x001A00" caption="Clock control for the Sensor ADC">
          <bitfield name="FRAC_PART" mask="0x0000FF" caption="Fractional part for the clock divider"/>
          <bitfield name="INT_PART" mask="0x0FFF00" caption="Integer part for the clock divider"/>
          <bitfield name="INVERT" mask="0x100000" caption="Invert Sens ADC Clock"/>
        </register>
        <register name="SENS_ADC_RAW_STATUS" offset="0x1C4" rw="R" size="4" initval="0x00000" caption="Raw Status from the Sensor ADC">
          <bitfield name="ADC_OUT" mask="0x007FF" caption="Raw Status of the sens_adc_out port of the PMU"/>
          <bitfield name="ADC_CH" mask="0x03000" caption="Raw Status of the sens_adc_ch port of the PMU"/>
          <bitfield name="ADC_DONE" mask="0x10000" caption="Raw Status of the sens_adc_done port of the PMU"/>
        </register>
        <register name="SENS_ADC_CH0_DATA" offset="0x1C8" rw="R" size="2" initval="0x000" caption="Current data of the Sensor ADC for Channel 0">
          <bitfield name="SENS_ADC_CH0_DATA" mask="0x7FF"/>
        </register>
        <register name="SENS_ADC_CH1_DATA" offset="0x1CC" rw="R" size="2" initval="0x000" caption="Current data of the Sensor ADC for Channel 1">
          <bitfield name="SENS_ADC_CH1_DATA" mask="0x7FF"/>
        </register>
        <register name="SENS_ADC_CH2_DATA" offset="0x1D0" rw="R" size="2" initval="0x000" caption="Current data of the Sensor ADC for Channel 2">
          <bitfield name="SENS_ADC_CH2_DATA" mask="0x7FF"/>
        </register>
        <register name="SENS_ADC_CH3_DATA" offset="0x1D4" rw="R" size="2" initval="0x000" caption="Current data of the Sensor ADC for Channel 3">
          <bitfield name="SENS_ADC_CH3_DATA" mask="0x7FF"/>
        </register>
        <register name="IRQ_CTRL" offset="0x1E8" rw="RW" size="2" initval="0x000" caption="Configure the IRQ inputs to the system as either Rising Edge or Level Shift">
          <bitfield name="BLE_LVL_OSC_EN_IRQ_EN" mask="0x001" caption="Enable the OSC_en signal for Level Shift and Clear Mode"/>
          <bitfield name="BLE_LVL_OSC_EN_IRQ_CLR" mask="0x002" caption="if ble_lvl_osc_en_irq_en is enabled, setting irq clr to 1 will clear the irq request"/>
          <bitfield name="BLE_LVL_WAKEUP_LP_IRQ_EN" mask="0x004" caption="Enable the wakeup_lp signal for Level Shift and Clear Mode"/>
          <bitfield name="BLE_LVL_WAKEUP_LP_IRQ_CLR" mask="0x008" caption="if ble_lvl_wakeup_lp_irq_en is enabled, setting irq clr to 1 will clear the irq request"/>
          <bitfield name="BLE_LVL_BLE_LP_OUT_OF_RESET_IRQ_EN" mask="0x010" caption="Enable the lp_out_of_reset signal for Level Shift and Clear Mode"/>
          <bitfield name="BLE_LVL_BLE_LP_OUT_OF_RESET_IRQ_CLR" mask="0x020" caption="if lp_out_of_reset is enabled, setting irq clr to 1 will clear the irq request"/>
          <bitfield name="BLE_LVL_BLE_CORE_OUT_OF_RESET_IRQ_EN" mask="0x040" caption="Enable the core_out_of_reset signal for Level Shift and Clear Mode"/>
          <bitfield name="BLE_LVL_BLE_CORE_OUT_OF_RESET_IRQ_CLR" mask="0x080" caption="if core_out_of_reset is enabled, setting irq clr to 1 will clear the irq request"/>
          <bitfield name="RXTX_LVL_RXTX_SEQ_IN_SLEEP_IRQ_EN" mask="0x100" caption="Enable the rxtx_seq_in_sleep signal for Level Shift and Clear Mode"/>
          <bitfield name="RXTX_LVL_RXTX_SEQ_IN_SLEEP_IRQ_CLR" mask="0x200" caption="if rxtx_seq_in_sleep is enabled, setting irq clr to 1 will clear the irq request"/>
        </register>
        <register name="IRQ_STS" offset="0x1EC" rw="R" size="1" initval="0x00" caption="Read the raw (no level or rise detect) IRQ inputs to the system from the designated cores">
          <bitfield name="BLE_OSC_EN_IRQ" mask="0x01" caption="Read the OSC_en signal from the lp core"/>
          <bitfield name="BLE_WAKEUP_LP_IRQ" mask="0x02" caption="Read the wakeup_lp_irq signal from the lp core"/>
          <bitfield name="BLE_LP_OUT_OF_RESET_IRQ" mask="0x04" caption="Read the ble_lp_out_of_reset signal from the ble lp core"/>
          <bitfield name="BLE_CORE_OUT_OF_RESET_IRQ_EN" mask="0x08" caption="Read the ble_core_out_of_reset_irq signal from the ble core"/>
          <bitfield name="EFUSE_OUT_OF_RESET" mask="0x10" caption="Read the efuse_out_of_reset signal from the efuse wrapper"/>
        </register>
        <register name="MSEMI_MEM_CTRL" offset="0x200" rw="RW" size="4" initval="0x0000000" caption="Control the rwm, rm and wm on the Mobile Semi Memories">
          <bitfield name="PD2A_MEM_RWM_EN" mask="0x0000001" caption="RWM control for pd2a memory"/>
          <bitfield name="PD2A_MEM_WM_EN" mask="0x0000002" caption="WM control for pd2a memory"/>
          <bitfield name="PD2A_MEM_RM_EN" mask="0x0000004" caption="RM control for pd2a memory"/>
          <bitfield name="PD2B_MEM_RWM_EN" mask="0x0000010" caption="RWM control for pd2b memory"/>
          <bitfield name="PD2B_MEM_WM_EN" mask="0x0000020" caption="WM control for pd2b memory"/>
          <bitfield name="PD2B_MEM_RM_EN" mask="0x0000040" caption="RM control for pd2b memory"/>
          <bitfield name="PD3A_MEM_RWM_EN" mask="0x0000100" caption="RWM control for pd3a memory"/>
          <bitfield name="PD3A_MEM_WM_EN" mask="0x0000200" caption="WM control for pd3a memory"/>
          <bitfield name="PD3A_MEM_RM_EN" mask="0x0000400" caption="RM control for pd3a memory"/>
          <bitfield name="PD3B_MEM_RWM_EN" mask="0x0001000" caption="RWM control for pd3b memory"/>
          <bitfield name="PD3B_MEM_WM_EN" mask="0x0002000" caption="WM control for pd3b memory"/>
          <bitfield name="PD3B_MEM_RM_EN" mask="0x0004000" caption="RM control for pd3b memory"/>
          <bitfield name="PD3C_MEM_RWM_EN" mask="0x0010000" caption="RWM control for pd3c memory"/>
          <bitfield name="PD3C_MEM_WM_EN" mask="0x0020000" caption="WM control for pd3c memory"/>
          <bitfield name="PD3C_MEM_RM_EN" mask="0x0040000" caption="RM control for pd3c memory"/>
          <bitfield name="PD5_MEM_RWM_EN" mask="0x0100000" caption="RWM control for pd5 memory"/>
          <bitfield name="PD5_MEM_WM_EN" mask="0x0200000" caption="WM control for pd5 memory"/>
          <bitfield name="PD5_MEM_RM_EN" mask="0x0400000" caption="RM control for pd5 memory"/>
          <bitfield name="PD8_MEM_RWM_EN" mask="0x1000000" caption="RWM control for pd8 memory"/>
          <bitfield name="PD8_MEM_WM_EN" mask="0x2000000" caption="WM control for pd8 memory"/>
          <bitfield name="PD8_MEM_RM_EN" mask="0x4000000" caption="RM control for pd8 memory"/>
        </register>
