Duet3D/Duet3Expansion/src/atmel/SAMB11_DFP/2.3.190/atdf/ATSAMB11G18A.atdf
        <register name="QUAD_DEC1_CTRL" offset="0x2A4" rw="RW" size="1" initval="0x0" caption="Control for QUAD_DEC1">
          <bitfield name="ENABLE" mask="0x1" caption="Enable Quad Decoder"/>
          <bitfield name="CLR_IRQ" mask="0x2" caption="Clear IRQ From Quad Decoder"/>
          <bitfield name="CLOCK_SEL" mask="0xC" values="LPMCU_MISC_REGS_QUAD_DEC1_CTRL_CLOCK_SEL" caption="Quad Decoder Source Clock Frequency Select"/>
        </register>
        <register name="QUAD_DEC2_THRESHOLD" offset="0x2B0" rw="RW" size="4" initval="0x00FFFF00" caption="Thresholds for QUAD_DEC2">
          <bitfield name="UPPER" mask="0x0000FFFF" caption="Upper Threshold of counter for QUAD_DEC2"/>
          <bitfield name="LOWER" mask="0xFFFF0000" caption="Lower Threshold of counter for QUAD_DEC2"/>
        </register>
        <register name="QUAD_DEC2_CTRL" offset="0x2B4" rw="RW" size="1" initval="0x0" caption="Control for QUAD_DEC2">
          <bitfield name="ENABLE" mask="0x1" caption="Enable Quad Decoder"/>
          <bitfield name="CLR_IRQ" mask="0x2" caption="Clear IRQ From Quad Decoder"/>
          <bitfield name="CLOCK_SEL" mask="0xC" values="LPMCU_MISC_REGS_QUAD_DEC2_CTRL_CLOCK_SEL" caption="Quad Decoder Source Clock Frequency Select"/>
        </register>
        <register name="FP_COMP0_COMP" offset="0x2C0" rw="RW" size="4" initval="0x00000" caption="Flash Breakpoint Compare Register 0">
          <bitfield name="FP_COMP0_COMP" mask="0x1FFFF"/>
        </register>
        <register name="FP_COMP1_COMP" offset="0x2C4" rw="RW" size="4" initval="0x00000" caption="Flash Breakpoint Compare Register 1">
          <bitfield name="FP_COMP1_COMP" mask="0x1FFFF"/>
        </register>
        <register name="FP_COMP2_COMP" offset="0x2C8" rw="RW" size="4" initval="0x00000" caption="Flash Breakpoint Compare Register 2">
          <bitfield name="FP_COMP2_COMP" mask="0x1FFFF"/>
        </register>
        <register name="FP_COMP3_COMP" offset="0x2CC" rw="RW" size="4" initval="0x00000" caption="Flash Breakpoint Compare Register 3">
          <bitfield name="FP_COMP3_COMP" mask="0x1FFFF"/>
        </register>
        <register name="FP_COMP4_COMP" offset="0x2D0" rw="RW" size="4" initval="0x00000" caption="Flash Breakpoint Compare Register 4">
          <bitfield name="FP_COMP4_COMP" mask="0x1FFFF"/>
        </register>
        <register name="FP_COMP5_COMP" offset="0x2D4" rw="RW" size="4" initval="0x00000" caption="Flash Breakpoint Compare Register 5">
          <bitfield name="FP_COMP5_COMP" mask="0x1FFFF"/>
        </register>
        <register name="FP_COMP6_COMP" offset="0x2D8" rw="RW" size="4" initval="0x00000" caption="Flash Breakpoint Compare Register 6">
          <bitfield name="FP_COMP6_COMP" mask="0x1FFFF"/>
        </register>
        <register name="FP_COMP7_COMP" offset="0x2DC" rw="RW" size="4" initval="0x00000" caption="Flash Breakpoint Compare Register 7">
          <bitfield name="FP_COMP7_COMP" mask="0x1FFFF"/>
        </register>
        <register name="FP_COMP8_COMP" offset="0x2E0" rw="RW" size="4" initval="0x00000" caption="Flash Breakpoint Compare Register 8">
          <bitfield name="FP_COMP8_COMP" mask="0x1FFFF"/>
        </register>
        <register name="FP_COMP9_COMP" offset="0x2E4" rw="RW" size="4" initval="0x00000" caption="Flash Breakpoint Compare Register 9">
          <bitfield name="FP_COMP9_COMP" mask="0x1FFFF"/>
        </register>
        <register name="FP_COMP10_COMP" offset="0x2E8" rw="RW" size="4" initval="0x00000" caption="Flash Breakpoint Compare Register 10">
          <bitfield name="FP_COMP10_COMP" mask="0x1FFFF"/>
        </register>
        <register name="FP_COMP11_COMP" offset="0x2EC" rw="RW" size="4" initval="0x00000" caption="Flash Breakpoint Compare Register 11">
          <bitfield name="FP_COMP11_COMP" mask="0x1FFFF"/>
        </register>
        <register name="FP_COMP12_COMP" offset="0x2F0" rw="RW" size="4" initval="0x00000" caption="Flash Breakpoint Compare Register 12">
          <bitfield name="FP_COMP12_COMP" mask="0x1FFFF"/>
        </register>
        <register name="FP_COMP13_COMP" offset="0x2F4" rw="RW" size="4" initval="0x00000" caption="Flash Breakpoint Compare Register 13">
          <bitfield name="FP_COMP13_COMP" mask="0x1FFFF"/>
        </register>
        <register name="FP_COMP14_COMP" offset="0x2F8" rw="RW" size="4" initval="0x00000" caption="Flash Breakpoint Compare Register 14">
          <bitfield name="FP_COMP14_COMP" mask="0x1FFFF"/>
        </register>
        <register name="FP_COMP15_COMP" offset="0x2FC" rw="RW" size="4" initval="0x00000" caption="Flash Breakpoint Compare Register 15">
          <bitfield name="FP_COMP15_COMP" mask="0x1FFFF"/>
        </register>
        <register name="FP_COMP0_REPLACE" offset="0x300" rw="RW" size="4" initval="0x00000" caption="Flash Breakpoint Replace Register 0">
          <bitfield name="FP_COMP0_REPLACE" mask="0x7FFFF"/>
        </register>
        <register name="FP_COMP1_REPLACE" offset="0x304" rw="RW" size="4" initval="0x00000" caption="Flash Breakpoint Replace Register 1">
          <bitfield name="FP_COMP1_REPLACE" mask="0x7FFFF"/>
        </register>
        <register name="FP_COMP2_REPLACE" offset="0x308" rw="RW" size="4" initval="0x00000" caption="Flash Breakpoint Replace Register 2">
          <bitfield name="FP_COMP2_REPLACE" mask="0x7FFFF"/>
        </register>
        <register name="FP_COMP3_REPLACE" offset="0x30C" rw="RW" size="4" initval="0x00000" caption="Flash Breakpoint Replace Register 3">
          <bitfield name="FP_COMP3_REPLACE" mask="0x7FFFF"/>
        </register>
        <register name="FP_COMP4_REPLACE" offset="0x310" rw="RW" size="4" initval="0x00000" caption="Flash Breakpoint Replace Register 4">
          <bitfield name="FP_COMP4_REPLACE" mask="0x7FFFF"/>
        </register>
        <register name="FP_COMP5_REPLACE" offset="0x314" rw="RW" size="4" initval="0x00000" caption="Flash Breakpoint Replace Register 5">
          <bitfield name="FP_COMP5_REPLACE" mask="0x7FFFF"/>
        </register>
        <register name="FP_COMP6_REPLACE" offset="0x318" rw="RW" size="4" initval="0x00000" caption="Flash Breakpoint Replace Register 6">
          <bitfield name="FP_COMP6_REPLACE" mask="0x7FFFF"/>
        </register>
        <register name="FP_COMP7_REPLACE" offset="0x31C" rw="RW" size="4" initval="0x00000" caption="Flash Breakpoint Replace Register 7">
          <bitfield name="FP_COMP7_REPLACE" mask="0x7FFFF"/>
        </register>
        <register name="FP_COMP8_REPLACE" offset="0x320" rw="RW" size="4" initval="0x00000" caption="Flash Breakpoint Replace Register 8">
          <bitfield name="FP_COMP8_REPLACE" mask="0x7FFFF"/>
        </register>
        <register name="FP_COMP9_REPLACE" offset="0x324" rw="RW" size="4" initval="0x00000" caption="Flash Breakpoint Replace Register 9">
          <bitfield name="FP_COMP9_REPLACE" mask="0x7FFFF"/>
        </register>
        <register name="FP_COMP10_REPLACE" offset="0x328" rw="RW" size="4" initval="0x00000" caption="Flash Breakpoint Replace Register 10">
          <bitfield name="FP_COMP10_REPLACE" mask="0x7FFFF"/>
        </register>
        <register name="FP_COMP11_REPLACE" offset="0x32C" rw="RW" size="4" initval="0x00000" caption="Flash Breakpoint Replace Register 11">
          <bitfield name="FP_COMP11_REPLACE" mask="0x7FFFF"/>
        </register>
        <register name="FP_COMP12_REPLACE" offset="0x330" rw="RW" size="4" initval="0x00000" caption="Flash Breakpoint Replace Register 12">
          <bitfield name="FP_COMP12_REPLACE" mask="0x7FFFF"/>
        </register>
        <register name="FP_COMP13_REPLACE" offset="0x334" rw="RW" size="4" initval="0x00000" caption="Flash Breakpoint Replace Register 13">
          <bitfield name="FP_COMP13_REPLACE" mask="0x7FFFF"/>
        </register>
        <register name="FP_COMP14_REPLACE" offset="0x338" rw="RW" size="4" initval="0x00000" caption="Flash Breakpoint Replace Register 14">
          <bitfield name="FP_COMP14_REPLACE" mask="0x7FFFF"/>
        </register>
        <register name="FP_COMP15_REPLACE" offset="0x33C" rw="RW" size="4" initval="0x00000" caption="Flash Breakpoint Replace Register 14">
          <bitfield name="FP_COMP15_REPLACE" mask="0x7FFFF"/>
        </register>
        <register name="FP_COMP_ENABLE" offset="0x340" rw="RW" size="2" initval="0x0000" caption="Flash Breakpoint Enable Register">
          <bitfield name="CMP_0_EN" mask="0x0001" caption="Enable Compare 0"/>
          <bitfield name="CMP_1_EN" mask="0x0002" caption="Enable Compare 1"/>
          <bitfield name="CMP_2_EN" mask="0x0004" caption="Enable Compare 2"/>
          <bitfield name="CMP_3_EN" mask="0x0008" caption="Enable Compare 3"/>
          <bitfield name="CMP_4_EN" mask="0x0010" caption="Enable Compare 4"/>
          <bitfield name="CMP_5_EN" mask="0x0020" caption="Enable Compare 5"/>
          <bitfield name="CMP_6_EN" mask="0x0040" caption="Enable Compare 6"/>
          <bitfield name="CMP_7_EN" mask="0x0080" caption="Enable Compare 7"/>
          <bitfield name="CMP_8_EN" mask="0x0100" caption="Enable Compare 8"/>
          <bitfield name="CMP_9_EN" mask="0x0200" caption="Enable Compare 9"/>
          <bitfield name="CMP_10_EN" mask="0x0400" caption="Enable Compare 10"/>
          <bitfield name="CMP_11_EN" mask="0x0800" caption="Enable Compare 11"/>
          <bitfield name="CMP_12_EN" mask="0x1000" caption="Enable Compare 12"/>
          <bitfield name="CMP_13_EN" mask="0x2000" caption="Enable Compare 13"/>
          <bitfield name="CMP_14_EN" mask="0x4000" caption="Enable Compare 14"/>
          <bitfield name="CMP_15_EN" mask="0x8000" caption="Enable Compare 15"/>
        </register>
        <register name="PMU_READ_REGS" offset="0x410" rw="R" size="4" initval="0x000000" caption="PMU Status Registers">
          <bitfield name="READREG1" mask="0x0000FF" caption="PMU Read Register 1"/>
          <bitfield name="READREG2" mask="0x00FF00" caption="PMU Read Register 2"/>
          <bitfield name="READREG3" mask="0xFF0000" caption="PMU Read Register 3"/>
        </register>
        <register name="MS_GPIO" offset="0x414" rw="RW" size="1" initval="0xF0" caption="Control for Mixed Signal GPIOs">
          <bitfield name="PULL_TYPE_44" mask="0x01" caption="Mixed Signal LP_GPIO_44 Pull Type Select. 1: PD, 0: PU."/>
          <bitfield name="PULL_TYPE_45" mask="0x02" caption="Mixed Signal LP_GPIO_45 Pull Type Select. 1: PD, 0: PU."/>
          <bitfield name="PULL_TYPE_46" mask="0x04" caption="Mixed Signal LP_GPIO_46 Pull Type Select. 1: PD, 0: PU."/>
          <bitfield name="PULL_TYPE_47" mask="0x08" caption="Mixed Signal LP_GPIO_47 Pull Type Select. 1: PD, 0: PU."/>
          <bitfield name="PULL_ENABLE_44" mask="0x10" caption="Active Low Pull Enable for Mixed Signal LP_GPIO_44"/>
          <bitfield name="PULL_ENABLE_45" mask="0x20" caption="Active Low Pull Enable for Mixed Signal LP_GPIO_45"/>
          <bitfield name="PULL_ENABLE_46" mask="0x40" caption="Active Low Pull Enable for Mixed Signal LP_GPIO_46"/>
          <bitfield name="PULL_ENABLE_47" mask="0x80" caption="Active Low Pull Enable for Mixed Signal LP_GPIO_47"/>
        </register>
        <register name="AON_SLEEP_TIMER_COUNTER" offset="0x420" rw="R" size="4" initval="0x00000000" caption="Current value of the AON Sleep Timer (syncd to ARM clock)">
          <bitfield name="AON_SLEEP_TIMER_COUNTER" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <value-group name="LPMCU_MISC_REGS_LPMCU_CTRL_LPMCU_CLK_SEL">
        <value name="0" caption="26MHz" value="0x0"/>
        <value name="1" caption="13MHz" value="0x1"/>
        <value name="2" caption="6.5MHz" value="0x2"/>
        <value name="3" caption="3.25MHz" value="0x3"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_LPMCU_CTRL_DUALTIMER0_CLK_SEL">
        <value name="0" caption="26MHz" value="0x0"/>
        <value name="1" caption="13MHz" value="0x1"/>
        <value name="2" caption="6.5MHz" value="0x2"/>
        <value name="3" caption="3.25MHz" value="0x3"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_LPMCU_CTRL_SPI_FLASH0_CLKSEL">
        <value name="0" caption="3.25MHz" value="0x0"/>
        <value name="1" caption="6.5MHz" value="0x1"/>
        <value name="2" caption="13MHz" value="0x2"/>
        <value name="3" caption="26MHz" value="0x3"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_0_SEL">
        <value name="GPIO" caption="MUX function 0" value="0x0"/>
        <value name="MEGAMUX" caption="MUX function 1" value="0x1"/>
        <value name="SWD_CLK" caption="MUX function 2" value="0x2"/>
        <value name="TEST_OUT_0" caption="MUX function 7" value="0x7"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_1_SEL">
        <value name="GPIO" caption="MUX function 0" value="0x0"/>
        <value name="MEGAMUX" caption="MUX function 1" value="0x1"/>
        <value name="SWD_IO" caption="MUX function 2" value="0x2"/>
        <value name="TEST_OUT_1" caption="MUX function 7" value="0x7"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_2_SEL">
        <value name="GPIO" caption="MUX function 0" value="0x0"/>
        <value name="MEGAMUX" caption="MUX function 1" value="0x1"/>
        <value name="UART0_RXD" caption="MUX function 2" value="0x2"/>
        <value name="SPI1_SCK" caption="MUX function 4" value="0x4"/>
        <value name="SPI0_SCK" caption="MUX function 5" value="0x5"/>
        <value name="SPI_FLASH0_SCK" caption="MUX function 6" value="0x6"/>
        <value name="TEST_OUT_2" caption="MUX function 7" value="0x7"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_3_SEL">
        <value name="GPIO" caption="MUX function 0" value="0x0"/>
        <value name="MEGAMUX" caption="MUX function 1" value="0x1"/>
        <value name="UART0_TXD" caption="MUX function 2" value="0x2"/>
        <value name="SPI1_MOSI" caption="MUX function 4" value="0x4"/>
        <value name="SPI0_MOSI" caption="MUX function 5" value="0x5"/>
        <value name="SPI_FLASH0_TXD" caption="MUX function 6" value="0x6"/>
        <value name="TEST_OUT_3" caption="MUX function 7" value="0x7"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_4_SEL">
        <value name="GPIO" caption="MUX function 0" value="0x0"/>
        <value name="MEGAMUX" caption="MUX function 1" value="0x1"/>
        <value name="UART0_CTS" caption="MUX function 2" value="0x2"/>
        <value name="SPI1_SSN" caption="MUX function 4" value="0x4"/>
        <value name="SPI0_SSN" caption="MUX function 5" value="0x5"/>
        <value name="SPI_FLASH0_SSN" caption="MUX function 6" value="0x6"/>
        <value name="TEST_OUT_4" caption="MUX function 7" value="0x7"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_5_SEL">
        <value name="GPIO" caption="MUX function 0" value="0x0"/>
        <value name="MEGAMUX" caption="MUX function 1" value="0x1"/>
        <value name="UART0_RTS" caption="MUX function 2" value="0x2"/>
        <value name="SPI1_MISO" caption="MUX function 4" value="0x4"/>
        <value name="SPI0_MISO" caption="MUX function 5" value="0x5"/>
        <value name="SPI_FLASH0_RXD" caption="MUX function 6" value="0x6"/>
        <value name="TEST_OUT_5" caption="MUX function 7" value="0x7"/>
      </value-group>
