Duet3D/Duet3Expansion/src/atmel/SAMB11_DFP/2.3.190/atdf/ATSAMB11G18A.atdf
      <value-group name="LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_6_SEL">
        <value name="GPIO" caption="MUX function 0" value="0x0"/>
        <value name="MEGAMUX" caption="MUX function 1" value="0x1"/>
        <value name="UART1_RXD" caption="MUX function 2" value="0x2"/>
        <value name="SPI0_SCK" caption="MUX function 5" value="0x5"/>
        <value name="SPI_FLASH0_SCK" caption="MUX function 6" value="0x6"/>
        <value name="TEST_OUT_6" caption="MUX function 7" value="0x7"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_PINMUX_SEL_0_LP_GPIO_7_SEL">
        <value name="GPIO" caption="MUX function 0" value="0x0"/>
        <value name="MEGAMUX" caption="MUX function 1" value="0x1"/>
        <value name="UART1_TXD" caption="MUX function 2" value="0x2"/>
        <value name="SPI0_MOSI" caption="MUX function 5" value="0x5"/>
        <value name="SPI_FLASH0_TXD" caption="MUX function 6" value="0x6"/>
        <value name="TEST_OUT_7" caption="MUX function 7" value="0x7"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_8_SEL">
        <value name="GPIO" caption="MUX function 0" value="0x0"/>
        <value name="MEGAMUX" caption="MUX function 1" value="0x1"/>
        <value name="I2C0_SDA" caption="MUX function 2" value="0x2"/>
        <value name="SPI0_SSN" caption="MUX function 5" value="0x5"/>
        <value name="SPI_FLASH0_SSN" caption="MUX function 6" value="0x6"/>
        <value name="TEST_OUT_8" caption="MUX function 7" value="0x7"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_9_SEL">
        <value name="GPIO" caption="MUX function 0" value="0x0"/>
        <value name="MEGAMUX" caption="MUX function 1" value="0x1"/>
        <value name="I2C0_SCL" caption="MUX function 2" value="0x2"/>
        <value name="SPI0_MISO" caption="MUX function 5" value="0x5"/>
        <value name="SPI_FLASH0_RXD" caption="MUX function 6" value="0x6"/>
        <value name="TEST_OUT_9" caption="MUX function 7" value="0x7"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_10_SEL">
        <value name="GPIO" caption="MUX function 0" value="0x0"/>
        <value name="MEGAMUX" caption="MUX function 1" value="0x1"/>
        <value name="SPI0_SCK" caption="MUX function 2" value="0x2"/>
        <value name="SPI_FLASH0_SCK" caption="MUX function 6" value="0x6"/>
        <value name="TEST_OUT_10" caption="MUX function 7" value="0x7"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_11_SEL">
        <value name="GPIO" caption="MUX function 0" value="0x0"/>
        <value name="MEGAMUX" caption="MUX function 1" value="0x1"/>
        <value name="SPI0_MOSI" caption="MUX function 2" value="0x2"/>
        <value name="SPI_FLASH0_TXD" caption="MUX function 6" value="0x6"/>
        <value name="TEST_OUT_11" caption="MUX function 7" value="0x7"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_12_SEL">
        <value name="GPIO" caption="MUX function 0" value="0x0"/>
        <value name="MEGAMUX" caption="MUX function 1" value="0x1"/>
        <value name="SPI0_SSN" caption="MUX function 2" value="0x2"/>
        <value name="SPI_FLASH0_SSN" caption="MUX function 6" value="0x6"/>
        <value name="TEST_OUT_12" caption="MUX function 7" value="0x7"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_13_SEL">
        <value name="GPIO" caption="MUX function 0" value="0x0"/>
        <value name="MEGAMUX" caption="MUX function 1" value="0x1"/>
        <value name="SPI0_MISO" caption="MUX function 2" value="0x2"/>
        <value name="SPI_FLASH0_RXD" caption="MUX function 6" value="0x6"/>
        <value name="TEST_OUT_13" caption="MUX function 7" value="0x7"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_14_SEL">
        <value name="GPIO" caption="MUX function 0" value="0x0"/>
        <value name="MEGAMUX" caption="MUX function 1" value="0x1"/>
        <value name="UART1_CTS" caption="MUX function 2" value="0x2"/>
        <value name="I2C1_SDA" caption="MUX function 4" value="0x4"/>
        <value name="TEST_OUT_14" caption="MUX function 7" value="0x7"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_PINMUX_SEL_1_LP_GPIO_15_SEL">
        <value name="GPIO" caption="MUX function 0" value="0x0"/>
        <value name="MEGAMUX" caption="MUX function 1" value="0x1"/>
        <value name="UART1_RTS" caption="MUX function 2" value="0x2"/>
        <value name="I2C1_SCL" caption="MUX function 4" value="0x4"/>
        <value name="TEST_OUT_15" caption="MUX function 7" value="0x7"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_16_SEL">
        <value name="GPIO" caption="MUX function 0" value="0x0"/>
        <value name="MEGAMUX" caption="MUX function 1" value="0x1"/>
        <value name="SPI_FLASH0_SCK" caption="MUX function 2" value="0x2"/>
        <value name="SPI1_SSN" caption="MUX function 4" value="0x4"/>
        <value name="SPI0_SCK" caption="MUX function 5" value="0x5"/>
        <value name="SPI_FLASH0_SSN" caption="MUX function 6" value="0x6"/>
        <value name="TEST_OUT_16" caption="MUX function 7" value="0x7"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_17_SEL">
        <value name="GPIO" caption="MUX function 0" value="0x0"/>
        <value name="MEGAMUX" caption="MUX function 1" value="0x1"/>
        <value name="SPI_FLASH0_TXD" caption="MUX function 2" value="0x2"/>
        <value name="SPI1_SCK" caption="MUX function 4" value="0x4"/>
        <value name="SPI0_MOSI" caption="MUX function 5" value="0x5"/>
        <value name="TEST_OUT_17" caption="MUX function 7" value="0x7"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_18_SEL">
        <value name="GPIO" caption="MUX function 0" value="0x0"/>
        <value name="MEGAMUX" caption="MUX function 1" value="0x1"/>
        <value name="SPI_FLASH0_SSN" caption="MUX function 2" value="0x2"/>
        <value name="SPI1_MISO" caption="MUX function 4" value="0x4"/>
        <value name="SPI0_SSN" caption="MUX function 5" value="0x5"/>
        <value name="SPI_FLASH0_RXD" caption="MUX function 6" value="0x6"/>
        <value name="TEST_OUT_18" caption="MUX function 7" value="0x7"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_19_SEL">
        <value name="GPIO" caption="MUX function 0" value="0x0"/>
        <value name="MEGAMUX" caption="MUX function 1" value="0x1"/>
        <value name="SPI_FLASH0_RXD" caption="MUX function 2" value="0x2"/>
        <value name="SPI1_MOSI" caption="MUX function 4" value="0x4"/>
        <value name="SPI0_MISO" caption="MUX function 5" value="0x5"/>
        <value name="TEST_OUT_19" caption="MUX function 7" value="0x7"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_20_SEL">
        <value name="GPIO" caption="MUX function 0" value="0x0"/>
        <value name="MEGAMUX" caption="MUX function 1" value="0x1"/>
        <value name="TEST_OUT_20" caption="MUX function 7" value="0x7"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_PINMUX_SEL_2_LP_GPIO_21_SEL">
        <value name="GPIO" caption="MUX function 0" value="0x0"/>
        <value name="MEGAMUX" caption="MUX function 1" value="0x1"/>
      </value-group>
