Duet3D/Duet3Expansion/src/atmel/SAMB11_DFP/2.3.190/atdf/ATSAMB11G18A.atdf
      <value-group name="LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_4_LP_GPIO_18">
        <value name="UART0_RXD" caption="UART0_RXD" value="0x0"/>
        <value name="UART0_TXD" caption="UART0_TXD" value="0x1"/>
        <value name="UART0_CTS" caption="UART0_CTS" value="0x2"/>
        <value name="UART0_RTS" caption="UART0_RTS" value="0x3"/>
        <value name="UART1_RXD" caption="UART1_RXD" value="0x4"/>
        <value name="UART1_TXD" caption="UART1_TXD" value="0x5"/>
        <value name="UART1_CTS" caption="UART1_CTS" value="0x6"/>
        <value name="UART1_RTS" caption="UART1_RTS" value="0x7"/>
        <value name="I2C0_SDA" caption="I2C0_SDA" value="0x8"/>
        <value name="I2C0_SCL" caption="I2C0_SCL" value="0x9"/>
        <value name="I2C1_SDA" caption="I2C1_SDA" value="0xa"/>
        <value name="I2C1_SCL" caption="I2C1_SCL" value="0xb"/>
        <value name="PWM0_OUT" caption="PWM0_OUT" value="0xc"/>
        <value name="PWM1_OUT" caption="PWM1_OUT" value="0xd"/>
        <value name="PWM2_OUT" caption="PWM2_OUT" value="0xe"/>
        <value name="PWM3_OUT" caption="PWM3_OUT" value="0xf"/>
        <value name="32KHZ_CLK" caption="32KHZ_CLK" value="0x10"/>
        <value name="COEX_WLAN_TX" caption="COEX_WLAN_TX" value="0x11"/>
        <value name="COEX_WLAN_RX" caption="COEX_WLAN_RX" value="0x12"/>
        <value name="COEX_BLE_TX" caption="COEX_BLE_TX" value="0x13"/>
        <value name="COEX_BLE_RX" caption="COEX_BLE_RX" value="0x14"/>
        <value name="COEX_BLE_IN_PROCESS" caption="COEX_BLE_IN_PROCESS" value="0x15"/>
        <value name="COEX_BLE_MBSY" caption="COEX_BLE_MBSY" value="0x16"/>
        <value name="COEX_BLE_SYNC" caption="COEX_BLE_SYNC" value="0x17"/>
        <value name="COEX_BLE_RXNTX" caption="COEX_BLE_RXNTX" value="0x18"/>
        <value name="COEX_BLE_PTI_0" caption="COEX_BLE_PTI_0" value="0x19"/>
        <value name="COEX_BLE_PTI_1" caption="COEX_BLE_PTI_1" value="0x1a"/>
        <value name="COEX_BLE_PTI_2" caption="COEX_BLE_PTI_2" value="0x1b"/>
        <value name="COEX_BLE_PTI_3" caption="COEX_BLE_PTI_3" value="0x1c"/>
        <value name="QUAD_DEC0_A" caption="QUAD_DEC0_A" value="0x1d"/>
        <value name="QUAD_DEC0_B" caption="QUAD_DEC0_B" value="0x1e"/>
        <value name="QUAD_DEC1_A" caption="QUAD_DEC1_A" value="0x1f"/>
        <value name="QUAD_DEC1_B" caption="QUAD_DEC1_B" value="0x20"/>
        <value name="QUAD_DEC2_A" caption="QUAD_DEC2_A" value="0x21"/>
        <value name="QUAD_DEC2_B" caption="QUAD_DEC2_B" value="0x22"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_4_LP_GPIO_19">
        <value name="UART0_RXD" caption="UART0_RXD" value="0x0"/>
        <value name="UART0_TXD" caption="UART0_TXD" value="0x1"/>
        <value name="UART0_CTS" caption="UART0_CTS" value="0x2"/>
        <value name="UART0_RTS" caption="UART0_RTS" value="0x3"/>
        <value name="UART1_RXD" caption="UART1_RXD" value="0x4"/>
        <value name="UART1_TXD" caption="UART1_TXD" value="0x5"/>
        <value name="UART1_CTS" caption="UART1_CTS" value="0x6"/>
        <value name="UART1_RTS" caption="UART1_RTS" value="0x7"/>
        <value name="I2C0_SDA" caption="I2C0_SDA" value="0x8"/>
        <value name="I2C0_SCL" caption="I2C0_SCL" value="0x9"/>
        <value name="I2C1_SDA" caption="I2C1_SDA" value="0xa"/>
        <value name="I2C1_SCL" caption="I2C1_SCL" value="0xb"/>
        <value name="PWM0_OUT" caption="PWM0_OUT" value="0xc"/>
        <value name="PWM1_OUT" caption="PWM1_OUT" value="0xd"/>
        <value name="PWM2_OUT" caption="PWM2_OUT" value="0xe"/>
        <value name="PWM3_OUT" caption="PWM3_OUT" value="0xf"/>
        <value name="32KHZ_CLK" caption="32KHZ_CLK" value="0x10"/>
        <value name="COEX_WLAN_TX" caption="COEX_WLAN_TX" value="0x11"/>
        <value name="COEX_WLAN_RX" caption="COEX_WLAN_RX" value="0x12"/>
        <value name="COEX_BLE_TX" caption="COEX_BLE_TX" value="0x13"/>
        <value name="COEX_BLE_RX" caption="COEX_BLE_RX" value="0x14"/>
        <value name="COEX_BLE_IN_PROCESS" caption="COEX_BLE_IN_PROCESS" value="0x15"/>
        <value name="COEX_BLE_MBSY" caption="COEX_BLE_MBSY" value="0x16"/>
        <value name="COEX_BLE_SYNC" caption="COEX_BLE_SYNC" value="0x17"/>
        <value name="COEX_BLE_RXNTX" caption="COEX_BLE_RXNTX" value="0x18"/>
        <value name="COEX_BLE_PTI_0" caption="COEX_BLE_PTI_0" value="0x19"/>
        <value name="COEX_BLE_PTI_1" caption="COEX_BLE_PTI_1" value="0x1a"/>
        <value name="COEX_BLE_PTI_2" caption="COEX_BLE_PTI_2" value="0x1b"/>
        <value name="COEX_BLE_PTI_3" caption="COEX_BLE_PTI_3" value="0x1c"/>
        <value name="QUAD_DEC0_A" caption="QUAD_DEC0_A" value="0x1d"/>
        <value name="QUAD_DEC0_B" caption="QUAD_DEC0_B" value="0x1e"/>
        <value name="QUAD_DEC1_A" caption="QUAD_DEC1_A" value="0x1f"/>
        <value name="QUAD_DEC1_B" caption="QUAD_DEC1_B" value="0x20"/>
        <value name="QUAD_DEC2_A" caption="QUAD_DEC2_A" value="0x21"/>
        <value name="QUAD_DEC2_B" caption="QUAD_DEC2_B" value="0x22"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_5_LP_GPIO_20">
        <value name="UART0_RXD" caption="UART0_RXD" value="0x0"/>
        <value name="UART0_TXD" caption="UART0_TXD" value="0x1"/>
        <value name="UART0_CTS" caption="UART0_CTS" value="0x2"/>
        <value name="UART0_RTS" caption="UART0_RTS" value="0x3"/>
        <value name="UART1_RXD" caption="UART1_RXD" value="0x4"/>
        <value name="UART1_TXD" caption="UART1_TXD" value="0x5"/>
        <value name="UART1_CTS" caption="UART1_CTS" value="0x6"/>
        <value name="UART1_RTS" caption="UART1_RTS" value="0x7"/>
        <value name="I2C0_SDA" caption="I2C0_SDA" value="0x8"/>
        <value name="I2C0_SCL" caption="I2C0_SCL" value="0x9"/>
        <value name="I2C1_SDA" caption="I2C1_SDA" value="0xa"/>
        <value name="I2C1_SCL" caption="I2C1_SCL" value="0xb"/>
        <value name="PWM0_OUT" caption="PWM0_OUT" value="0xc"/>
        <value name="PWM1_OUT" caption="PWM1_OUT" value="0xd"/>
        <value name="PWM2_OUT" caption="PWM2_OUT" value="0xe"/>
        <value name="PWM3_OUT" caption="PWM3_OUT" value="0xf"/>
        <value name="32KHZ_CLK" caption="32KHZ_CLK" value="0x10"/>
        <value name="COEX_WLAN_TX" caption="COEX_WLAN_TX" value="0x11"/>
        <value name="COEX_WLAN_RX" caption="COEX_WLAN_RX" value="0x12"/>
        <value name="COEX_BLE_TX" caption="COEX_BLE_TX" value="0x13"/>
        <value name="COEX_BLE_RX" caption="COEX_BLE_RX" value="0x14"/>
        <value name="COEX_BLE_IN_PROCESS" caption="COEX_BLE_IN_PROCESS" value="0x15"/>
        <value name="COEX_BLE_MBSY" caption="COEX_BLE_MBSY" value="0x16"/>
        <value name="COEX_BLE_SYNC" caption="COEX_BLE_SYNC" value="0x17"/>
        <value name="COEX_BLE_RXNTX" caption="COEX_BLE_RXNTX" value="0x18"/>
        <value name="COEX_BLE_PTI_0" caption="COEX_BLE_PTI_0" value="0x19"/>
        <value name="COEX_BLE_PTI_1" caption="COEX_BLE_PTI_1" value="0x1a"/>
        <value name="COEX_BLE_PTI_2" caption="COEX_BLE_PTI_2" value="0x1b"/>
        <value name="COEX_BLE_PTI_3" caption="COEX_BLE_PTI_3" value="0x1c"/>
        <value name="QUAD_DEC0_A" caption="QUAD_DEC0_A" value="0x1d"/>
        <value name="QUAD_DEC0_B" caption="QUAD_DEC0_B" value="0x1e"/>
        <value name="QUAD_DEC1_A" caption="QUAD_DEC1_A" value="0x1f"/>
        <value name="QUAD_DEC1_B" caption="QUAD_DEC1_B" value="0x20"/>
        <value name="QUAD_DEC2_A" caption="QUAD_DEC2_A" value="0x21"/>
        <value name="QUAD_DEC2_B" caption="QUAD_DEC2_B" value="0x22"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_5_LP_GPIO_21">
        <value name="UART0_RXD" caption="UART0_RXD" value="0x0"/>
        <value name="UART0_TXD" caption="UART0_TXD" value="0x1"/>
        <value name="UART0_CTS" caption="UART0_CTS" value="0x2"/>
        <value name="UART0_RTS" caption="UART0_RTS" value="0x3"/>
        <value name="UART1_RXD" caption="UART1_RXD" value="0x4"/>
        <value name="UART1_TXD" caption="UART1_TXD" value="0x5"/>
        <value name="UART1_CTS" caption="UART1_CTS" value="0x6"/>
        <value name="UART1_RTS" caption="UART1_RTS" value="0x7"/>
        <value name="I2C0_SDA" caption="I2C0_SDA" value="0x8"/>
        <value name="I2C0_SCL" caption="I2C0_SCL" value="0x9"/>
        <value name="I2C1_SDA" caption="I2C1_SDA" value="0xa"/>
        <value name="I2C1_SCL" caption="I2C1_SCL" value="0xb"/>
        <value name="PWM0_OUT" caption="PWM0_OUT" value="0xc"/>
        <value name="PWM1_OUT" caption="PWM1_OUT" value="0xd"/>
        <value name="PWM2_OUT" caption="PWM2_OUT" value="0xe"/>
        <value name="PWM3_OUT" caption="PWM3_OUT" value="0xf"/>
        <value name="32KHZ_CLK" caption="32KHZ_CLK" value="0x10"/>
        <value name="COEX_WLAN_TX" caption="COEX_WLAN_TX" value="0x11"/>
        <value name="COEX_WLAN_RX" caption="COEX_WLAN_RX" value="0x12"/>
        <value name="COEX_BLE_TX" caption="COEX_BLE_TX" value="0x13"/>
        <value name="COEX_BLE_RX" caption="COEX_BLE_RX" value="0x14"/>
        <value name="COEX_BLE_IN_PROCESS" caption="COEX_BLE_IN_PROCESS" value="0x15"/>
        <value name="COEX_BLE_MBSY" caption="COEX_BLE_MBSY" value="0x16"/>
        <value name="COEX_BLE_SYNC" caption="COEX_BLE_SYNC" value="0x17"/>
        <value name="COEX_BLE_RXNTX" caption="COEX_BLE_RXNTX" value="0x18"/>
        <value name="COEX_BLE_PTI_0" caption="COEX_BLE_PTI_0" value="0x19"/>
        <value name="COEX_BLE_PTI_1" caption="COEX_BLE_PTI_1" value="0x1a"/>
        <value name="COEX_BLE_PTI_2" caption="COEX_BLE_PTI_2" value="0x1b"/>
        <value name="COEX_BLE_PTI_3" caption="COEX_BLE_PTI_3" value="0x1c"/>
        <value name="QUAD_DEC0_A" caption="QUAD_DEC0_A" value="0x1d"/>
        <value name="QUAD_DEC0_B" caption="QUAD_DEC0_B" value="0x1e"/>
        <value name="QUAD_DEC1_A" caption="QUAD_DEC1_A" value="0x1f"/>
        <value name="QUAD_DEC1_B" caption="QUAD_DEC1_B" value="0x20"/>
        <value name="QUAD_DEC2_A" caption="QUAD_DEC2_A" value="0x21"/>
        <value name="QUAD_DEC2_B" caption="QUAD_DEC2_B" value="0x22"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_5_LP_GPIO_22">
        <value name="UART0_RXD" caption="UART0_RXD" value="0x0"/>
        <value name="UART0_TXD" caption="UART0_TXD" value="0x1"/>
        <value name="UART0_CTS" caption="UART0_CTS" value="0x2"/>
        <value name="UART0_RTS" caption="UART0_RTS" value="0x3"/>
        <value name="UART1_RXD" caption="UART1_RXD" value="0x4"/>
        <value name="UART1_TXD" caption="UART1_TXD" value="0x5"/>
        <value name="UART1_CTS" caption="UART1_CTS" value="0x6"/>
        <value name="UART1_RTS" caption="UART1_RTS" value="0x7"/>
        <value name="I2C0_SDA" caption="I2C0_SDA" value="0x8"/>
        <value name="I2C0_SCL" caption="I2C0_SCL" value="0x9"/>
        <value name="I2C1_SDA" caption="I2C1_SDA" value="0xa"/>
        <value name="I2C1_SCL" caption="I2C1_SCL" value="0xb"/>
        <value name="PWM0_OUT" caption="PWM0_OUT" value="0xc"/>
        <value name="PWM1_OUT" caption="PWM1_OUT" value="0xd"/>
        <value name="PWM2_OUT" caption="PWM2_OUT" value="0xe"/>
        <value name="PWM3_OUT" caption="PWM3_OUT" value="0xf"/>
        <value name="32KHZ_CLK" caption="32KHZ_CLK" value="0x10"/>
        <value name="COEX_WLAN_TX" caption="COEX_WLAN_TX" value="0x11"/>
        <value name="COEX_WLAN_RX" caption="COEX_WLAN_RX" value="0x12"/>
        <value name="COEX_BLE_TX" caption="COEX_BLE_TX" value="0x13"/>
        <value name="COEX_BLE_RX" caption="COEX_BLE_RX" value="0x14"/>
        <value name="COEX_BLE_IN_PROCESS" caption="COEX_BLE_IN_PROCESS" value="0x15"/>
        <value name="COEX_BLE_MBSY" caption="COEX_BLE_MBSY" value="0x16"/>
        <value name="COEX_BLE_SYNC" caption="COEX_BLE_SYNC" value="0x17"/>
        <value name="COEX_BLE_RXNTX" caption="COEX_BLE_RXNTX" value="0x18"/>
        <value name="COEX_BLE_PTI_0" caption="COEX_BLE_PTI_0" value="0x19"/>
        <value name="COEX_BLE_PTI_1" caption="COEX_BLE_PTI_1" value="0x1a"/>
        <value name="COEX_BLE_PTI_2" caption="COEX_BLE_PTI_2" value="0x1b"/>
        <value name="COEX_BLE_PTI_3" caption="COEX_BLE_PTI_3" value="0x1c"/>
        <value name="QUAD_DEC0_A" caption="QUAD_DEC0_A" value="0x1d"/>
        <value name="QUAD_DEC0_B" caption="QUAD_DEC0_B" value="0x1e"/>
        <value name="QUAD_DEC1_A" caption="QUAD_DEC1_A" value="0x1f"/>
        <value name="QUAD_DEC1_B" caption="QUAD_DEC1_B" value="0x20"/>
        <value name="QUAD_DEC2_A" caption="QUAD_DEC2_A" value="0x21"/>
        <value name="QUAD_DEC2_B" caption="QUAD_DEC2_B" value="0x22"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_MEGA_MUX_IO_SEL_5_LP_GPIO_23">
        <value name="UART0_RXD" caption="UART0_RXD" value="0x0"/>
        <value name="UART0_TXD" caption="UART0_TXD" value="0x1"/>
        <value name="UART0_CTS" caption="UART0_CTS" value="0x2"/>
        <value name="UART0_RTS" caption="UART0_RTS" value="0x3"/>
        <value name="UART1_RXD" caption="UART1_RXD" value="0x4"/>
        <value name="UART1_TXD" caption="UART1_TXD" value="0x5"/>
        <value name="UART1_CTS" caption="UART1_CTS" value="0x6"/>
        <value name="UART1_RTS" caption="UART1_RTS" value="0x7"/>
        <value name="I2C0_SDA" caption="I2C0_SDA" value="0x8"/>
        <value name="I2C0_SCL" caption="I2C0_SCL" value="0x9"/>
        <value name="I2C1_SDA" caption="I2C1_SDA" value="0xa"/>
        <value name="I2C1_SCL" caption="I2C1_SCL" value="0xb"/>
        <value name="PWM0_OUT" caption="PWM0_OUT" value="0xc"/>
        <value name="PWM1_OUT" caption="PWM1_OUT" value="0xd"/>
        <value name="PWM2_OUT" caption="PWM2_OUT" value="0xe"/>
        <value name="PWM3_OUT" caption="PWM3_OUT" value="0xf"/>
        <value name="32KHZ_CLK" caption="32KHZ_CLK" value="0x10"/>
        <value name="COEX_WLAN_TX" caption="COEX_WLAN_TX" value="0x11"/>
        <value name="COEX_WLAN_RX" caption="COEX_WLAN_RX" value="0x12"/>
        <value name="COEX_BLE_TX" caption="COEX_BLE_TX" value="0x13"/>
        <value name="COEX_BLE_RX" caption="COEX_BLE_RX" value="0x14"/>
        <value name="COEX_BLE_IN_PROCESS" caption="COEX_BLE_IN_PROCESS" value="0x15"/>
        <value name="COEX_BLE_MBSY" caption="COEX_BLE_MBSY" value="0x16"/>
        <value name="COEX_BLE_SYNC" caption="COEX_BLE_SYNC" value="0x17"/>
        <value name="COEX_BLE_RXNTX" caption="COEX_BLE_RXNTX" value="0x18"/>
        <value name="COEX_BLE_PTI_0" caption="COEX_BLE_PTI_0" value="0x19"/>
        <value name="COEX_BLE_PTI_1" caption="COEX_BLE_PTI_1" value="0x1a"/>
        <value name="COEX_BLE_PTI_2" caption="COEX_BLE_PTI_2" value="0x1b"/>
        <value name="COEX_BLE_PTI_3" caption="COEX_BLE_PTI_3" value="0x1c"/>
        <value name="QUAD_DEC0_A" caption="QUAD_DEC0_A" value="0x1d"/>
        <value name="QUAD_DEC0_B" caption="QUAD_DEC0_B" value="0x1e"/>
        <value name="QUAD_DEC1_A" caption="QUAD_DEC1_A" value="0x1f"/>
        <value name="QUAD_DEC1_B" caption="QUAD_DEC1_B" value="0x20"/>
        <value name="QUAD_DEC2_A" caption="QUAD_DEC2_A" value="0x21"/>
        <value name="QUAD_DEC2_B" caption="QUAD_DEC2_B" value="0x22"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_QUAD_DEC0_CTRL_CLOCK_SEL">
        <value name="0" caption="26MHz" value="0x0"/>
        <value name="1" caption="13MHz" value="0x1"/>
        <value name="2" caption="6.5MHz" value="0x2"/>
        <value name="3" caption="3.25MHz" value="0x3"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_QUAD_DEC1_CTRL_CLOCK_SEL">
        <value name="0" caption="26MHz" value="0x0"/>
        <value name="1" caption="13MHz" value="0x1"/>
        <value name="2" caption="6.5MHz" value="0x2"/>
        <value name="3" caption="3.25MHz" value="0x3"/>
      </value-group>
      <value-group name="LPMCU_MISC_REGS_QUAD_DEC2_CTRL_CLOCK_SEL">
        <value name="0" caption="26MHz" value="0x0"/>
        <value name="1" caption="13MHz" value="0x1"/>
        <value name="2" caption="6.5MHz" value="0x2"/>
        <value name="3" caption="3.25MHz" value="0x3"/>
      </value-group>
    </module>
    <module name="LP_CLK_CAL_REGS" id="LPCCR1234" version="1.0.0" caption="Low Power Clock Calibration Registers">
      <register-group name="LP_CLK_CAL_REGS" caption="Low Power Clock Calibration Registers">
        <register name="CONFIG_REG" offset="0x0" rw="RW" size="2" initval="0x0000" caption="Configuration of the calibration clocks and the enable of calibration">
          <bitfield name="NUMBER_CALIB_CLKS" mask="0x000F" values="LP_CLK_CAL_REGS_CONFIG_REG_NUMBER_CALIB_CLKS" caption="Multiplier value for the number of calibration clocks (1 shifted left by _value_)"/>
          <bitfield name="START_RTC_CALIB" mask="0x0040" caption="If set, this will start the calibration of the RTC (32.768 kHz) clock"/>
          <bitfield name="START_OSC_CALIB" mask="0x0080" caption="If set, this will start the calibration of the OSC (32 kHz) clock"/>
          <bitfield name="IRQ_CONTROL" mask="0xC000" values="LP_CLK_CAL_REGS_CONFIG_REG_IRQ_CONTROL" caption="Interrupt Control"/>
        </register>
        <register name="CALIB_OSC_COUNT_REG" offset="0x4" rw="R" size="4" initval="0x00008000" caption="Calibration OSC Count Register (Any write sets bit 15 and clears bit 31)">
          <bitfield name="CAL_FRAC_COUNT" mask="0x00007FFF" caption="This is the fractional part of the calibration counter"/>
          <bitfield name="NO_CAL_IN_PROGRESS" mask="0x00008000" caption="Indicates no calibration is running (any write sets this to a 1, 0 when calibration done)"/>
          <bitfield name="CAL_INT_COUNT" mask="0x7FFF0000" caption="This is the integer part of the calibration counter"/>
          <bitfield name="CAL_DONE" mask="0x80000000" caption="Indicates calibration is done (any write clears this to a 0)"/>
        </register>
        <register name="CALIB_RTC_COUNT_REG" offset="0x8" rw="R" size="4" initval="0x00008000" caption="Calibration RTC Count Register (Any write sets bit 15 and clears bit 31)">
          <bitfield name="CAL_FRAC_COUNT" mask="0x00007FFF" caption="This is the fractional part of the calibration counter"/>
          <bitfield name="NO_CAL_IN_PROGRESS" mask="0x00008000" caption="Indicates no calibration is running (any write sets this to a 1, 0 when calibration done)"/>
          <bitfield name="CAL_INT_COUNT" mask="0x7FFF0000" caption="This is the integer part of the calibration counter"/>
          <bitfield name="CAL_DONE" mask="0x80000000" caption="Indicates calibration is done (any write clears this to a 0)"/>
        </register>
        <register name="CALIB_STATUS_REG" offset="0xC" rw="R" size="1" initval="0x00" caption="Calibration Status Register">
          <bitfield name="CALIBRATION_OSC_DONE" mask="0x01" caption="This is the done flag for calibrating the osc clock"/>
          <bitfield name="CALIBRATION_RTC_DONE" mask="0x02" caption="This is the done flag for calibrating the rtc clock"/>
          <bitfield name="OSC_CAL_RUNNING" mask="0x10" caption="OSC clock calibration in progress"/>
          <bitfield name="RTC_CAL_RUNNING" mask="0x20" caption="RTC clock calibration in progress"/>
        </register>
      </register-group>
      <value-group name="LP_CLK_CAL_REGS_CONFIG_REG_NUMBER_CALIB_CLKS">
        <value name="0" caption="1 clock" value="0x0"/>
        <value name="1" caption="2 clocks" value="0x1"/>
        <value name="2" caption="4 clocks" value="0x2"/>
        <value name="3" caption="8 clocks" value="0x3"/>
        <value name="4" caption="16 clocks" value="0x4"/>
        <value name="5" caption="32 clocks" value="0x5"/>
        <value name="6" caption="64 clocks" value="0x6"/>
        <value name="7" caption="128 clocks" value="0x7"/>
        <value name="8" caption="256 clocks" value="0x8"/>
        <value name="9" caption="512 clocks" value="0x9"/>
        <value name="10" caption="1024 clocks" value="0xa"/>
        <value name="11" caption="2048 clocks" value="0xb"/>
        <value name="12" caption="4096 clocks" value="0xc"/>
        <value name="13" caption="8192 clocks" value="0xd"/>
        <value name="14" caption="16384 clocks" value="0xe"/>
        <value name="15" caption="32768 clocks" value="0xf"/>
      </value-group>
      <value-group name="LP_CLK_CAL_REGS_CONFIG_REG_IRQ_CONTROL">
        <value name="0" caption="IRQ when OSC calibration done" value="0x0"/>
        <value name="1" caption="IRQ when RTC calibration done" value="0x1"/>
        <value name="2" caption="IRQ when OSC or RTC calibration done" value="0x2"/>
        <value name="3" caption="IRQ when OSC and RTC calibration done" value="0x3"/>
      </value-group>
    </module>
    <module name="AON_SLEEP_TIMER" id="AONST1234" version="1.0.0" caption="Always On Sleep Timer">
      <register-group name="AON_SLEEP_TIMER" caption="Always On Sleep Timer">
        <register name="CONTROL" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Control for the Always On Sleep Timer">
          <bitfield name="RELOAD_ENABLE" mask="0x00000001" caption="Active High Reload Enable"/>
          <bitfield name="SINGLE_COUNT_ENABLE" mask="0x00000002" caption="Rising Edge Single Count Enable"/>
          <bitfield name="IRQ_CLEAR" mask="0x00000010" caption="Clears the interrupt. Auto clear. Must only be set after receiving the IRQ."/>
          <bitfield name="SLP_TIMER_CLK_RELOAD_DLY" mask="0x00000300" caption="Current Status of slp_timer_clk_reload on the sleep clock"/>
          <bitfield name="SLP_TIMER_SINGLE_COUNT_ENABLE_DLY" mask="0x00007000" caption="Current status of slp_timer_clk_single_count_enable on the sleep clock"/>
          <bitfield name="SLEEP_TIMER_ACTIVE" mask="0x40000000" caption="If 1, indicates that the current sleep tiemr value is not 0"/>
          <bitfield name="SLEEP_TIMER_NOT_ACTIVE" mask="0x80000000" caption="If 1, indicates that the current sleep timer value is 0"/>
        </register>
