Duet3D/Duet3Expansion/src/atmel/SAMB11_DFP/2.3.190/atdf/ATSAMB11G18A.atdf
        <register name="AON_GLOBAL_RESET" offset="0x10" rw="RW" size="1" initval="0x1B" caption="Active Low Always On Reset Control">
          <bitfield name="GLOBAL_RSTN" mask="0x01" caption="Global Reset"/>
          <bitfield name="SLEEP_TIMER_RSTN" mask="0x02" caption="Sleep Timer Reset"/>
          <bitfield name="BLE_LP_RSTN" mask="0x08" caption="BLE Low Power Reset"/>
          <bitfield name="PD4_RSTN" mask="0x10" caption="Allow the SW to force PD4 into reset"/>
        </register>
        <register name="AON_PULL_ENABLE" offset="0x14" rw="RW" size="1" initval="0x0" caption="Active Low Always On Pull Enable Control">
          <bitfield name="AO_GPIO_0" mask="0x1" caption="Pull Enable for AO_GPIO_0"/>
          <bitfield name="AO_GPIO_1" mask="0x2" caption="Pull Enable for AO_GPIO_1"/>
          <bitfield name="AO_GPIO_2" mask="0x4" caption="Pull Enable for AO_GPIO_2"/>
        </register>
        <register name="AON_RESET_CTRL" offset="0x1C" rw="RW" size="4" initval="0x3A0A0" caption="Reset Count Control for PD1, PD4, PD6 and PD7">
          <bitfield name="PD1_COUNT" mask="0x000F0" caption="Number of clock cycles to delay the PD1 reset. (also for PD7) Upper 4 MSBs only (bits 3:0 will be forced to 0)"/>
          <bitfield name="PD4_COUNT" mask="0x0F000" caption="Number of clock cycles to delay the PD4 reset. Upper 4 MSBs only (bits 3:0 will be forced to 0)"/>
          <bitfield name="PD6_COUNT" mask="0xF0000" caption="Number of clock cycles to delay the PD6 reset"/>
        </register>
        <register name="AON_BTRIM_ACTIVE" offset="0x20" rw="RW" size="1" initval="0x8" caption="BTRIM settings for active mode (i.e. not in retention)">
          <bitfield name="AON_BTRIM_ACTIVE" mask="0xF"/>
        </register>
        <register name="AON_BTRIM_RETENTION" offset="0x24" rw="RW" size="1" initval="0x8" caption="BTRIM settings for retention mode">
          <bitfield name="AON_BTRIM_RETENTION" mask="0xF"/>
        </register>
        <register name="AON_LPMCU_SCRATCH_PAD" offset="0x40" rw="RW" size="1" initval="0x00" caption="Usage for the LPMCU for any sort of status it needs to store for itself before it goes to sleep">
          <bitfield name="AON_LPMCU_SCRATCH_PAD" mask="0xFF"/>
        </register>
        <register name="AON_LPMCU_COLD_BOOT" offset="0x44" rw="RW" size="1" initval="0x78" caption="To be used by ARM to determine if it is a cold boot or not">
          <bitfield name="AON_LPMCU_COLD_BOOT" mask="0xFF"/>
        </register>
        <register name="AON_BO_OUT_STATUS" offset="0x80" rw="R" size="1" initval="0x0" caption="Brown Out Detected (must be cleared manually)">
          <bitfield name="AON_BO_OUT_STATUS" mask="0x1"/>
        </register>
        <register name="CLEAR_BROWN_OUT_REG" offset="0x84" rw="RW" size="1" initval="0x0" caption="Set to 1 to clear (hold until 0 read at aon_bo_out_status and then this must be cleared to detect another brown out condition)">
          <bitfield name="CLEAR_BROWN_OUT_REG" mask="0x1"/>
        </register>
        <register name="RF_PMU_REGS_0" offset="0x400" rw="RW" size="4" initval="0x0F600409" caption="RF PMU Registers">
          <bitfield name="CLK_EDGE_SEL" mask="0x00000001" values="AON_GP_REGS_RF_PMU_REGS_0_CLK_EDGE_SEL" caption="Select clock edge for Vreg comparator in buck converter"/>
          <bitfield name="VOUT_CTRL_BUCK" mask="0x0000001E" values="AON_GP_REGS_RF_PMU_REGS_0_VOUT_CTRL_BUCK" caption="Select the output voltage of the buck converter"/>
          <bitfield name="CLK_2_4" mask="0x00000020" values="AON_GP_REGS_RF_PMU_REGS_0_CLK_2_4" caption="Comparator clock divider in buck converter"/>
          <bitfield name="VREG_FILT_CTRL" mask="0x000000C0" caption="Not Used"/>
          <bitfield name="CLK_DIV" mask="0x00000700" values="AON_GP_REGS_RF_PMU_REGS_0_CLK_DIV" caption="Programmable divider that sets the on duration of positive charging pulse"/>
          <bitfield name="RESET_FSM" mask="0x00000800" values="AON_GP_REGS_RF_PMU_REGS_0_RESET_FSM" caption="Force reset of FSM in buck converter"/>
          <bitfield name="EN_TRISTATE" mask="0x00001000" values="AON_GP_REGS_RF_PMU_REGS_0_EN_TRISTATE" caption="Allow tristate_ctrl to control minimum time between pulses of the buck converter"/>
          <bitfield name="TRISTATE_CTRL" mask="0x0000E000" values="AON_GP_REGS_RF_PMU_REGS_0_TRISTATE_CTRL" caption="Controls the minimum time between pulses in the buck converter"/>
          <bitfield name="OFFSETP_CTRL" mask="0x000F0000" values="AON_GP_REGS_RF_PMU_REGS_0_OFFSETP_CTRL" caption="Controls a fixed comparator offset in the buck converter for positive pulses"/>
          <bitfield name="OFFSETN_CTRL" mask="0x00F00000" values="AON_GP_REGS_RF_PMU_REGS_0_OFFSETN_CTRL" caption="Controls a fixed comparator offset in the buck converter for negative pulses"/>
          <bitfield name="P_SW_CTRL" mask="0x7F000000" values="AON_GP_REGS_RF_PMU_REGS_0_P_SW_CTRL" caption="Power switch units for the buck converter"/>
          <bitfield name="CLK_SEL" mask="0x80000000" values="AON_GP_REGS_RF_PMU_REGS_0_CLK_SEL" caption="Source clock for the buck converter"/>
        </register>
        <register name="RF_PMU_REGS_1" offset="0x404" rw="RW" size="4" initval="0x31888C82" caption="RF PMU Registers">
          <bitfield name="SADC_BIAS_RES_CTRL" mask="0x0000000F" values="AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL" caption="Internal reference voltage level for sensor ADC"/>
          <bitfield name="SADC_REF_SEL" mask="0x00000070" values="AON_GP_REGS_RF_PMU_REGS_1_SADC_REF_SEL" caption="Reference Voltage Source for the Sensor ADC"/>
          <bitfield name="BOD_EN" mask="0x00000080" values="AON_GP_REGS_RF_PMU_REGS_1_BOD_EN" caption="Brown Out Detector Enable Control"/>
          <bitfield name="LPD_CLK_INJECT_EN" mask="0x00000100" values="AON_GP_REGS_RF_PMU_REGS_1_LPD_CLK_INJECT_EN" caption="Low Power Domain Clock Injection Enable Control"/>
          <bitfield name="EFUSE_LDO_BYP" mask="0x00000200" values="AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_BYP" caption="Bypass controlf for EFUSE LDO"/>
          <bitfield name="EFUSE_LDO_VOUT_CTRL" mask="0x00001C00" values="AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_VOUT_CTRL" caption="Output voltage of EFUSE LDO"/>
          <bitfield name="EFUSE_LDO_IBIAS_CTRL" mask="0x00006000" values="AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_IBIAS_CTRL" caption="Set the current bias for the EFUSE LDO"/>
          <bitfield name="PIERCE_RES_CTRL" mask="0x00008000" values="AON_GP_REGS_RF_PMU_REGS_1_PIERCE_RES_CTRL" caption="RTC crystal circuit feedback resistance value"/>
          <bitfield name="PIERCE_GM_CTRL" mask="0x000F0000" values="AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL" caption="Transconductance of RTC oscillator"/>
          <bitfield name="PIERCE_CAP_CTRL" mask="0x00F00000" values="AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL" caption="On chip single ended capacitors for RTC oscillator"/>
          <bitfield name="SADC_CHN_CTRL" mask="0x01000000" values="AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_CTRL" caption="enable input channel time multiplexing to the sensor ADC"/>
          <bitfield name="SADC_CHN_SEL" mask="0x0E000000" values="AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_SEL" caption="Input channel selection for the sensor ADC"/>
          <bitfield name="CODE_IN" mask="0x30000000" values="AON_GP_REGS_RF_PMU_REGS_1_CODE_IN" caption="Optional mode to improve sub-ranging technique of the sensor ADC"/>
          <bitfield name="SADC_LP_CTRL" mask="0xC0000000" values="AON_GP_REGS_RF_PMU_REGS_1_SADC_LP_CTRL" caption="Comparator biasing current for different sampling rates of the sensor ADC"/>
        </register>
        <register name="RF_PMU_REGS_2" offset="0x408" rw="RW" size="2" initval="0x0005" caption="RF PMU Registers">
          <bitfield name="DIG_CORE_LDO_BYP" mask="0x0001" values="AON_GP_REGS_RF_PMU_REGS_2_DIG_CORE_LDO_BYP" caption="Bypass mode of digital core LDO which regulates from the buck converter output to the local power domains of each digital power island"/>
          <bitfield name="DIG_CORE_LDO_VCTRL" mask="0x0006" values="AON_GP_REGS_RF_PMU_REGS_2_DIG_CORE_LDO_VCTRL" caption="Voltage level of the digital core LDO when LDO is not in bypass mode"/>
          <bitfield name="REF_HP_MODE" mask="0x0038" values="AON_GP_REGS_RF_PMU_REGS_2_REF_HP_MODE" caption="Controls the sensor ADCs internal reference buffer output resistance"/>
          <bitfield name="OFFSET_CAL_EN" mask="0x0040" values="AON_GP_REGS_RF_PMU_REGS_2_OFFSET_CAL_EN" caption="Enable sensor ADC offset calibration"/>
          <bitfield name="RESERVED_7" mask="0x0080" caption="not using"/>
          <bitfield name="CLK_CTRL_26MHZ" mask="0x1F00" values="AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ" caption="Control the 26MHz RC oscillator frequency"/>
          <bitfield name="RESERVED_15_13" mask="0xE000" caption="not using"/>
        </register>
