Duet3D/Duet3Expansion/src/atmel/SAMB11_DFP/2.3.190/atdf/ATSAMB11G18A.atdf
      <value-group name="AON_GP_REGS_RF_PMU_REGS_0_P_SW_CTRL">
        <value name="0" caption="0 power switches enabled" value="0x0"/>
        <value name="1" caption="1 power switch enabled" value="0x1"/>
        <value name="3" caption="2 power switches enabled" value="0x3"/>
        <value name="7" caption="3 power switches enabled" value="0x7"/>
        <value name="15" caption="4 power switches enabled" value="0xf"/>
        <value name="31" caption="5 power switches enabled" value="0x1f"/>
        <value name="63" caption="6 power switches enabled" value="0x3f"/>
      </value-group>
      <value-group name="AON_GP_REGS_RF_PMU_REGS_0_CLK_SEL">
        <value name="0" caption="Internal 26MHz clock" value="0x0"/>
        <value name="1" caption="External 52MHz clock" value="0x1"/>
      </value-group>
      <value-group name="AON_GP_REGS_RF_PMU_REGS_1_SADC_BIAS_RES_CTRL">
        <value name="0" caption="0.5V" value="0x0"/>
        <value name="1" caption="0.6V" value="0x1"/>
        <value name="2" caption="0.7V" value="0x2"/>
        <value name="3" caption="0.8V" value="0x3"/>
        <value name="4" caption="0.9V" value="0x4"/>
        <value name="5" caption="1.0V" value="0x5"/>
        <value name="6" caption="1.1V (only for VBATT gt 2.0V)" value="0x6"/>
        <value name="7" caption="1.2V (only for VBATT gt 2.0V)" value="0x7"/>
        <value name="8" caption="1.3V (only for VBATT gt 2.0V)" value="0x8"/>
        <value name="9" caption="1.4V (only for VBATT gt 2.0V)" value="0x9"/>
        <value name="10" caption="1.5V (only for VBATT gt 2.0V)" value="0xa"/>
        <value name="11" caption="1.6V (only for VBATT gt 2.0V)" value="0xb"/>
        <value name="12" caption="1.7V (only for VBATT gt 2.0V)" value="0xc"/>
        <value name="13" caption="1.8V (only for VBATT gt 2.0V)" value="0xd"/>
        <value name="14" caption="1.9V (only for VBATT gt 2.0V)" value="0xe"/>
        <value name="15" caption="2.0V (only for VBATT gt 2.0V)" value="0xf"/>
      </value-group>
      <value-group name="AON_GP_REGS_RF_PMU_REGS_1_SADC_REF_SEL">
        <value name="0" caption="Buffered reference voltage" value="0x0"/>
        <value name="1" caption="IR voltage" value="0x1"/>
        <value name="2" caption="VBATT divided by 2" value="0x2"/>
        <value name="3" caption="GPIO_MS1" value="0x3"/>
        <value name="4" caption="GPIO_MS2" value="0x4"/>
        <value name="5" caption="GPIO_MS3" value="0x5"/>
        <value name="6" caption="GPIO_MS4" value="0x6"/>
        <value name="7" caption="VBATT supply voltage" value="0x7"/>
      </value-group>
      <value-group name="AON_GP_REGS_RF_PMU_REGS_1_BOD_EN">
        <value name="0" caption="Disable" value="0x0"/>
        <value name="1" caption="Enable" value="0x1"/>
      </value-group>
      <value-group name="AON_GP_REGS_RF_PMU_REGS_1_LPD_CLK_INJECT_EN">
        <value name="0" caption="Disable (Free running)" value="0x0"/>
        <value name="1" caption="Enable (Lock to XO clock)" value="0x1"/>
      </value-group>
      <value-group name="AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_BYP">
        <value name="0" caption="EFUSE LDO regulates from VBATT voltage to 2.5V" value="0x0"/>
        <value name="1" caption=" EFUSE LDO is bypass to VBATT voltage" value="0x1"/>
      </value-group>
      <value-group name="AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_VOUT_CTRL">
        <value name="0" caption="2.3V" value="0x0"/>
        <value name="1" caption="2.4V" value="0x1"/>
        <value name="2" caption="2.4V" value="0x2"/>
        <value name="3" caption="2.5V" value="0x3"/>
        <value name="4" caption="2.6V" value="0x4"/>
        <value name="5" caption="2.7V" value="0x5"/>
        <value name="6" caption="2.7V" value="0x6"/>
        <value name="7" caption="2.8V" value="0x7"/>
      </value-group>
      <value-group name="AON_GP_REGS_RF_PMU_REGS_1_EFUSE_LDO_IBIAS_CTRL">
        <value name="0" caption="80uA bias current" value="0x0"/>
        <value name="1" caption="100uA bias current" value="0x1"/>
        <value name="2" caption="120uA bias current" value="0x2"/>
        <value name="3" caption="140uA bias current" value="0x3"/>
      </value-group>
      <value-group name="AON_GP_REGS_RF_PMU_REGS_1_PIERCE_RES_CTRL">
        <value name="0" caption="20Mohm resistor" value="0x0"/>
        <value name="1" caption="30Mohm resistor" value="0x1"/>
      </value-group>
      <value-group name="AON_GP_REGS_RF_PMU_REGS_1_PIERCE_GM_CTRL">
        <value name="0" caption="75nS" value="0x0"/>
        <value name="1" caption="85nS" value="0x1"/>
        <value name="2" caption="96nS" value="0x2"/>
        <value name="3" caption="106nS" value="0x3"/>
        <value name="4" caption="116nS" value="0x4"/>
        <value name="5" caption="127nS" value="0x5"/>
        <value name="6" caption="137nS" value="0x6"/>
        <value name="7" caption="147nS" value="0x7"/>
        <value name="8" caption="158nS" value="0x8"/>
        <value name="9" caption="168nS" value="0x9"/>
        <value name="10" caption="178nS" value="0xa"/>
        <value name="11" caption="189nS" value="0xb"/>
        <value name="12" caption="199nS" value="0xc"/>
        <value name="13" caption="209nS" value="0xd"/>
        <value name="14" caption="220nS" value="0xe"/>
        <value name="15" caption="230nS" value="0xf"/>
      </value-group>
      <value-group name="AON_GP_REGS_RF_PMU_REGS_1_PIERCE_CAP_CTRL">
        <value name="0" caption="0pF" value="0x0"/>
        <value name="1" caption="1pF" value="0x1"/>
        <value name="2" caption="2pF" value="0x2"/>
        <value name="3" caption="3pF" value="0x3"/>
        <value name="4" caption="4pF" value="0x4"/>
        <value name="5" caption="5pF" value="0x5"/>
        <value name="6" caption="6pF" value="0x6"/>
        <value name="7" caption="7pF" value="0x7"/>
        <value name="8" caption="8pF" value="0x8"/>
        <value name="9" caption="9pF" value="0x9"/>
        <value name="10" caption="10pF" value="0xa"/>
        <value name="11" caption="11pF" value="0xb"/>
        <value name="12" caption="12pF" value="0xc"/>
        <value name="13" caption="13pF" value="0xd"/>
        <value name="14" caption="14pF" value="0xe"/>
        <value name="15" caption="15pF" value="0xf"/>
      </value-group>
      <value-group name="AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_CTRL">
        <value name="0" caption="Conversion is done on the four input channels in a time multiplexed manner" value="0x0"/>
        <value name="1" caption="Conversion is done for one specific input channel" value="0x1"/>
      </value-group>
      <value-group name="AON_GP_REGS_RF_PMU_REGS_1_SADC_CHN_SEL">
        <value name="0" caption="GPIO_MS1" value="0x0"/>
        <value name="1" caption="GPIO_MS2" value="0x1"/>
        <value name="2" caption="GPIO_MS3" value="0x2"/>
        <value name="3" caption="GPIO_MS4" value="0x3"/>
        <value name="4" caption="On Chip Temperature" value="0x4"/>
        <value name="5" caption="VBATT divided by 4 voltage level" value="0x5"/>
        <value name="6" caption="LP_LDO_OUT_1P2 low power domain voltage" value="0x6"/>
        <value name="7" caption="Sensor ADC reference voltage level" value="0x7"/>
      </value-group>
      <value-group name="AON_GP_REGS_RF_PMU_REGS_1_CODE_IN">
        <value name="0" caption="input dynamic range from 0V to VBATT voltage level" value="0x0"/>
        <value name="1" caption="input dynamic range from 0.08*VBATT to 0.92*VBATT" value="0x1"/>
        <value name="2" caption="input dynamic range from 0.17*VBATT to 0.83*VBATT" value="0x2"/>
        <value name="3" caption="input dynamic range from 0.25*VBATT to 0.75*VBATT" value="0x3"/>
      </value-group>
      <value-group name="AON_GP_REGS_RF_PMU_REGS_1_SADC_LP_CTRL">
        <value name="0" caption="Comparator bias current is 4uA" value="0x0"/>
        <value name="1" caption="Comparator bias current is 8uA" value="0x1"/>
        <value name="2" caption="Comparator bias current is 20uA" value="0x2"/>
        <value name="3" caption="Comparator bias current is 24uA" value="0x3"/>
      </value-group>
      <value-group name="AON_GP_REGS_RF_PMU_REGS_2_DIG_CORE_LDO_BYP">
        <value name="0" caption="Not in bypass mode" value="0x0"/>
        <value name="1" caption="Bypass mode so output will be shorted to the buck converter output" value="0x1"/>
      </value-group>
