Duet3D/Duet3Expansion/src/atmel/SAMB11_DFP/2.3.190/atdf/ATSAMB11G18A.atdf
      <value-group name="AON_GP_REGS_RF_PMU_REGS_2_DIG_CORE_LDO_VCTRL">
        <value name="0" caption="0.91V" value="0x0"/>
        <value name="1" caption="0.96V" value="0x1"/>
        <value name="2" caption="1.02V" value="0x2"/>
        <value name="3" caption="1.09V" value="0x3"/>
      </value-group>
      <value-group name="AON_GP_REGS_RF_PMU_REGS_2_REF_HP_MODE">
        <value name="0" caption="setting for applications that require less than 10KSPS" value="0x0"/>
        <value name="1" caption="setting for throughputs between 10KSPS and 100KSPS" value="0x1"/>
        <value name="2" caption="setting for 100KSPS" value="0x2"/>
        <value name="3" caption="setting for 325KSPS" value="0x3"/>
        <value name="4" caption="setting for 550KSPS" value="0x4"/>
        <value name="5" caption="setting for 775KSPS" value="0x5"/>
        <value name="6" caption="setting for 1MSPS" value="0x6"/>
      </value-group>
      <value-group name="AON_GP_REGS_RF_PMU_REGS_2_OFFSET_CAL_EN">
        <value name="0" caption="Disable" value="0x0"/>
        <value name="1" caption="Enable" value="0x1"/>
      </value-group>
      <value-group name="AON_GP_REGS_RF_PMU_REGS_2_CLK_CTRL_26MHZ">
        <value name="0" caption="12MHz" value="0x0"/>
        <value name="1" caption="13MHz" value="0x1"/>
        <value name="2" caption="14MHz" value="0x2"/>
        <value name="3" caption="15MHz" value="0x3"/>
        <value name="4" caption="16MHz" value="0x4"/>
        <value name="5" caption="17MHz" value="0x5"/>
        <value name="6" caption="18MHz" value="0x6"/>
        <value name="7" caption="19MHz" value="0x7"/>
        <value name="8" caption="20MHz" value="0x8"/>
        <value name="9" caption="21MHz" value="0x9"/>
        <value name="10" caption="22MHz" value="0xa"/>
        <value name="11" caption="23MHz" value="0xb"/>
        <value name="12" caption="24MHz" value="0xc"/>
        <value name="13" caption="25MHz" value="0xd"/>
        <value name="14" caption="26MHz" value="0xe"/>
        <value name="15" caption="27MHz" value="0xf"/>
        <value name="16" caption="28MHz" value="0x10"/>
        <value name="17" caption="29MHz" value="0x11"/>
        <value name="18" caption="30MHz" value="0x12"/>
        <value name="19" caption="31MHz" value="0x13"/>
        <value name="20" caption="32MHz" value="0x14"/>
        <value name="21" caption="33MHz" value="0x15"/>
        <value name="22" caption="34MHz" value="0x16"/>
        <value name="23" caption="35MHz" value="0x17"/>
        <value name="24" caption="36MHz" value="0x18"/>
        <value name="25" caption="37MHz" value="0x19"/>
        <value name="26" caption="38MHz" value="0x1a"/>
        <value name="27" caption="39MHz" value="0x1b"/>
        <value name="28" caption="40MHz" value="0x1c"/>
        <value name="29" caption="41MHz" value="0x1d"/>
        <value name="30" caption="42MHz" value="0x1e"/>
        <value name="31" caption="43MHz" value="0x1f"/>
      </value-group>
    </module>
    <module name="GPIO" id="G1234" version="1.0.0" caption="GPIO Controller">
      <register-group name="GPIO" caption="GPIO Controller">
        <register name="DATA" offset="0x0" rw="RW" size="2" initval="0x0000" caption="Data Value">
          <bitfield name="VALUE" mask="0xFFFF" caption="Read = Sampled at Pin : Write = To Output Data Register"/>
        </register>
        <register name="DATAOUT" offset="0x4" rw="RW" size="2" initval="0x0000" caption="Data Output Register Value">
          <bitfield name="VALUE" mask="0xFFFF" caption="Read = Current Value of Data Output Register : Write = To Output Data Register"/>
        </register>
        <register name="OUTENSET" offset="0x10" rw="RW" size="2" initval="0x0000" caption="Output Enable Set">
          <bitfield name="VALUE" mask="0xFFFF" caption="Write 1 to set the output enable bit"/>
        </register>
        <register name="OUTENCLR" offset="0x14" rw="RW" size="2" initval="0x0000" caption="Output Enable Clear">
          <bitfield name="VALUE" mask="0xFFFF" caption="Write 1 to clear the output enable bit"/>
        </register>
        <register name="INTENSET" offset="0x20" rw="RW" size="2" initval="0x0000" caption="Interrupt Enable Set">
          <bitfield name="VALUE" mask="0xFFFF" caption="Write 1 to set the enable bit"/>
        </register>
        <register name="INTENCLR" offset="0x24" rw="RW" size="2" initval="0x0000" caption="Interrupt Enable Clear">
          <bitfield name="VALUE" mask="0xFFFF" caption="Write 1 to clear the enable bit"/>
        </register>
        <register name="INTTYPESET" offset="0x28" rw="RW" size="2" initval="0x0000" caption="Interrupt Type Set">
          <bitfield name="VALUE" mask="0xFFFF" caption="Write 1 for edge"/>
        </register>
        <register name="INTTYPECLR" offset="0x2C" rw="RW" size="2" initval="0x0000" caption="Interrupt Type Clear">
          <bitfield name="VALUE" mask="0xFFFF" caption="Write 1 to clear the interrupt type"/>
        </register>
        <register name="INTPOLSET" offset="0x30" rw="RW" size="2" initval="0x0000" caption="Polarity-level, edge IRQ Configuration">
          <bitfield name="VALUE" mask="0xFFFF" caption="Write 1 for HIGH level or rising edge"/>
        </register>
        <register name="INTPOLCLR" offset="0x34" rw="RW" size="2" initval="0x0000" caption="IRQ Configuration Clear">
          <bitfield name="VALUE" mask="0xFFFF" caption="Write 1 to Clear Interrupt Polarity Bit"/>
        </register>
        <register name="INTSTATUSCLEAR" offset="0x38" rw="RW" size="2" initval="0x0000" caption="Interrupt Status">
          <bitfield name="VALUE" mask="0xFFFF" caption="Write 1 to Clear Interrupt"/>
        </register>
        <register name="PID4" offset="0xFD0" rw="R" size="1" initval="0x04" caption="Peripheral ID Register 4">
          <bitfield name="JEP106_C_CODE" mask="0x0F" caption="JEP106 C Code"/>
          <bitfield name="BLOCK_COUNT" mask="0xF0" caption="Block Count"/>
        </register>
        <register name="PID5" offset="0xFD4" rw="R" size="1" initval="0x00" caption="Peripheral ID Register 5">
          <bitfield name="PID5" mask="0xFF"/>
        </register>
