Duet3D/Duet3Expansion/src/atmel/SAMB11_DFP/2.3.190/atdf/ATSAMB11G18A.atdf
        <register name="PID6" offset="0xFD8" rw="R" size="1" initval="0x00" caption="Peripheral ID Register 6">
          <bitfield name="PID6" mask="0xFF"/>
        </register>
        <register name="PID7" offset="0xFDC" rw="R" size="1" initval="0x00" caption="Peripheral ID Register 7">
          <bitfield name="PID7" mask="0xFF"/>
        </register>
        <register name="PID0" offset="0xFE0" rw="R" size="1" initval="0x20" caption="Peripheral ID Register 0">
          <bitfield name="PART_NUMBER" mask="0xFF" caption="Part Number Bits 7:0"/>
        </register>
        <register name="PID1" offset="0xFE4" rw="R" size="1" initval="0xB8" caption="Peripheral ID Register 1">
          <bitfield name="PART_NUMBER" mask="0x0F" caption="Part Number Bits 11:8"/>
          <bitfield name="JEP106_ID_3_0" mask="0xF0" caption="JEP106 ID Bits 3:0"/>
        </register>
        <register name="PID2" offset="0xFE8" rw="R" size="1" initval="0x1B" caption="Peripheral ID Register 2">
          <bitfield name="JEP106_ID_6_4" mask="0x07" caption="JEP106 ID Bits 6:4"/>
          <bitfield name="JEDEC_USED" mask="0x08" caption="JEDEC Used"/>
          <bitfield name="REVISION" mask="0xF0" caption="Revision"/>
        </register>
        <register name="PID3" offset="0xFEC" rw="R" size="1" initval="0x00" caption="Peripheral ID Register 3">
          <bitfield name="CUSTOMER_MOD_NUMBER" mask="0x0F" caption="Customer Modification Number"/>
          <bitfield name="ECO_REV_NUMBER" mask="0xF0" caption="ECO Revision Number"/>
        </register>
        <register name="CID0" offset="0xFF0" rw="R" size="1" initval="0x0D" caption="Component ID Register 0">
          <bitfield name="CID0" mask="0xFF"/>
        </register>
        <register name="CID1" offset="0xFF4" rw="R" size="1" initval="0xF0" caption="Component ID Register 1">
          <bitfield name="CID1" mask="0xFF"/>
        </register>
        <register name="CID2" offset="0xFF8" rw="R" size="1" initval="0x05" caption="Component ID Register 2">
          <bitfield name="CID2" mask="0xFF"/>
        </register>
        <register name="CID3" offset="0xFFC" rw="R" size="1" initval="0xB1" caption="Component ID Register 3">
          <bitfield name="CID3" mask="0xFF"/>
        </register>
      </register-group>
    </module>
    <module name="SPI_FLASH" id="SF1234" version="1.0.0" caption="SPI Flash Controller">
      <register-group name="SPI_FLASH" caption="SPI Flash Controller">
        <register name="MODE_CTRL" offset="0x0" rw="RW" size="1" initval="0x00" caption="SPI Flash Mode Control">
          <bitfield name="MODE" mask="0x03" values="SPI_FLASH_MODE_CTRL_MODE" caption="SPI Modes"/>
          <bitfield name="BYPASS_CS_PRE" mask="0x04" caption="Bypass CS PRE state"/>
          <bitfield name="BYPASS_CS_POST" mask="0x08" caption="Bypass CS POST state"/>
          <bitfield name="MODE_SELECT" mask="0x80" caption="Set to 1 to use external bits for mode"/>
        </register>
        <register name="TRANSACTION_CTRL" offset="0x4" rw="RW" size="4" initval="0x00000004" caption="Transaction Control (Cleared after each transaction completes)">
          <bitfield name="CMD_COUNT" mask="0x00000007" caption="Number of bytes to be transferred or received"/>
          <bitfield name="FLASH_TRANS_START" mask="0x00000080" caption="Rising Edge Flast Transaction Start"/>
          <bitfield name="WDATA_COUNT" mask="0xFFFFFF00" caption="Number of bytes to be programmed to flash"/>
        </register>
        <register name="READ_CTRL" offset="0x8" rw="RW" size="4" initval="0x000000" caption="Read Control (Cleared after each transaction completes)">
          <bitfield name="RDATA_COUNT" mask="0xFFFFFF" caption="Number of data bytes to be read from flash"/>
        </register>
        <register name="CMD_BUFFER0" offset="0xC" rw="RW" size="4" initval="0x00000003" caption="Command Buffer 0 (Bytes 3 - 0)">
          <bitfield name="CMD_BUFFER0" mask="0xFFFFFFFF"/>
        </register>
        <register name="CMD_BUFFER1" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="Command Buffer 1 (Bytes 7 - 4)">
          <bitfield name="CMD_BUFFER1" mask="0xFFFFFFFF"/>
        </register>
        <register name="DIRECTION" offset="0x14" rw="RW" size="1" initval="0x0F" caption="Read/Write bit for Bytes 7 - 0">
          <bitfield name="DIRECTION" mask="0xFF"/>
        </register>
        <register name="IRQ_STATUS" offset="0x18" rw="W" size="1" initval="0x0" caption="IRQ Status (Write 0 to bit to clear, Read clears interupts)">
          <bitfield name="FLASH_TRANS_DONE" mask="0x1" caption="Current Flash Transaction Done"/>
          <bitfield name="AHB_ERROR_RESPONSE" mask="0x2" caption="AHB Error Response"/>
        </register>
        <register name="DMA_START_ADDRESS" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="DMA Starting Address">
          <bitfield name="DMA_START_ADDRESS" mask="0xFFFFFFFF"/>
        </register>
        <register name="CONFIG" offset="0x20" rw="RW" size="2" initval="0x103" caption="SPI Flash Configuration">
          <bitfield name="ENDIANNESS" mask="0x001" caption="1 for Little Endian"/>
          <bitfield name="REVERSE_CMD_BUFFER" mask="0x002" caption="Reverse bits of every byte in cmd_buffer"/>
          <bitfield name="RDATA_REVERSE" mask="0x004" caption="Reverse bits of every data byte read from flash"/>
          <bitfield name="REVERSE_INCOMIND_DATA" mask="0x008" caption="Reverse bits of status registers read from flash"/>
          <bitfield name="SPI_INTERFACE_CONFIG_DEBUG" mask="0x0F0" caption="Debug only"/>
          <bitfield name="WDATA_REVERSE" mask="0x100" caption="Reverse bits of every data byte written to flash"/>
        </register>
        <register name="TX_CONTROL" offset="0x24" rw="RW" size="2" initval="0x0000" caption="TX Control">
          <bitfield name="DRIVE_0_ON_TX" mask="0x0001" caption="Drive 0 on TX while reading"/>
          <bitfield name="DRIVE_1_ON_TX" mask="0x0002" caption="Drive 1 on TX while reading"/>
          <bitfield name="TOGGLE_ON_TX" mask="0x0004" caption="Toggle TX while reading"/>
          <bitfield name="DUMMY_ON_TX" mask="0x0008" caption="Send dummy_byte while reading"/>
          <bitfield name="DUMMY_BYTE" mask="0xFF00" caption="Byte to be sent for dummy_on_tx option"/>
        </register>
        <register name="STATUS" offset="0x28" rw="R" size="2" initval="0x0000" caption="Misc Status">
          <bitfield name="AHB_MASTER_STATE" mask="0x0003" values="SPI_FLASH_STATUS_AHB_MASTER_STATE" caption="AHB Master State"/>
          <bitfield name="FIFO_CTRL_STATE" mask="0x0070" values="SPI_FLASH_STATUS_FIFO_CTRL_STATE" caption="FIFO Control State"/>
          <bitfield name="SPI_MASTER_STATE" mask="0x0700" values="SPI_FLASH_STATUS_SPI_MASTER_STATE" caption="SPI Master State"/>
          <bitfield name="SPI_MASTER_CSN" mask="0x1000" caption="Inverted version of the SPI Master Chip Select"/>
        </register>
      </register-group>
      <value-group name="SPI_FLASH_MODE_CTRL_MODE">
        <value name="0" caption="Mode 0" value="0x0"/>
        <value name="1" caption="Mode 1" value="0x1"/>
        <value name="2" caption="Mode 2" value="0x2"/>
        <value name="3" caption="Mode 3" value="0x3"/>
      </value-group>
      <value-group name="SPI_FLASH_STATUS_AHB_MASTER_STATE">
        <value name="0" caption="IDLE" value="0x0"/>
        <value name="1" caption="WAIT_GRANT" value="0x1"/>
        <value name="2" caption="ADDR_PHASE" value="0x2"/>
        <value name="3" caption="DATA_PHASE" value="0x3"/>
      </value-group>
