Duet3D/Duet3Expansion/src/atmel/SAMB11_DFP/2.3.190/atdf/ATSAMB11G18A.atdf
        <register name="SCS_CID0" offset="0xFF0" rw="R" size="1" initval="0x0D" caption="Component ID Register 0">
          <bitfield name="SCS_CID0" mask="0xFF"/>
        </register>
        <register name="SCS_CID1" offset="0xFF4" rw="R" size="1" initval="0xE0" caption="Component ID Register 1">
          <bitfield name="SCS_CID1" mask="0xFF"/>
        </register>
        <register name="SCS_CID2" offset="0xFF8" rw="R" size="1" initval="0x05" caption="Component ID Register 2">
          <bitfield name="SCS_CID2" mask="0xFF"/>
        </register>
        <register name="SCS_CID3" offset="0xFFC" rw="R" size="1" initval="0xB1" caption="Component ID Register 3">
          <bitfield name="SCS_CID3" mask="0xFF"/>
        </register>
      </register-group>
      <value-group name="ARM_SYSCTRL_SYST_CSR_ENABLE">
        <value name="0" caption="Counter Disabled" value="0x0"/>
        <value name="1" caption="Counter Operating" value="0x1"/>
      </value-group>
      <value-group name="ARM_SYSCTRL_SYST_CSR_TICKINT">
        <value name="0" caption="Count to 0 does not affect the SysTick exception status" value="0x0"/>
        <value name="1" caption="Count to 0 changes the SysTick excpetion status to pending" value="0x1"/>
      </value-group>
      <value-group name="ARM_SYSCTRL_DCRSR_REGSEL">
        <value name="0" caption="ARM Core Register R0" value="0x00"/>
        <value name="1" caption="ARM Core Register R1" value="0x01"/>
        <value name="2" caption="ARM Core Register R2" value="0x02"/>
        <value name="3" caption="ARM Core Register R3" value="0x03"/>
        <value name="4" caption="ARM Core Register R4" value="0x04"/>
        <value name="5" caption="ARM Core Register R5" value="0x05"/>
        <value name="6" caption="ARM Core Register R6" value="0x06"/>
        <value name="7" caption="ARM Core Register R7" value="0x07"/>
        <value name="8" caption="ARM Core Register R8" value="0x08"/>
        <value name="9" caption="ARM Core Register R9" value="0x09"/>
        <value name="10" caption="ARM Core Register R10" value="0x0a"/>
        <value name="11" caption="ARM Core Register R11" value="0x0b"/>
        <value name="12" caption="ARM Core Register R12" value="0x0c"/>
        <value name="13" caption="Current SP" value="0x0d"/>
        <value name="14" caption="LR" value="0x0e"/>
        <value name="15" caption="DebugReturnAddress" value="0x0f"/>
        <value name="16" caption="xPSR" value="0x10"/>
        <value name="17" caption="MSP" value="0x11"/>
        <value name="18" caption="PSP" value="0x12"/>
        <value name="20" caption="CONTROL and PRIMASK" value="0x14"/>
      </value-group>
    </module>
    <module name="ARM_BPU" id="ABP1234" version="1.0.0" caption="ARM Breakpoint Control">
      <register-group name="ARM_BPU" caption="ARM Breakpoint Control">
        <register name="BP_CTRL" offset="0x0" rw="RW" size="1" initval="0x00" caption="Break Point Control Register">
          <bitfield name="ENABLE" mask="0x01" caption="BPU is Enabled"/>
          <bitfield name="KEY" mask="0x02" caption="Must Write this bit to a 1 for register write to be accepted"/>
          <bitfield name="NUM_CODE" mask="0xF0" caption="Number of breakpoint comparators"/>
        </register>
        <register name="BP_COMP0" offset="0x8" rw="RW" size="4" initval="0x1FFFFFFF" caption="Break Point Compare Register 0">
          <bitfield name="ENABLE" mask="0x00000001" caption="Comparator is enabled"/>
          <bitfield name="COMP" mask="0x1FFFFFFC" caption="Bits 28:2 of the comparison address"/>
          <bitfield name="BP_MATCH" mask="0xC0000000" values="ARM_BPU_BP_COMP0_BP_MATCH" caption="Behavior when the COMP address is matched"/>
        </register>
        <register name="BP_COMP1" offset="0xC" rw="RW" size="4" initval="0x1FFFFFFF" caption="Break Point Compare Register 1">
          <bitfield name="ENABLE" mask="0x00000001" caption="Comparator is enabled"/>
          <bitfield name="COMP" mask="0x1FFFFFFC" caption="Bits 28:2 of the comparison address"/>
          <bitfield name="BP_MATCH" mask="0xC0000000" values="ARM_BPU_BP_COMP1_BP_MATCH" caption="Behavior when the COMP address is matched"/>
        </register>
        <register name="BP_COMP2" offset="0x10" rw="RW" size="4" initval="0x1FFFFFFF" caption="Break Point Compare Register 2">
          <bitfield name="ENABLE" mask="0x00000001" caption="Comparator is enabled"/>
          <bitfield name="COMP" mask="0x1FFFFFFC" caption="Bits 28:2 of the comparison address"/>
          <bitfield name="BP_MATCH" mask="0xC0000000" values="ARM_BPU_BP_COMP2_BP_MATCH" caption="Behavior when the COMP address is matched"/>
        </register>
        <register name="BP_COMP3" offset="0x14" rw="RW" size="4" initval="0x1FFFFFFF" caption="Break Point Compare Register 3">
          <bitfield name="ENABLE" mask="0x00000001" caption="Comparator is enabled"/>
          <bitfield name="COMP" mask="0x1FFFFFFC" caption="Bits 28:2 of the comparison address"/>
          <bitfield name="BP_MATCH" mask="0xC0000000" values="ARM_BPU_BP_COMP3_BP_MATCH" caption="Behavior when the COMP address is matched"/>
        </register>
        <register name="BP_PID4" offset="0xFD0" rw="R" size="1" initval="0x04" caption="Peripheral ID Register 4">
          <bitfield name="JEP106_C_CODE" mask="0x0F" caption="JEP106 C Code"/>
          <bitfield name="BLOCK_COUNT" mask="0xF0" caption="Block Count"/>
        </register>
        <register name="BP_PID0" offset="0xFE0" rw="R" size="1" initval="0x0B" caption="Peripheral ID Register 0">
          <bitfield name="PART_NUMBER" mask="0xFF" caption="Part Number Bits 7:0"/>
        </register>
        <register name="BP_PID1" offset="0xFE4" rw="R" size="1" initval="0xB0" caption="Peripheral ID Register 1">
          <bitfield name="PART_NUMBER" mask="0x0F" caption="Part Number Bits 11:8"/>
          <bitfield name="JEP106_ID_3_0" mask="0xF0" caption="JEP106 ID Code Bits 3:0"/>
        </register>
        <register name="BP_PID2" offset="0xFE8" rw="R" size="1" initval="0x0B" caption="Peripheral ID Register 2">
          <bitfield name="JEP106_ID_6_4" mask="0x07" caption="JEP106 ID Code Bits 6:4"/>
          <bitfield name="JEDEC_USED" mask="0x08" caption="JEDEC Used"/>
          <bitfield name="REVISION" mask="0xF0" caption="Revision"/>
        </register>
