Duet3D/Duet3Expansion/src/atmel/SAMB11_DFP/2.3.190/atdf/ATSAMB11G18A.atdf
        <register name="BP_PID3" offset="0xFEC" rw="R" size="1" initval="0x00" caption="Peripheral ID Register 3">
          <bitfield name="CUSTOMER_MOD_NUMBER" mask="0x0F" caption="Customer Modification Number"/>
          <bitfield name="ECO_REV_NUMBER" mask="0xF0" caption="ECO Revision Number"/>
        </register>
        <register name="BP_CID0" offset="0xFF0" rw="R" size="1" initval="0x0D" caption="Component ID Register 0">
          <bitfield name="BP_CID0" mask="0xFF"/>
        </register>
        <register name="BP_CID1" offset="0xFF4" rw="R" size="1" initval="0xE0" caption="Component ID Register 1">
          <bitfield name="BP_CID1" mask="0xFF"/>
        </register>
        <register name="BP_CID2" offset="0xFF8" rw="R" size="1" initval="0x05" caption="Component ID Register 2">
          <bitfield name="BP_CID2" mask="0xFF"/>
        </register>
        <register name="BP_CID3" offset="0xFFC" rw="R" size="1" initval="0xB1" caption="Component ID Register 3">
          <bitfield name="BP_CID3" mask="0xFF"/>
        </register>
      </register-group>
      <value-group name="ARM_BPU_BP_COMP0_BP_MATCH">
        <value name="0" caption="No Breakpoint Matching" value="0x0"/>
        <value name="1" caption="Breakpoint on lower halfword" value="0x1"/>
        <value name="2" caption="Breakpoint on upper halfword" value="0x2"/>
        <value name="3" caption="Breakpoint on both halfwords" value="0x3"/>
      </value-group>
      <value-group name="ARM_BPU_BP_COMP1_BP_MATCH">
        <value name="0" caption="No Breakpoint Matching" value="0x0"/>
        <value name="1" caption="Breakpoint on lower halfword" value="0x1"/>
        <value name="2" caption="Breakpoint on upper halfword" value="0x2"/>
        <value name="3" caption="Breakpoint on both halfwords" value="0x3"/>
      </value-group>
      <value-group name="ARM_BPU_BP_COMP2_BP_MATCH">
        <value name="0" caption="No Breakpoint Matching" value="0x0"/>
        <value name="1" caption="Breakpoint on lower halfword" value="0x1"/>
        <value name="2" caption="Breakpoint on upper halfword" value="0x2"/>
        <value name="3" caption="Breakpoint on both halfwords" value="0x3"/>
      </value-group>
      <value-group name="ARM_BPU_BP_COMP3_BP_MATCH">
        <value name="0" caption="No Breakpoint Matching" value="0x0"/>
        <value name="1" caption="Breakpoint on lower halfword" value="0x1"/>
        <value name="2" caption="Breakpoint on upper halfword" value="0x2"/>
        <value name="3" caption="Breakpoint on both halfwords" value="0x3"/>
      </value-group>
    </module>
    <module name="ARM_DWT" id="ADWT1234" version="1.0.0" caption="ARM DWT Control">
      <register-group name="ARM_DWT" caption="ARM DWT Control">
        <register name="DWT_CTRL" offset="0x0" rw="R" size="4" initval="0x00000000" caption="Control Register">
          <bitfield name="NUMCOMP" mask="0xF0000000" caption="Number of comparators available"/>
        </register>
        <register name="DWT_PCSR" offset="0x1C" rw="R" size="4" initval="0x00000000" caption="Program Counter Sample Register">
          <bitfield name="EIASAMPLE" mask="0xFFFFFFFF" caption="Executed Instruction Address sample value"/>
        </register>
        <register name="DWT_COMP0" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="DWT Compare Register 0">
          <bitfield name="COMP" mask="0xFFFFFFFF" caption="Reference Value for Comparison"/>
        </register>
        <register name="DWT_MASK0" offset="0x24" rw="RW" size="1" initval="0x00" caption="DWT Mask Register 0">
          <bitfield name="MASK_VALUE" mask="0x1F" caption="Size of the ignore mask applied to address range matching"/>
        </register>
        <register name="DWT_FUNCTION0" offset="0x28" rw="R" size="4" initval="0x0000000" caption="DWT Function Register 0">
          <bitfield name="FUNCTION" mask="0x000000F" values="ARM_DWT_DWT_FUNCTION0_FUNCTION" caption="Select action on comparator match"/>
          <bitfield name="MATCHED" mask="0x1000000" caption="Comparator Match"/>
        </register>
        <register name="DWT_COMP1" offset="0x30" rw="RW" size="4" initval="0x00000000" caption="DWT Compare Register 1">
          <bitfield name="COMP" mask="0xFFFFFFFF" caption="Reference Value for Comparison"/>
        </register>
        <register name="DWT_MASK1" offset="0x34" rw="RW" size="1" initval="0x00" caption="DWT Mask Register 1">
          <bitfield name="MASK_VALUE" mask="0x1F" caption="Size of the ignore mask applied to address range matching"/>
        </register>
        <register name="DWT_FUNCTION1" offset="0x38" rw="R" size="4" initval="0x0000000" caption="DWT Function Register 1">
          <bitfield name="FUNCTION" mask="0x000000F" values="ARM_DWT_DWT_FUNCTION1_FUNCTION" caption="Select action on comparator match"/>
          <bitfield name="MATCHED" mask="0x1000000" caption="Comparator Match"/>
        </register>
        <register name="DWT_PID4" offset="0xFD0" rw="R" size="1" initval="0x04" caption="Peripheral ID Register 4">
          <bitfield name="JEP106_C_CODE" mask="0x0F" caption="JEP106 C Code"/>
          <bitfield name="BLOCK_COUNT" mask="0xF0" caption="Block Count"/>
        </register>
        <register name="DWT_PID0" offset="0xFE0" rw="R" size="1" initval="0x0A" caption="Peripheral ID Register 0">
          <bitfield name="PART_NUMBER" mask="0xFF" caption="Part Number Bits 7:0"/>
        </register>
        <register name="DWT_PID1" offset="0xFE4" rw="R" size="1" initval="0xB0" caption="Peripheral ID Register 1">
          <bitfield name="PART_NUMBER" mask="0x0F" caption="Part Number Bits 11:8"/>
          <bitfield name="JEP106_ID_3_0" mask="0xF0" caption="JEP106 ID Code Bits 3:0"/>
        </register>
        <register name="DWT_PID2" offset="0xFE8" rw="R" size="1" initval="0x0B" caption="Peripheral ID Register 2">
          <bitfield name="JEP106_ID_6_4" mask="0x07" caption="JEP106 ID Code Bits 6:4"/>
          <bitfield name="JEDEC_USED" mask="0x08" caption="JEDEC Used"/>
          <bitfield name="REVISION" mask="0xF0" caption="Revision"/>
        </register>
        <register name="DWT_PID3" offset="0xFEC" rw="R" size="1" initval="0x00" caption="Peripheral ID Register 3">
          <bitfield name="CUSTOMER_MOD_NUMBER" mask="0x0F" caption="Customer Modification Number"/>
          <bitfield name="ECO_REV_NUMBER" mask="0xF0" caption="ECO Revision Number"/>
        </register>
