Duet3D/Duet3Expansion/src/atmel/SAMB11_DFP/2.3.190/atdf/ATSAMB11G18A.atdf
        <register name="DWT_CID0" offset="0xFF0" rw="R" size="1" initval="0x0D" caption="Component ID Register 0">
          <bitfield name="DWT_CID0" mask="0xFF"/>
        </register>
        <register name="DWT_CID1" offset="0xFF4" rw="R" size="1" initval="0xE0" caption="Component ID Register 1">
          <bitfield name="DWT_CID1" mask="0xFF"/>
        </register>
        <register name="DWT_CID2" offset="0xFF8" rw="R" size="1" initval="0x05" caption="Component ID Register 2">
          <bitfield name="DWT_CID2" mask="0xFF"/>
        </register>
        <register name="DWT_CID3" offset="0xFFC" rw="R" size="1" initval="0xB1" caption="Component ID Register 3">
          <bitfield name="DWT_CID3" mask="0xFF"/>
        </register>
      </register-group>
      <value-group name="ARM_DWT_DWT_FUNCTION0_FUNCTION">
        <value name="0" caption="Disabled" value="0x0"/>
        <value name="4" caption="PC Watchpoint Event (Instruction)" value="0x4"/>
        <value name="5" caption="Watchpoint Event Read Only (Data)" value="0x5"/>
        <value name="6" caption="Watchpoint Event Write Only (Data)" value="0x6"/>
        <value name="7" caption="Watchpoing Event Write-Read (Data)" value="0x7"/>
      </value-group>
      <value-group name="ARM_DWT_DWT_FUNCTION1_FUNCTION">
        <value name="0" caption="Disabled" value="0x0"/>
        <value name="4" caption="PC Watchpoint Event (Instruction)" value="0x4"/>
        <value name="5" caption="Watchpoint Event Read Only (Data)" value="0x5"/>
        <value name="6" caption="Watchpoint Event Write Only (Data)" value="0x6"/>
        <value name="7" caption="Watchpoing Event Write-Read (Data)" value="0x7"/>
      </value-group>
    </module>
    <module name="ARM_ROM" id="AR1234" version="1.0.0" caption="ARM ROM">
      <register-group name="ARM_ROM" caption="ARM ROM">
        <register name="ROM_SCS" offset="0x0" rw="R" size="4" initval="0xFFF0F003" caption="Points to the SCS at 0xE000E000">
          <bitfield name="ROM_SCS" mask="0xFFFFFFFF"/>
        </register>
        <register name="ROM_DWT" offset="0x10" rw="R" size="4" initval="0xFFF02003" caption="Points to the DWT at 0xE0001000">
          <bitfield name="ROM_DWT" mask="0xFFFFFFFF"/>
        </register>
        <register name="ROM_BPU" offset="0x20" rw="R" size="4" initval="0xFFF03003" caption="Points to the BPU at 0xE0002000">
          <bitfield name="ROM_BPU" mask="0xFFFFFFFF"/>
        </register>
        <register name="ROM_EOT" offset="0x30" rw="R" size="4" initval="0x00000000" caption="End of Table Marker">
          <bitfield name="ROM_EOT" mask="0xFFFFFFFF"/>
        </register>
        <register name="ROM_CSMT" offset="0xFCC" rw="R" size="1" initval="0x1" caption="System Memory accessible through DAP">
          <bitfield name="ROM_CSMT" mask="0x1"/>
        </register>
        <register name="ROM_PID4" offset="0xFD0" rw="R" size="1" initval="0x04" caption="Peripheral ID Register 4">
          <bitfield name="JEP106_C_CODE" mask="0x0F" caption="JEP106 C Code"/>
          <bitfield name="BLOCK_COUNT" mask="0xF0" caption="Block Count"/>
        </register>
        <register name="ROM_PID0" offset="0xFE0" rw="R" size="1" initval="0x71" caption="Peripheral ID Register 0">
          <bitfield name="PART_NUMBER" mask="0xFF" caption="Part Number Bits 7:0"/>
        </register>
        <register name="ROM_PID1" offset="0xFE4" rw="R" size="1" initval="0xB4" caption="Peripheral ID Register 1">
          <bitfield name="PART_NUMBER" mask="0x0F" caption="Part Number Bits 11:8"/>
          <bitfield name="JEP106_ID_3_0" mask="0xF0" caption="JEP106 ID Code Bits 6:4"/>
        </register>
        <register name="ROM_PID2" offset="0xFE8" rw="R" size="1" initval="0x0B" caption="Peripheral ID Register 2">
          <bitfield name="JEP106_ID_6_4" mask="0x07" caption="JEP106 ID Code Bits 6:4"/>
          <bitfield name="JEDEC_USED" mask="0x08" caption="JEDEC Used"/>
          <bitfield name="REVISION" mask="0xF0" caption="Revision"/>
        </register>
        <register name="ROM_PID3" offset="0xFEC" rw="R" size="1" initval="0x00" caption="Peripheral ID Register 3">
          <bitfield name="CUSTOMER_MOD_NUMBER" mask="0x0F" caption="Customer Modification Number"/>
          <bitfield name="ECO_REV_NUMBER" mask="0xF0" caption="ECO Revision Number"/>
        </register>
        <register name="ROM_CID0" offset="0xFF0" rw="R" size="1" initval="0x0D" caption="Component ID Register 0">
          <bitfield name="ROM_CID0" mask="0xFF"/>
        </register>
        <register name="ROM_CID1" offset="0xFF4" rw="R" size="1" initval="0x10" caption="Component ID Register 1">
          <bitfield name="ROM_CID1" mask="0xFF"/>
        </register>
        <register name="ROM_CID2" offset="0xFF8" rw="R" size="1" initval="0x05" caption="Component ID Register 2">
          <bitfield name="ROM_CID2" mask="0xFF"/>
        </register>
        <register name="ROM_CID3" offset="0xFFC" rw="R" size="1" initval="0xB1" caption="Component ID Register 3">
          <bitfield name="ROM_CID3" mask="0xFF"/>
        </register>
      </register-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="SAMB11G" caption="SAMB11G">
      <pin position="1" pad="VDD_VCO"/>
      <pin position="2" pad="VDD_RF"/>
      <pin position="3" pad="RFIO"/>
      <pin position="4" pad="VDD_AMS"/>
      <pin position="5" pad="LP_GPIO_0"/>
      <pin position="6" pad="LP_GPIO_1"/>
      <pin position="7" pad="LP_GPIO_2"/>
      <pin position="8" pad="LP_GPIO_3"/>
      <pin position="9" pad="LP_GPIO_4"/>
      <pin position="10" pad="LP_GPIO_22"/>
      <pin position="11" pad="LP_GPIO_23"/>
      <pin position="12" pad="LP_GPIO_5"/>
      <pin position="13" pad="LP_GPIO_6"/>
      <pin position="14" pad="LP_GPIO_7"/>
      <pin position="15" pad="LP_GPIO_8"/>
      <pin position="16" pad="LP_GPIO_9"/>
      <pin position="17" pad="LP_GPIO_10"/>
      <pin position="18" pad="LP_GPIO_11"/>
      <pin position="19" pad="LP_GPIO_12"/>
      <pin position="20" pad="LP_GPIO_13"/>
      <pin position="21" pad="VSW"/>
      <pin position="22" pad="VBATT_BUCK"/>
      <pin position="23" pad="VDDC_PD4"/>
      <pin position="24" pad="GPIO_MS1"/>
      <pin position="25" pad="GPIO_MS2"/>
      <pin position="26" pad="CHIP_EN"/>
      <pin position="27" pad="GPIO_MS3"/>
      <pin position="28" pad="GPIO_MS4"/>
      <pin position="29" pad="LP_LDO_OUT_1P2"/>
      <pin position="30" pad="RTC_CLK_P"/>
      <pin position="31" pad="RTC_CLK_N"/>
      <pin position="32" pad="AO_TEST_MODE"/>
      <pin position="33" pad="AO_GPIO_0"/>
      <pin position="34" pad="AO_GPIO_1"/>
      <pin position="35" pad="AO_GPIO_2"/>
      <pin position="36" pad="LP_GPIO_14"/>
      <pin position="37" pad="LP_GPIO_15"/>
      <pin position="38" pad="LP_GPIO_16"/>
      <pin position="39" pad="VDDIO_0"/>
      <pin position="40" pad="LP_GPIO_17"/>
      <pin position="41" pad="LP_GPIO_18"/>
      <pin position="42" pad="LP_GPIO_19"/>
      <pin position="43" pad="LP_GPIO_20"/>
      <pin position="44" pad="XO_P"/>
      <pin position="45" pad="XO_N"/>
      <pin position="46" pad="TPP"/>
      <pin position="47" pad="TPN"/>
      <pin position="48" pad="VDD_SXDIG"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>